leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1C94, Message Object  Data Register High */
#define CAN_MO100_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019C94u)

/** Alias (User Manual Name) for CAN_MO100_EDATA5.
* To use register names with standard convension, please use CAN_MO100_EDATA5.
*/
#define	CAN_EMO100DATA5	(CAN_MO100_EDATA5)

/** \brief  1C98, Message Object  Arbitration Register */
#define CAN_MO100_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019C98u)

/** Alias (User Manual Name) for CAN_MO100_EDATA6.
* To use register names with standard convension, please use CAN_MO100_EDATA6.
*/
#define	CAN_EMO100DATA6	(CAN_MO100_EDATA6)

/** \brief  1C80, Message Object  Function Control Register */
#define CAN_MO100_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019C80u)

/** Alias (User Manual Name) for CAN_MO100_FCR.
* To use register names with standard convension, please use CAN_MO100_FCR.
*/
#define	CAN_MOFCR100	(CAN_MO100_FCR)

/** \brief  1C84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO100_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019C84u)

/** Alias (User Manual Name) for CAN_MO100_FGPR.
* To use register names with standard convension, please use CAN_MO100_FGPR.
*/
#define	CAN_MOFGPR100	(CAN_MO100_FGPR)

/** \brief  1C88, Message Object  Interrupt Pointer Register */
#define CAN_MO100_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019C88u)

/** Alias (User Manual Name) for CAN_MO100_IPR.
* To use register names with standard convension, please use CAN_MO100_IPR.
*/
#define	CAN_MOIPR100	(CAN_MO100_IPR)

/** \brief  1C9C, Message Object  Control Register */
#define CAN_MO100_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019C9Cu)

/** Alias (User Manual Name) for CAN_MO100_STAT.
* To use register names with standard convension, please use CAN_MO100_STAT.
*/
#define	CAN_MOSTAT100	(CAN_MO100_STAT)

/** \brief  1CAC, Message Object  Acceptance Mask Register */
#define CAN_MO101_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019CACu)

/** Alias (User Manual Name) for CAN_MO101_AMR.
* To use register names with standard convension, please use CAN_MO101_AMR.
*/
#define	CAN_MOAMR101	(CAN_MO101_AMR)

/** \brief  1CB8, Message Object  Arbitration Register */
#define CAN_MO101_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019CB8u)

/** Alias (User Manual Name) for CAN_MO101_AR.
* To use register names with standard convension, please use CAN_MO101_AR.
*/
#define	CAN_MOAR101	(CAN_MO101_AR)

/** \brief  1CBC, Message Object  Control Register */
#define CAN_MO101_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019CBCu)

/** Alias (User Manual Name) for CAN_MO101_CTR.
* To use register names with standard convension, please use CAN_MO101_CTR.
*/
#define	CAN_MOCTR101	(CAN_MO101_CTR)

/** \brief  1CB4, Message Object  Data Register High */
#define CAN_MO101_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019CB4u)

/** Alias (User Manual Name) for CAN_MO101_DATAH.
* To use register names with standard convension, please use CAN_MO101_DATAH.
*/
#define	CAN_MODATAH101	(CAN_MO101_DATAH)

/** \brief  1CB0, Message Object  Data Register Low */
#define CAN_MO101_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019CB0u)

/** Alias (User Manual Name) for CAN_MO101_DATAL.
* To use register names with standard convension, please use CAN_MO101_DATAL.
*/
#define	CAN_MODATAL101	(CAN_MO101_DATAL)

/** \brief  1CA0, Message Object  Function Control Register */
#define CAN_MO101_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019CA0u)

/** Alias (User Manual Name) for CAN_MO101_EDATA0.
* To use register names with standard convension, please use CAN_MO101_EDATA0.
*/
#define	CAN_EMO101DATA0	(CAN_MO101_EDATA0)

/** \brief  1CA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO101_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019CA4u)

/** Alias (User Manual Name) for CAN_MO101_EDATA1.
* To use register names with standard convension, please use CAN_MO101_EDATA1.
*/
#define	CAN_EMO101DATA1	(CAN_MO101_EDATA1)

/** \brief  1CA8, Message Object  Interrupt Pointer Register */
#define CAN_MO101_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019CA8u)

/** Alias (User Manual Name) for CAN_MO101_EDATA2.
* To use register names with standard convension, please use CAN_MO101_EDATA2.
*/
#define	CAN_EMO101DATA2	(CAN_MO101_EDATA2)

/** \brief  1CAC, Message Object  Acceptance Mask Register */
#define CAN_MO101_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019CACu)

/** Alias (User Manual Name) for CAN_MO101_EDATA3.
* To use register names with standard convension, please use CAN_MO101_EDATA3.
*/
#define	CAN_EMO101DATA3	(CAN_MO101_EDATA3)

/** \brief  1CB0, Message Object  Data Register Low */
#define CAN_MO101_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019CB0u)

/** Alias (User Manual Name) for CAN_MO101_EDATA4.
* To use register names with standard convension, please use CAN_MO101_EDATA4.
*/
#define	CAN_EMO101DATA4	(CAN_MO101_EDATA4)

/** \brief  1CB4, Message Object  Data Register High */
#define CAN_MO101_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019CB4u)

/** Alias (User Manual Name) for CAN_MO101_EDATA5.
* To use register names with standard convension, please use CAN_MO101_EDATA5.
*/
#define	CAN_EMO101DATA5	(CAN_MO101_EDATA5)

/** \brief  1CB8, Message Object  Arbitration Register */
#define CAN_MO101_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019CB8u)

/** Alias (User Manual Name) for CAN_MO101_EDATA6.
* To use register names with standard convension, please use CAN_MO101_EDATA6.
*/
#define	CAN_EMO101DATA6	(CAN_MO101_EDATA6)

/** \brief  1CA0, Message Object  Function Control Register */
#define CAN_MO101_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019CA0u)

/** Alias (User Manual Name) for CAN_MO101_FCR.
* To use register names with standard convension, please use CAN_MO101_FCR.
*/
#define	CAN_MOFCR101	(CAN_MO101_FCR)

/** \brief  1CA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO101_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019CA4u)

