leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO101_FGPR.
* To use register names with standard convension, please use CAN_MO101_FGPR.
*/
#define	CAN_MOFGPR101	(CAN_MO101_FGPR)

/** \brief  1CA8, Message Object  Interrupt Pointer Register */
#define CAN_MO101_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019CA8u)

/** Alias (User Manual Name) for CAN_MO101_IPR.
* To use register names with standard convension, please use CAN_MO101_IPR.
*/
#define	CAN_MOIPR101	(CAN_MO101_IPR)

/** \brief  1CBC, Message Object  Control Register */
#define CAN_MO101_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019CBCu)

/** Alias (User Manual Name) for CAN_MO101_STAT.
* To use register names with standard convension, please use CAN_MO101_STAT.
*/
#define	CAN_MOSTAT101	(CAN_MO101_STAT)

/** \brief  1CCC, Message Object  Acceptance Mask Register */
#define CAN_MO102_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019CCCu)

/** Alias (User Manual Name) for CAN_MO102_AMR.
* To use register names with standard convension, please use CAN_MO102_AMR.
*/
#define	CAN_MOAMR102	(CAN_MO102_AMR)

/** \brief  1CD8, Message Object  Arbitration Register */
#define CAN_MO102_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019CD8u)

/** Alias (User Manual Name) for CAN_MO102_AR.
* To use register names with standard convension, please use CAN_MO102_AR.
*/
#define	CAN_MOAR102	(CAN_MO102_AR)

/** \brief  1CDC, Message Object  Control Register */
#define CAN_MO102_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019CDCu)

/** Alias (User Manual Name) for CAN_MO102_CTR.
* To use register names with standard convension, please use CAN_MO102_CTR.
*/
#define	CAN_MOCTR102	(CAN_MO102_CTR)

/** \brief  1CD4, Message Object  Data Register High */
#define CAN_MO102_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019CD4u)

/** Alias (User Manual Name) for CAN_MO102_DATAH.
* To use register names with standard convension, please use CAN_MO102_DATAH.
*/
#define	CAN_MODATAH102	(CAN_MO102_DATAH)

/** \brief  1CD0, Message Object  Data Register Low */
#define CAN_MO102_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019CD0u)

/** Alias (User Manual Name) for CAN_MO102_DATAL.
* To use register names with standard convension, please use CAN_MO102_DATAL.
*/
#define	CAN_MODATAL102	(CAN_MO102_DATAL)

/** \brief  1CC0, Message Object  Function Control Register */
#define CAN_MO102_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019CC0u)

/** Alias (User Manual Name) for CAN_MO102_EDATA0.
* To use register names with standard convension, please use CAN_MO102_EDATA0.
*/
#define	CAN_EMO102DATA0	(CAN_MO102_EDATA0)

/** \brief  1CC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO102_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019CC4u)

/** Alias (User Manual Name) for CAN_MO102_EDATA1.
* To use register names with standard convension, please use CAN_MO102_EDATA1.
*/
#define	CAN_EMO102DATA1	(CAN_MO102_EDATA1)

/** \brief  1CC8, Message Object  Interrupt Pointer Register */
#define CAN_MO102_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019CC8u)

/** Alias (User Manual Name) for CAN_MO102_EDATA2.
* To use register names with standard convension, please use CAN_MO102_EDATA2.
*/
#define	CAN_EMO102DATA2	(CAN_MO102_EDATA2)

/** \brief  1CCC, Message Object  Acceptance Mask Register */
#define CAN_MO102_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019CCCu)

/** Alias (User Manual Name) for CAN_MO102_EDATA3.
* To use register names with standard convension, please use CAN_MO102_EDATA3.
*/
#define	CAN_EMO102DATA3	(CAN_MO102_EDATA3)

/** \brief  1CD0, Message Object  Data Register Low */
#define CAN_MO102_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019CD0u)

/** Alias (User Manual Name) for CAN_MO102_EDATA4.
* To use register names with standard convension, please use CAN_MO102_EDATA4.
*/
#define	CAN_EMO102DATA4	(CAN_MO102_EDATA4)

/** \brief  1CD4, Message Object  Data Register High */
#define CAN_MO102_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019CD4u)

/** Alias (User Manual Name) for CAN_MO102_EDATA5.
* To use register names with standard convension, please use CAN_MO102_EDATA5.
*/
#define	CAN_EMO102DATA5	(CAN_MO102_EDATA5)

/** \brief  1CD8, Message Object  Arbitration Register */
#define CAN_MO102_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019CD8u)

/** Alias (User Manual Name) for CAN_MO102_EDATA6.
* To use register names with standard convension, please use CAN_MO102_EDATA6.
*/
#define	CAN_EMO102DATA6	(CAN_MO102_EDATA6)

/** \brief  1CC0, Message Object  Function Control Register */
#define CAN_MO102_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019CC0u)

/** Alias (User Manual Name) for CAN_MO102_FCR.
* To use register names with standard convension, please use CAN_MO102_FCR.
*/
#define	CAN_MOFCR102	(CAN_MO102_FCR)

/** \brief  1CC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO102_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019CC4u)

/** Alias (User Manual Name) for CAN_MO102_FGPR.
* To use register names with standard convension, please use CAN_MO102_FGPR.
*/
#define	CAN_MOFGPR102	(CAN_MO102_FGPR)

/** \brief  1CC8, Message Object  Interrupt Pointer Register */
#define CAN_MO102_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019CC8u)

/** Alias (User Manual Name) for CAN_MO102_IPR.
* To use register names with standard convension, please use CAN_MO102_IPR.
*/
#define	CAN_MOIPR102	(CAN_MO102_IPR)

/** \brief  1CDC, Message Object  Control Register */
#define CAN_MO102_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019CDCu)

/** Alias (User Manual Name) for CAN_MO102_STAT.
* To use register names with standard convension, please use CAN_MO102_STAT.
*/
#define	CAN_MOSTAT102	(CAN_MO102_STAT)

/** \brief  1CEC, Message Object  Acceptance Mask Register */
#define CAN_MO103_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019CECu)

/** Alias (User Manual Name) for CAN_MO103_AMR.
* To use register names with standard convension, please use CAN_MO103_AMR.
*/
#define	CAN_MOAMR103	(CAN_MO103_AMR)

/** \brief  1CF8, Message Object  Arbitration Register */
#define CAN_MO103_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019CF8u)

