leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO106_STAT.
* To use register names with standard convension, please use CAN_MO106_STAT.
*/
#define	CAN_MOSTAT106	(CAN_MO106_STAT)

/** \brief  1D6C, Message Object  Acceptance Mask Register */
#define CAN_MO107_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019D6Cu)

/** Alias (User Manual Name) for CAN_MO107_AMR.
* To use register names with standard convension, please use CAN_MO107_AMR.
*/
#define	CAN_MOAMR107	(CAN_MO107_AMR)

/** \brief  1D78, Message Object  Arbitration Register */
#define CAN_MO107_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019D78u)

/** Alias (User Manual Name) for CAN_MO107_AR.
* To use register names with standard convension, please use CAN_MO107_AR.
*/
#define	CAN_MOAR107	(CAN_MO107_AR)

/** \brief  1D7C, Message Object  Control Register */
#define CAN_MO107_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019D7Cu)

/** Alias (User Manual Name) for CAN_MO107_CTR.
* To use register names with standard convension, please use CAN_MO107_CTR.
*/
#define	CAN_MOCTR107	(CAN_MO107_CTR)

/** \brief  1D74, Message Object  Data Register High */
#define CAN_MO107_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019D74u)

/** Alias (User Manual Name) for CAN_MO107_DATAH.
* To use register names with standard convension, please use CAN_MO107_DATAH.
*/
#define	CAN_MODATAH107	(CAN_MO107_DATAH)

/** \brief  1D70, Message Object  Data Register Low */
#define CAN_MO107_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019D70u)

/** Alias (User Manual Name) for CAN_MO107_DATAL.
* To use register names with standard convension, please use CAN_MO107_DATAL.
*/
#define	CAN_MODATAL107	(CAN_MO107_DATAL)

/** \brief  1D60, Message Object  Function Control Register */
#define CAN_MO107_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019D60u)

/** Alias (User Manual Name) for CAN_MO107_EDATA0.
* To use register names with standard convension, please use CAN_MO107_EDATA0.
*/
#define	CAN_EMO107DATA0	(CAN_MO107_EDATA0)

/** \brief  1D64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO107_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019D64u)

/** Alias (User Manual Name) for CAN_MO107_EDATA1.
* To use register names with standard convension, please use CAN_MO107_EDATA1.
*/
#define	CAN_EMO107DATA1	(CAN_MO107_EDATA1)

/** \brief  1D68, Message Object  Interrupt Pointer Register */
#define CAN_MO107_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019D68u)

/** Alias (User Manual Name) for CAN_MO107_EDATA2.
* To use register names with standard convension, please use CAN_MO107_EDATA2.
*/
#define	CAN_EMO107DATA2	(CAN_MO107_EDATA2)

/** \brief  1D6C, Message Object  Acceptance Mask Register */
#define CAN_MO107_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019D6Cu)

/** Alias (User Manual Name) for CAN_MO107_EDATA3.
* To use register names with standard convension, please use CAN_MO107_EDATA3.
*/
#define	CAN_EMO107DATA3	(CAN_MO107_EDATA3)

/** \brief  1D70, Message Object  Data Register Low */
#define CAN_MO107_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019D70u)

/** Alias (User Manual Name) for CAN_MO107_EDATA4.
* To use register names with standard convension, please use CAN_MO107_EDATA4.
*/
#define	CAN_EMO107DATA4	(CAN_MO107_EDATA4)

/** \brief  1D74, Message Object  Data Register High */
#define CAN_MO107_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019D74u)

/** Alias (User Manual Name) for CAN_MO107_EDATA5.
* To use register names with standard convension, please use CAN_MO107_EDATA5.
*/
#define	CAN_EMO107DATA5	(CAN_MO107_EDATA5)

/** \brief  1D78, Message Object  Arbitration Register */
#define CAN_MO107_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019D78u)

/** Alias (User Manual Name) for CAN_MO107_EDATA6.
* To use register names with standard convension, please use CAN_MO107_EDATA6.
*/
#define	CAN_EMO107DATA6	(CAN_MO107_EDATA6)

/** \brief  1D60, Message Object  Function Control Register */
#define CAN_MO107_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019D60u)

/** Alias (User Manual Name) for CAN_MO107_FCR.
* To use register names with standard convension, please use CAN_MO107_FCR.
*/
#define	CAN_MOFCR107	(CAN_MO107_FCR)

/** \brief  1D64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO107_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019D64u)

/** Alias (User Manual Name) for CAN_MO107_FGPR.
* To use register names with standard convension, please use CAN_MO107_FGPR.
*/
#define	CAN_MOFGPR107	(CAN_MO107_FGPR)

/** \brief  1D68, Message Object  Interrupt Pointer Register */
#define CAN_MO107_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019D68u)

/** Alias (User Manual Name) for CAN_MO107_IPR.
* To use register names with standard convension, please use CAN_MO107_IPR.
*/
#define	CAN_MOIPR107	(CAN_MO107_IPR)

/** \brief  1D7C, Message Object  Control Register */
#define CAN_MO107_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019D7Cu)

/** Alias (User Manual Name) for CAN_MO107_STAT.
* To use register names with standard convension, please use CAN_MO107_STAT.
*/
#define	CAN_MOSTAT107	(CAN_MO107_STAT)

/** \brief  1D8C, Message Object  Acceptance Mask Register */
#define CAN_MO108_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019D8Cu)

/** Alias (User Manual Name) for CAN_MO108_AMR.
* To use register names with standard convension, please use CAN_MO108_AMR.
*/
#define	CAN_MOAMR108	(CAN_MO108_AMR)

/** \brief  1D98, Message Object  Arbitration Register */
#define CAN_MO108_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019D98u)

/** Alias (User Manual Name) for CAN_MO108_AR.
* To use register names with standard convension, please use CAN_MO108_AR.
*/
#define	CAN_MOAR108	(CAN_MO108_AR)

/** \brief  1D9C, Message Object  Control Register */
#define CAN_MO108_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019D9Cu)

/** Alias (User Manual Name) for CAN_MO108_CTR.
* To use register names with standard convension, please use CAN_MO108_CTR.
*/
#define	CAN_MOCTR108	(CAN_MO108_CTR)

