leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1D94, Message Object  Data Register High */
#define CAN_MO108_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019D94u)

/** Alias (User Manual Name) for CAN_MO108_DATAH.
* To use register names with standard convension, please use CAN_MO108_DATAH.
*/
#define	CAN_MODATAH108	(CAN_MO108_DATAH)

/** \brief  1D90, Message Object  Data Register Low */
#define CAN_MO108_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019D90u)

/** Alias (User Manual Name) for CAN_MO108_DATAL.
* To use register names with standard convension, please use CAN_MO108_DATAL.
*/
#define	CAN_MODATAL108	(CAN_MO108_DATAL)

/** \brief  1D80, Message Object  Function Control Register */
#define CAN_MO108_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019D80u)

/** Alias (User Manual Name) for CAN_MO108_EDATA0.
* To use register names with standard convension, please use CAN_MO108_EDATA0.
*/
#define	CAN_EMO108DATA0	(CAN_MO108_EDATA0)

/** \brief  1D84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO108_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019D84u)

/** Alias (User Manual Name) for CAN_MO108_EDATA1.
* To use register names with standard convension, please use CAN_MO108_EDATA1.
*/
#define	CAN_EMO108DATA1	(CAN_MO108_EDATA1)

/** \brief  1D88, Message Object  Interrupt Pointer Register */
#define CAN_MO108_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019D88u)

/** Alias (User Manual Name) for CAN_MO108_EDATA2.
* To use register names with standard convension, please use CAN_MO108_EDATA2.
*/
#define	CAN_EMO108DATA2	(CAN_MO108_EDATA2)

/** \brief  1D8C, Message Object  Acceptance Mask Register */
#define CAN_MO108_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019D8Cu)

/** Alias (User Manual Name) for CAN_MO108_EDATA3.
* To use register names with standard convension, please use CAN_MO108_EDATA3.
*/
#define	CAN_EMO108DATA3	(CAN_MO108_EDATA3)

/** \brief  1D90, Message Object  Data Register Low */
#define CAN_MO108_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019D90u)

/** Alias (User Manual Name) for CAN_MO108_EDATA4.
* To use register names with standard convension, please use CAN_MO108_EDATA4.
*/
#define	CAN_EMO108DATA4	(CAN_MO108_EDATA4)

/** \brief  1D94, Message Object  Data Register High */
#define CAN_MO108_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019D94u)

/** Alias (User Manual Name) for CAN_MO108_EDATA5.
* To use register names with standard convension, please use CAN_MO108_EDATA5.
*/
#define	CAN_EMO108DATA5	(CAN_MO108_EDATA5)

/** \brief  1D98, Message Object  Arbitration Register */
#define CAN_MO108_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019D98u)

/** Alias (User Manual Name) for CAN_MO108_EDATA6.
* To use register names with standard convension, please use CAN_MO108_EDATA6.
*/
#define	CAN_EMO108DATA6	(CAN_MO108_EDATA6)

/** \brief  1D80, Message Object  Function Control Register */
#define CAN_MO108_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019D80u)

/** Alias (User Manual Name) for CAN_MO108_FCR.
* To use register names with standard convension, please use CAN_MO108_FCR.
*/
#define	CAN_MOFCR108	(CAN_MO108_FCR)

/** \brief  1D84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO108_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019D84u)

/** Alias (User Manual Name) for CAN_MO108_FGPR.
* To use register names with standard convension, please use CAN_MO108_FGPR.
*/
#define	CAN_MOFGPR108	(CAN_MO108_FGPR)

/** \brief  1D88, Message Object  Interrupt Pointer Register */
#define CAN_MO108_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019D88u)

/** Alias (User Manual Name) for CAN_MO108_IPR.
* To use register names with standard convension, please use CAN_MO108_IPR.
*/
#define	CAN_MOIPR108	(CAN_MO108_IPR)

/** \brief  1D9C, Message Object  Control Register */
#define CAN_MO108_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019D9Cu)

/** Alias (User Manual Name) for CAN_MO108_STAT.
* To use register names with standard convension, please use CAN_MO108_STAT.
*/
#define	CAN_MOSTAT108	(CAN_MO108_STAT)

/** \brief  1DAC, Message Object  Acceptance Mask Register */
#define CAN_MO109_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019DACu)

/** Alias (User Manual Name) for CAN_MO109_AMR.
* To use register names with standard convension, please use CAN_MO109_AMR.
*/
#define	CAN_MOAMR109	(CAN_MO109_AMR)

/** \brief  1DB8, Message Object  Arbitration Register */
#define CAN_MO109_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019DB8u)

/** Alias (User Manual Name) for CAN_MO109_AR.
* To use register names with standard convension, please use CAN_MO109_AR.
*/
#define	CAN_MOAR109	(CAN_MO109_AR)

/** \brief  1DBC, Message Object  Control Register */
#define CAN_MO109_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019DBCu)

/** Alias (User Manual Name) for CAN_MO109_CTR.
* To use register names with standard convension, please use CAN_MO109_CTR.
*/
#define	CAN_MOCTR109	(CAN_MO109_CTR)

/** \brief  1DB4, Message Object  Data Register High */
#define CAN_MO109_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019DB4u)

/** Alias (User Manual Name) for CAN_MO109_DATAH.
* To use register names with standard convension, please use CAN_MO109_DATAH.
*/
#define	CAN_MODATAH109	(CAN_MO109_DATAH)

/** \brief  1DB0, Message Object  Data Register Low */
#define CAN_MO109_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019DB0u)

/** Alias (User Manual Name) for CAN_MO109_DATAL.
* To use register names with standard convension, please use CAN_MO109_DATAL.
*/
#define	CAN_MODATAL109	(CAN_MO109_DATAL)

/** \brief  1DA0, Message Object  Function Control Register */
#define CAN_MO109_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019DA0u)

/** Alias (User Manual Name) for CAN_MO109_EDATA0.
* To use register names with standard convension, please use CAN_MO109_EDATA0.
*/
#define	CAN_EMO109DATA0	(CAN_MO109_EDATA0)

