leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1EB0, Message Object  Data Register Low */
#define CAN_MO117_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019EB0u)

/** Alias (User Manual Name) for CAN_MO117_EDATA4.
* To use register names with standard convension, please use CAN_MO117_EDATA4.
*/
#define	CAN_EMO117DATA4	(CAN_MO117_EDATA4)

/** \brief  1EB4, Message Object  Data Register High */
#define CAN_MO117_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019EB4u)

/** Alias (User Manual Name) for CAN_MO117_EDATA5.
* To use register names with standard convension, please use CAN_MO117_EDATA5.
*/
#define	CAN_EMO117DATA5	(CAN_MO117_EDATA5)

/** \brief  1EB8, Message Object  Arbitration Register */
#define CAN_MO117_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019EB8u)

/** Alias (User Manual Name) for CAN_MO117_EDATA6.
* To use register names with standard convension, please use CAN_MO117_EDATA6.
*/
#define	CAN_EMO117DATA6	(CAN_MO117_EDATA6)

/** \brief  1EA0, Message Object  Function Control Register */
#define CAN_MO117_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019EA0u)

/** Alias (User Manual Name) for CAN_MO117_FCR.
* To use register names with standard convension, please use CAN_MO117_FCR.
*/
#define	CAN_MOFCR117	(CAN_MO117_FCR)

/** \brief  1EA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO117_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019EA4u)

/** Alias (User Manual Name) for CAN_MO117_FGPR.
* To use register names with standard convension, please use CAN_MO117_FGPR.
*/
#define	CAN_MOFGPR117	(CAN_MO117_FGPR)

/** \brief  1EA8, Message Object  Interrupt Pointer Register */
#define CAN_MO117_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019EA8u)

/** Alias (User Manual Name) for CAN_MO117_IPR.
* To use register names with standard convension, please use CAN_MO117_IPR.
*/
#define	CAN_MOIPR117	(CAN_MO117_IPR)

/** \brief  1EBC, Message Object  Control Register */
#define CAN_MO117_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019EBCu)

/** Alias (User Manual Name) for CAN_MO117_STAT.
* To use register names with standard convension, please use CAN_MO117_STAT.
*/
#define	CAN_MOSTAT117	(CAN_MO117_STAT)

/** \brief  1ECC, Message Object  Acceptance Mask Register */
#define CAN_MO118_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019ECCu)

/** Alias (User Manual Name) for CAN_MO118_AMR.
* To use register names with standard convension, please use CAN_MO118_AMR.
*/
#define	CAN_MOAMR118	(CAN_MO118_AMR)

/** \brief  1ED8, Message Object  Arbitration Register */
#define CAN_MO118_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019ED8u)

/** Alias (User Manual Name) for CAN_MO118_AR.
* To use register names with standard convension, please use CAN_MO118_AR.
*/
#define	CAN_MOAR118	(CAN_MO118_AR)

/** \brief  1EDC, Message Object  Control Register */
#define CAN_MO118_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019EDCu)

/** Alias (User Manual Name) for CAN_MO118_CTR.
* To use register names with standard convension, please use CAN_MO118_CTR.
*/
#define	CAN_MOCTR118	(CAN_MO118_CTR)

/** \brief  1ED4, Message Object  Data Register High */
#define CAN_MO118_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019ED4u)

/** Alias (User Manual Name) for CAN_MO118_DATAH.
* To use register names with standard convension, please use CAN_MO118_DATAH.
*/
#define	CAN_MODATAH118	(CAN_MO118_DATAH)

/** \brief  1ED0, Message Object  Data Register Low */
#define CAN_MO118_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019ED0u)

/** Alias (User Manual Name) for CAN_MO118_DATAL.
* To use register names with standard convension, please use CAN_MO118_DATAL.
*/
#define	CAN_MODATAL118	(CAN_MO118_DATAL)

/** \brief  1EC0, Message Object  Function Control Register */
#define CAN_MO118_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019EC0u)

/** Alias (User Manual Name) for CAN_MO118_EDATA0.
* To use register names with standard convension, please use CAN_MO118_EDATA0.
*/
#define	CAN_EMO118DATA0	(CAN_MO118_EDATA0)

/** \brief  1EC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO118_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019EC4u)

/** Alias (User Manual Name) for CAN_MO118_EDATA1.
* To use register names with standard convension, please use CAN_MO118_EDATA1.
*/
#define	CAN_EMO118DATA1	(CAN_MO118_EDATA1)

/** \brief  1EC8, Message Object  Interrupt Pointer Register */
#define CAN_MO118_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019EC8u)

/** Alias (User Manual Name) for CAN_MO118_EDATA2.
* To use register names with standard convension, please use CAN_MO118_EDATA2.
*/
#define	CAN_EMO118DATA2	(CAN_MO118_EDATA2)

/** \brief  1ECC, Message Object  Acceptance Mask Register */
#define CAN_MO118_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019ECCu)

/** Alias (User Manual Name) for CAN_MO118_EDATA3.
* To use register names with standard convension, please use CAN_MO118_EDATA3.
*/
#define	CAN_EMO118DATA3	(CAN_MO118_EDATA3)

/** \brief  1ED0, Message Object  Data Register Low */
#define CAN_MO118_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019ED0u)

/** Alias (User Manual Name) for CAN_MO118_EDATA4.
* To use register names with standard convension, please use CAN_MO118_EDATA4.
*/
#define	CAN_EMO118DATA4	(CAN_MO118_EDATA4)

/** \brief  1ED4, Message Object  Data Register High */
#define CAN_MO118_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019ED4u)

/** Alias (User Manual Name) for CAN_MO118_EDATA5.
* To use register names with standard convension, please use CAN_MO118_EDATA5.
*/
#define	CAN_EMO118DATA5	(CAN_MO118_EDATA5)

/** \brief  1ED8, Message Object  Arbitration Register */
#define CAN_MO118_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019ED8u)

/** Alias (User Manual Name) for CAN_MO118_EDATA6.
* To use register names with standard convension, please use CAN_MO118_EDATA6.
*/
#define	CAN_EMO118DATA6	(CAN_MO118_EDATA6)

/** \brief  1EC0, Message Object  Function Control Register */
#define CAN_MO118_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019EC0u)

/** Alias (User Manual Name) for CAN_MO118_FCR.
* To use register names with standard convension, please use CAN_MO118_FCR.
*/
#define	CAN_MOFCR118	(CAN_MO118_FCR)

/** \brief  1EC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO118_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019EC4u)

/** Alias (User Manual Name) for CAN_MO118_FGPR.
* To use register names with standard convension, please use CAN_MO118_FGPR.
*/
#define	CAN_MOFGPR118	(CAN_MO118_FGPR)

/** \brief  1EC8, Message Object  Interrupt Pointer Register */
#define CAN_MO118_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019EC8u)

/** Alias (User Manual Name) for CAN_MO118_IPR.
* To use register names with standard convension, please use CAN_MO118_IPR.
*/
#define	CAN_MOIPR118	(CAN_MO118_IPR)

/** \brief  1EDC, Message Object  Control Register */
#define CAN_MO118_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019EDCu)

/** Alias (User Manual Name) for CAN_MO118_STAT.
* To use register names with standard convension, please use CAN_MO118_STAT.
*/
#define	CAN_MOSTAT118	(CAN_MO118_STAT)

