leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO11_EDATA1.
* To use register names with standard convension, please use CAN_MO11_EDATA1.
*/
#define	CAN_EMO11DATA1	(CAN_MO11_EDATA1)

/** \brief  1168, Message Object  Interrupt Pointer Register */
#define CAN_MO11_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019168u)

/** Alias (User Manual Name) for CAN_MO11_EDATA2.
* To use register names with standard convension, please use CAN_MO11_EDATA2.
*/
#define	CAN_EMO11DATA2	(CAN_MO11_EDATA2)

/** \brief  116C, Message Object  Acceptance Mask Register */
#define CAN_MO11_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001916Cu)

/** Alias (User Manual Name) for CAN_MO11_EDATA3.
* To use register names with standard convension, please use CAN_MO11_EDATA3.
*/
#define	CAN_EMO11DATA3	(CAN_MO11_EDATA3)

/** \brief  1170, Message Object  Data Register Low */
#define CAN_MO11_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019170u)

/** Alias (User Manual Name) for CAN_MO11_EDATA4.
* To use register names with standard convension, please use CAN_MO11_EDATA4.
*/
#define	CAN_EMO11DATA4	(CAN_MO11_EDATA4)

/** \brief  1174, Message Object  Data Register High */
#define CAN_MO11_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019174u)

/** Alias (User Manual Name) for CAN_MO11_EDATA5.
* To use register names with standard convension, please use CAN_MO11_EDATA5.
*/
#define	CAN_EMO11DATA5	(CAN_MO11_EDATA5)

/** \brief  1178, Message Object  Arbitration Register */
#define CAN_MO11_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019178u)

/** Alias (User Manual Name) for CAN_MO11_EDATA6.
* To use register names with standard convension, please use CAN_MO11_EDATA6.
*/
#define	CAN_EMO11DATA6	(CAN_MO11_EDATA6)

/** \brief  1160, Message Object  Function Control Register */
#define CAN_MO11_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019160u)

/** Alias (User Manual Name) for CAN_MO11_FCR.
* To use register names with standard convension, please use CAN_MO11_FCR.
*/
#define	CAN_MOFCR11	(CAN_MO11_FCR)

/** \brief  1164, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO11_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019164u)

/** Alias (User Manual Name) for CAN_MO11_FGPR.
* To use register names with standard convension, please use CAN_MO11_FGPR.
*/
#define	CAN_MOFGPR11	(CAN_MO11_FGPR)

/** \brief  1168, Message Object  Interrupt Pointer Register */
#define CAN_MO11_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019168u)

/** Alias (User Manual Name) for CAN_MO11_IPR.
* To use register names with standard convension, please use CAN_MO11_IPR.
*/
#define	CAN_MOIPR11	(CAN_MO11_IPR)

/** \brief  117C, Message Object  Control Register */
#define CAN_MO11_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001917Cu)

/** Alias (User Manual Name) for CAN_MO11_STAT.
* To use register names with standard convension, please use CAN_MO11_STAT.
*/
#define	CAN_MOSTAT11	(CAN_MO11_STAT)

/** \brief  1F0C, Message Object  Acceptance Mask Register */
#define CAN_MO120_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019F0Cu)

/** Alias (User Manual Name) for CAN_MO120_AMR.
* To use register names with standard convension, please use CAN_MO120_AMR.
*/
#define	CAN_MOAMR120	(CAN_MO120_AMR)

/** \brief  1F18, Message Object  Arbitration Register */
#define CAN_MO120_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019F18u)

/** Alias (User Manual Name) for CAN_MO120_AR.
* To use register names with standard convension, please use CAN_MO120_AR.
*/
#define	CAN_MOAR120	(CAN_MO120_AR)

/** \brief  1F1C, Message Object  Control Register */
#define CAN_MO120_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019F1Cu)

/** Alias (User Manual Name) for CAN_MO120_CTR.
* To use register names with standard convension, please use CAN_MO120_CTR.
*/
#define	CAN_MOCTR120	(CAN_MO120_CTR)

/** \brief  1F14, Message Object  Data Register High */
#define CAN_MO120_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019F14u)

/** Alias (User Manual Name) for CAN_MO120_DATAH.
* To use register names with standard convension, please use CAN_MO120_DATAH.
*/
#define	CAN_MODATAH120	(CAN_MO120_DATAH)

/** \brief  1F10, Message Object  Data Register Low */
#define CAN_MO120_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019F10u)

/** Alias (User Manual Name) for CAN_MO120_DATAL.
* To use register names with standard convension, please use CAN_MO120_DATAL.
*/
#define	CAN_MODATAL120	(CAN_MO120_DATAL)

/** \brief  1F00, Message Object  Function Control Register */
#define CAN_MO120_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019F00u)

/** Alias (User Manual Name) for CAN_MO120_EDATA0.
* To use register names with standard convension, please use CAN_MO120_EDATA0.
*/
#define	CAN_EMO120DATA0	(CAN_MO120_EDATA0)

/** \brief  1F04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO120_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019F04u)

/** Alias (User Manual Name) for CAN_MO120_EDATA1.
* To use register names with standard convension, please use CAN_MO120_EDATA1.
*/
#define	CAN_EMO120DATA1	(CAN_MO120_EDATA1)

/** \brief  1F08, Message Object  Interrupt Pointer Register */
#define CAN_MO120_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019F08u)

/** Alias (User Manual Name) for CAN_MO120_EDATA2.
* To use register names with standard convension, please use CAN_MO120_EDATA2.
*/
#define	CAN_EMO120DATA2	(CAN_MO120_EDATA2)

/** \brief  1F0C, Message Object  Acceptance Mask Register */
#define CAN_MO120_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019F0Cu)

/** Alias (User Manual Name) for CAN_MO120_EDATA3.
* To use register names with standard convension, please use CAN_MO120_EDATA3.
*/
#define	CAN_EMO120DATA3	(CAN_MO120_EDATA3)

/** \brief  1F10, Message Object  Data Register Low */
#define CAN_MO120_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019F10u)

/** Alias (User Manual Name) for CAN_MO120_EDATA4.
* To use register names with standard convension, please use CAN_MO120_EDATA4.
*/
#define	CAN_EMO120DATA4	(CAN_MO120_EDATA4)

/** \brief  1F14, Message Object  Data Register High */
#define CAN_MO120_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019F14u)

/** Alias (User Manual Name) for CAN_MO120_EDATA5.
* To use register names with standard convension, please use CAN_MO120_EDATA5.
*/
#define	CAN_EMO120DATA5	(CAN_MO120_EDATA5)

