leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1F18, Message Object  Arbitration Register */
#define CAN_MO120_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019F18u)

/** Alias (User Manual Name) for CAN_MO120_EDATA6.
* To use register names with standard convension, please use CAN_MO120_EDATA6.
*/
#define	CAN_EMO120DATA6	(CAN_MO120_EDATA6)

/** \brief  1F00, Message Object  Function Control Register */
#define CAN_MO120_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019F00u)

/** Alias (User Manual Name) for CAN_MO120_FCR.
* To use register names with standard convension, please use CAN_MO120_FCR.
*/
#define	CAN_MOFCR120	(CAN_MO120_FCR)

/** \brief  1F04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO120_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019F04u)

/** Alias (User Manual Name) for CAN_MO120_FGPR.
* To use register names with standard convension, please use CAN_MO120_FGPR.
*/
#define	CAN_MOFGPR120	(CAN_MO120_FGPR)

/** \brief  1F08, Message Object  Interrupt Pointer Register */
#define CAN_MO120_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019F08u)

/** Alias (User Manual Name) for CAN_MO120_IPR.
* To use register names with standard convension, please use CAN_MO120_IPR.
*/
#define	CAN_MOIPR120	(CAN_MO120_IPR)

/** \brief  1F1C, Message Object  Control Register */
#define CAN_MO120_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019F1Cu)

/** Alias (User Manual Name) for CAN_MO120_STAT.
* To use register names with standard convension, please use CAN_MO120_STAT.
*/
#define	CAN_MOSTAT120	(CAN_MO120_STAT)

/** \brief  1F2C, Message Object  Acceptance Mask Register */
#define CAN_MO121_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019F2Cu)

/** Alias (User Manual Name) for CAN_MO121_AMR.
* To use register names with standard convension, please use CAN_MO121_AMR.
*/
#define	CAN_MOAMR121	(CAN_MO121_AMR)

/** \brief  1F38, Message Object  Arbitration Register */
#define CAN_MO121_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019F38u)

/** Alias (User Manual Name) for CAN_MO121_AR.
* To use register names with standard convension, please use CAN_MO121_AR.
*/
#define	CAN_MOAR121	(CAN_MO121_AR)

/** \brief  1F3C, Message Object  Control Register */
#define CAN_MO121_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019F3Cu)

/** Alias (User Manual Name) for CAN_MO121_CTR.
* To use register names with standard convension, please use CAN_MO121_CTR.
*/
#define	CAN_MOCTR121	(CAN_MO121_CTR)

/** \brief  1F34, Message Object  Data Register High */
#define CAN_MO121_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019F34u)

/** Alias (User Manual Name) for CAN_MO121_DATAH.
* To use register names with standard convension, please use CAN_MO121_DATAH.
*/
#define	CAN_MODATAH121	(CAN_MO121_DATAH)

/** \brief  1F30, Message Object  Data Register Low */
#define CAN_MO121_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019F30u)

/** Alias (User Manual Name) for CAN_MO121_DATAL.
* To use register names with standard convension, please use CAN_MO121_DATAL.
*/
#define	CAN_MODATAL121	(CAN_MO121_DATAL)

/** \brief  1F20, Message Object  Function Control Register */
#define CAN_MO121_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019F20u)

/** Alias (User Manual Name) for CAN_MO121_EDATA0.
* To use register names with standard convension, please use CAN_MO121_EDATA0.
*/
#define	CAN_EMO121DATA0	(CAN_MO121_EDATA0)

/** \brief  1F24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO121_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019F24u)

/** Alias (User Manual Name) for CAN_MO121_EDATA1.
* To use register names with standard convension, please use CAN_MO121_EDATA1.
*/
#define	CAN_EMO121DATA1	(CAN_MO121_EDATA1)

/** \brief  1F28, Message Object  Interrupt Pointer Register */
#define CAN_MO121_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019F28u)

/** Alias (User Manual Name) for CAN_MO121_EDATA2.
* To use register names with standard convension, please use CAN_MO121_EDATA2.
*/
#define	CAN_EMO121DATA2	(CAN_MO121_EDATA2)

/** \brief  1F2C, Message Object  Acceptance Mask Register */
#define CAN_MO121_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019F2Cu)

/** Alias (User Manual Name) for CAN_MO121_EDATA3.
* To use register names with standard convension, please use CAN_MO121_EDATA3.
*/
#define	CAN_EMO121DATA3	(CAN_MO121_EDATA3)

/** \brief  1F30, Message Object  Data Register Low */
#define CAN_MO121_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019F30u)

/** Alias (User Manual Name) for CAN_MO121_EDATA4.
* To use register names with standard convension, please use CAN_MO121_EDATA4.
*/
#define	CAN_EMO121DATA4	(CAN_MO121_EDATA4)

/** \brief  1F34, Message Object  Data Register High */
#define CAN_MO121_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019F34u)

/** Alias (User Manual Name) for CAN_MO121_EDATA5.
* To use register names with standard convension, please use CAN_MO121_EDATA5.
*/
#define	CAN_EMO121DATA5	(CAN_MO121_EDATA5)

/** \brief  1F38, Message Object  Arbitration Register */
#define CAN_MO121_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019F38u)

/** Alias (User Manual Name) for CAN_MO121_EDATA6.
* To use register names with standard convension, please use CAN_MO121_EDATA6.
*/
#define	CAN_EMO121DATA6	(CAN_MO121_EDATA6)

/** \brief  1F20, Message Object  Function Control Register */
#define CAN_MO121_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019F20u)

/** Alias (User Manual Name) for CAN_MO121_FCR.
* To use register names with standard convension, please use CAN_MO121_FCR.
*/
#define	CAN_MOFCR121	(CAN_MO121_FCR)

/** \brief  1F24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO121_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019F24u)

/** Alias (User Manual Name) for CAN_MO121_FGPR.
* To use register names with standard convension, please use CAN_MO121_FGPR.
*/
#define	CAN_MOFGPR121	(CAN_MO121_FGPR)

/** \brief  1F28, Message Object  Interrupt Pointer Register */
#define CAN_MO121_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019F28u)

/** Alias (User Manual Name) for CAN_MO121_IPR.
* To use register names with standard convension, please use CAN_MO121_IPR.
*/
#define	CAN_MOIPR121	(CAN_MO121_IPR)

/** \brief  1F3C, Message Object  Control Register */
#define CAN_MO121_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019F3Cu)

/** Alias (User Manual Name) for CAN_MO121_STAT.
* To use register names with standard convension, please use CAN_MO121_STAT.
*/
#define	CAN_MOSTAT121	(CAN_MO121_STAT)

/** \brief  1F4C, Message Object  Acceptance Mask Register */
#define CAN_MO122_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019F4Cu)

/** Alias (User Manual Name) for CAN_MO122_AMR.
* To use register names with standard convension, please use CAN_MO122_AMR.
*/
#define	CAN_MOAMR122	(CAN_MO122_AMR)

/** \brief  1F58, Message Object  Arbitration Register */
#define CAN_MO122_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019F58u)

/** Alias (User Manual Name) for CAN_MO122_AR.
* To use register names with standard convension, please use CAN_MO122_AR.
*/
#define	CAN_MOAR122	(CAN_MO122_AR)

/** \brief  1F5C, Message Object  Control Register */
#define CAN_MO122_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019F5Cu)

/** Alias (User Manual Name) for CAN_MO122_CTR.
* To use register names with standard convension, please use CAN_MO122_CTR.
*/
#define	CAN_MOCTR122	(CAN_MO122_CTR)

/** \brief  1F54, Message Object  Data Register High */
#define CAN_MO122_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019F54u)

