leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO122_DATAH.
* To use register names with standard convension, please use CAN_MO122_DATAH.
*/
#define	CAN_MODATAH122	(CAN_MO122_DATAH)

/** \brief  1F50, Message Object  Data Register Low */
#define CAN_MO122_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019F50u)

/** Alias (User Manual Name) for CAN_MO122_DATAL.
* To use register names with standard convension, please use CAN_MO122_DATAL.
*/
#define	CAN_MODATAL122	(CAN_MO122_DATAL)

/** \brief  1F40, Message Object  Function Control Register */
#define CAN_MO122_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019F40u)

/** Alias (User Manual Name) for CAN_MO122_EDATA0.
* To use register names with standard convension, please use CAN_MO122_EDATA0.
*/
#define	CAN_EMO122DATA0	(CAN_MO122_EDATA0)

/** \brief  1F44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO122_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019F44u)

/** Alias (User Manual Name) for CAN_MO122_EDATA1.
* To use register names with standard convension, please use CAN_MO122_EDATA1.
*/
#define	CAN_EMO122DATA1	(CAN_MO122_EDATA1)

/** \brief  1F48, Message Object  Interrupt Pointer Register */
#define CAN_MO122_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019F48u)

/** Alias (User Manual Name) for CAN_MO122_EDATA2.
* To use register names with standard convension, please use CAN_MO122_EDATA2.
*/
#define	CAN_EMO122DATA2	(CAN_MO122_EDATA2)

/** \brief  1F4C, Message Object  Acceptance Mask Register */
#define CAN_MO122_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019F4Cu)

/** Alias (User Manual Name) for CAN_MO122_EDATA3.
* To use register names with standard convension, please use CAN_MO122_EDATA3.
*/
#define	CAN_EMO122DATA3	(CAN_MO122_EDATA3)

/** \brief  1F50, Message Object  Data Register Low */
#define CAN_MO122_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019F50u)

/** Alias (User Manual Name) for CAN_MO122_EDATA4.
* To use register names with standard convension, please use CAN_MO122_EDATA4.
*/
#define	CAN_EMO122DATA4	(CAN_MO122_EDATA4)

/** \brief  1F54, Message Object  Data Register High */
#define CAN_MO122_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019F54u)

/** Alias (User Manual Name) for CAN_MO122_EDATA5.
* To use register names with standard convension, please use CAN_MO122_EDATA5.
*/
#define	CAN_EMO122DATA5	(CAN_MO122_EDATA5)

/** \brief  1F58, Message Object  Arbitration Register */
#define CAN_MO122_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019F58u)

/** Alias (User Manual Name) for CAN_MO122_EDATA6.
* To use register names with standard convension, please use CAN_MO122_EDATA6.
*/
#define	CAN_EMO122DATA6	(CAN_MO122_EDATA6)

/** \brief  1F40, Message Object  Function Control Register */
#define CAN_MO122_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019F40u)

/** Alias (User Manual Name) for CAN_MO122_FCR.
* To use register names with standard convension, please use CAN_MO122_FCR.
*/
#define	CAN_MOFCR122	(CAN_MO122_FCR)

/** \brief  1F44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO122_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019F44u)

/** Alias (User Manual Name) for CAN_MO122_FGPR.
* To use register names with standard convension, please use CAN_MO122_FGPR.
*/
#define	CAN_MOFGPR122	(CAN_MO122_FGPR)

/** \brief  1F48, Message Object  Interrupt Pointer Register */
#define CAN_MO122_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019F48u)

/** Alias (User Manual Name) for CAN_MO122_IPR.
* To use register names with standard convension, please use CAN_MO122_IPR.
*/
#define	CAN_MOIPR122	(CAN_MO122_IPR)

/** \brief  1F5C, Message Object  Control Register */
#define CAN_MO122_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019F5Cu)

/** Alias (User Manual Name) for CAN_MO122_STAT.
* To use register names with standard convension, please use CAN_MO122_STAT.
*/
#define	CAN_MOSTAT122	(CAN_MO122_STAT)

/** \brief  1F6C, Message Object  Acceptance Mask Register */
#define CAN_MO123_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019F6Cu)

/** Alias (User Manual Name) for CAN_MO123_AMR.
* To use register names with standard convension, please use CAN_MO123_AMR.
*/
#define	CAN_MOAMR123	(CAN_MO123_AMR)

/** \brief  1F78, Message Object  Arbitration Register */
#define CAN_MO123_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019F78u)

/** Alias (User Manual Name) for CAN_MO123_AR.
* To use register names with standard convension, please use CAN_MO123_AR.
*/
#define	CAN_MOAR123	(CAN_MO123_AR)

/** \brief  1F7C, Message Object  Control Register */
#define CAN_MO123_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019F7Cu)

/** Alias (User Manual Name) for CAN_MO123_CTR.
* To use register names with standard convension, please use CAN_MO123_CTR.
*/
#define	CAN_MOCTR123	(CAN_MO123_CTR)

/** \brief  1F74, Message Object  Data Register High */
#define CAN_MO123_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019F74u)

/** Alias (User Manual Name) for CAN_MO123_DATAH.
* To use register names with standard convension, please use CAN_MO123_DATAH.
*/
#define	CAN_MODATAH123	(CAN_MO123_DATAH)

/** \brief  1F70, Message Object  Data Register Low */
#define CAN_MO123_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019F70u)

/** Alias (User Manual Name) for CAN_MO123_DATAL.
* To use register names with standard convension, please use CAN_MO123_DATAL.
*/
#define	CAN_MODATAL123	(CAN_MO123_DATAL)

/** \brief  1F60, Message Object  Function Control Register */
#define CAN_MO123_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019F60u)

/** Alias (User Manual Name) for CAN_MO123_EDATA0.
* To use register names with standard convension, please use CAN_MO123_EDATA0.
*/
#define	CAN_EMO123DATA0	(CAN_MO123_EDATA0)

/** \brief  1F64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO123_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019F64u)

/** Alias (User Manual Name) for CAN_MO123_EDATA1.
* To use register names with standard convension, please use CAN_MO123_EDATA1.
*/
#define	CAN_EMO123DATA1	(CAN_MO123_EDATA1)

/** \brief  1F68, Message Object  Interrupt Pointer Register */
#define CAN_MO123_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019F68u)

