leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1F80, Message Object  Function Control Register */
#define CAN_MO124_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019F80u)

/** Alias (User Manual Name) for CAN_MO124_FCR.
* To use register names with standard convension, please use CAN_MO124_FCR.
*/
#define	CAN_MOFCR124	(CAN_MO124_FCR)

/** \brief  1F84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO124_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019F84u)

/** Alias (User Manual Name) for CAN_MO124_FGPR.
* To use register names with standard convension, please use CAN_MO124_FGPR.
*/
#define	CAN_MOFGPR124	(CAN_MO124_FGPR)

/** \brief  1F88, Message Object  Interrupt Pointer Register */
#define CAN_MO124_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019F88u)

/** Alias (User Manual Name) for CAN_MO124_IPR.
* To use register names with standard convension, please use CAN_MO124_IPR.
*/
#define	CAN_MOIPR124	(CAN_MO124_IPR)

/** \brief  1F9C, Message Object  Control Register */
#define CAN_MO124_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019F9Cu)

/** Alias (User Manual Name) for CAN_MO124_STAT.
* To use register names with standard convension, please use CAN_MO124_STAT.
*/
#define	CAN_MOSTAT124	(CAN_MO124_STAT)

/** \brief  1FAC, Message Object  Acceptance Mask Register */
#define CAN_MO125_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019FACu)

/** Alias (User Manual Name) for CAN_MO125_AMR.
* To use register names with standard convension, please use CAN_MO125_AMR.
*/
#define	CAN_MOAMR125	(CAN_MO125_AMR)

/** \brief  1FB8, Message Object  Arbitration Register */
#define CAN_MO125_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019FB8u)

/** Alias (User Manual Name) for CAN_MO125_AR.
* To use register names with standard convension, please use CAN_MO125_AR.
*/
#define	CAN_MOAR125	(CAN_MO125_AR)

/** \brief  1FBC, Message Object  Control Register */
#define CAN_MO125_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019FBCu)

/** Alias (User Manual Name) for CAN_MO125_CTR.
* To use register names with standard convension, please use CAN_MO125_CTR.
*/
#define	CAN_MOCTR125	(CAN_MO125_CTR)

/** \brief  1FB4, Message Object  Data Register High */
#define CAN_MO125_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019FB4u)

/** Alias (User Manual Name) for CAN_MO125_DATAH.
* To use register names with standard convension, please use CAN_MO125_DATAH.
*/
#define	CAN_MODATAH125	(CAN_MO125_DATAH)

/** \brief  1FB0, Message Object  Data Register Low */
#define CAN_MO125_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019FB0u)

/** Alias (User Manual Name) for CAN_MO125_DATAL.
* To use register names with standard convension, please use CAN_MO125_DATAL.
*/
#define	CAN_MODATAL125	(CAN_MO125_DATAL)

/** \brief  1FA0, Message Object  Function Control Register */
#define CAN_MO125_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019FA0u)

/** Alias (User Manual Name) for CAN_MO125_EDATA0.
* To use register names with standard convension, please use CAN_MO125_EDATA0.
*/
#define	CAN_EMO125DATA0	(CAN_MO125_EDATA0)

/** \brief  1FA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO125_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019FA4u)

/** Alias (User Manual Name) for CAN_MO125_EDATA1.
* To use register names with standard convension, please use CAN_MO125_EDATA1.
*/
#define	CAN_EMO125DATA1	(CAN_MO125_EDATA1)

/** \brief  1FA8, Message Object  Interrupt Pointer Register */
#define CAN_MO125_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019FA8u)

/** Alias (User Manual Name) for CAN_MO125_EDATA2.
* To use register names with standard convension, please use CAN_MO125_EDATA2.
*/
#define	CAN_EMO125DATA2	(CAN_MO125_EDATA2)

/** \brief  1FAC, Message Object  Acceptance Mask Register */
#define CAN_MO125_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019FACu)

/** Alias (User Manual Name) for CAN_MO125_EDATA3.
* To use register names with standard convension, please use CAN_MO125_EDATA3.
*/
#define	CAN_EMO125DATA3	(CAN_MO125_EDATA3)

/** \brief  1FB0, Message Object  Data Register Low */
#define CAN_MO125_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019FB0u)

/** Alias (User Manual Name) for CAN_MO125_EDATA4.
* To use register names with standard convension, please use CAN_MO125_EDATA4.
*/
#define	CAN_EMO125DATA4	(CAN_MO125_EDATA4)

/** \brief  1FB4, Message Object  Data Register High */
#define CAN_MO125_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019FB4u)

/** Alias (User Manual Name) for CAN_MO125_EDATA5.
* To use register names with standard convension, please use CAN_MO125_EDATA5.
*/
#define	CAN_EMO125DATA5	(CAN_MO125_EDATA5)

/** \brief  1FB8, Message Object  Arbitration Register */
#define CAN_MO125_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019FB8u)

/** Alias (User Manual Name) for CAN_MO125_EDATA6.
* To use register names with standard convension, please use CAN_MO125_EDATA6.
*/
#define	CAN_EMO125DATA6	(CAN_MO125_EDATA6)

/** \brief  1FA0, Message Object  Function Control Register */
#define CAN_MO125_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019FA0u)

/** Alias (User Manual Name) for CAN_MO125_FCR.
* To use register names with standard convension, please use CAN_MO125_FCR.
*/
#define	CAN_MOFCR125	(CAN_MO125_FCR)

/** \brief  1FA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO125_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019FA4u)

/** Alias (User Manual Name) for CAN_MO125_FGPR.
* To use register names with standard convension, please use CAN_MO125_FGPR.
*/
#define	CAN_MOFGPR125	(CAN_MO125_FGPR)

/** \brief  1FA8, Message Object  Interrupt Pointer Register */
#define CAN_MO125_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019FA8u)

/** Alias (User Manual Name) for CAN_MO125_IPR.
* To use register names with standard convension, please use CAN_MO125_IPR.
*/
#define	CAN_MOIPR125	(CAN_MO125_IPR)

/** \brief  1FBC, Message Object  Control Register */
#define CAN_MO125_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019FBCu)

