leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1FF4, Message Object  Data Register High */
#define CAN_MO127_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019FF4u)

/** Alias (User Manual Name) for CAN_MO127_DATAH.
* To use register names with standard convension, please use CAN_MO127_DATAH.
*/
#define	CAN_MODATAH127	(CAN_MO127_DATAH)

/** \brief  1FF0, Message Object  Data Register Low */
#define CAN_MO127_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019FF0u)

/** Alias (User Manual Name) for CAN_MO127_DATAL.
* To use register names with standard convension, please use CAN_MO127_DATAL.
*/
#define	CAN_MODATAL127	(CAN_MO127_DATAL)

/** \brief  1FE0, Message Object  Function Control Register */
#define CAN_MO127_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019FE0u)

/** Alias (User Manual Name) for CAN_MO127_EDATA0.
* To use register names with standard convension, please use CAN_MO127_EDATA0.
*/
#define	CAN_EMO127DATA0	(CAN_MO127_EDATA0)

/** \brief  1FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO127_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019FE4u)

/** Alias (User Manual Name) for CAN_MO127_EDATA1.
* To use register names with standard convension, please use CAN_MO127_EDATA1.
*/
#define	CAN_EMO127DATA1	(CAN_MO127_EDATA1)

/** \brief  1FE8, Message Object  Interrupt Pointer Register */
#define CAN_MO127_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019FE8u)

/** Alias (User Manual Name) for CAN_MO127_EDATA2.
* To use register names with standard convension, please use CAN_MO127_EDATA2.
*/
#define	CAN_EMO127DATA2	(CAN_MO127_EDATA2)

/** \brief  1FEC, Message Object  Acceptance Mask Register */
#define CAN_MO127_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019FECu)

/** Alias (User Manual Name) for CAN_MO127_EDATA3.
* To use register names with standard convension, please use CAN_MO127_EDATA3.
*/
#define	CAN_EMO127DATA3	(CAN_MO127_EDATA3)

/** \brief  1FF0, Message Object  Data Register Low */
#define CAN_MO127_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019FF0u)

/** Alias (User Manual Name) for CAN_MO127_EDATA4.
* To use register names with standard convension, please use CAN_MO127_EDATA4.
*/
#define	CAN_EMO127DATA4	(CAN_MO127_EDATA4)

/** \brief  1FF4, Message Object  Data Register High */
#define CAN_MO127_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019FF4u)

/** Alias (User Manual Name) for CAN_MO127_EDATA5.
* To use register names with standard convension, please use CAN_MO127_EDATA5.
*/
#define	CAN_EMO127DATA5	(CAN_MO127_EDATA5)

/** \brief  1FF8, Message Object  Arbitration Register */
#define CAN_MO127_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019FF8u)

/** Alias (User Manual Name) for CAN_MO127_EDATA6.
* To use register names with standard convension, please use CAN_MO127_EDATA6.
*/
#define	CAN_EMO127DATA6	(CAN_MO127_EDATA6)

/** \brief  1FE0, Message Object  Function Control Register */
#define CAN_MO127_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019FE0u)

/** Alias (User Manual Name) for CAN_MO127_FCR.
* To use register names with standard convension, please use CAN_MO127_FCR.
*/
#define	CAN_MOFCR127	(CAN_MO127_FCR)

/** \brief  1FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO127_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019FE4u)

/** Alias (User Manual Name) for CAN_MO127_FGPR.
* To use register names with standard convension, please use CAN_MO127_FGPR.
*/
#define	CAN_MOFGPR127	(CAN_MO127_FGPR)

/** \brief  1FE8, Message Object  Interrupt Pointer Register */
#define CAN_MO127_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019FE8u)

/** Alias (User Manual Name) for CAN_MO127_IPR.
* To use register names with standard convension, please use CAN_MO127_IPR.
*/
#define	CAN_MOIPR127	(CAN_MO127_IPR)

/** \brief  1FFC, Message Object  Control Register */
#define CAN_MO127_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019FFCu)

/** Alias (User Manual Name) for CAN_MO127_STAT.
* To use register names with standard convension, please use CAN_MO127_STAT.
*/
#define	CAN_MOSTAT127	(CAN_MO127_STAT)

/** \brief  118C, Message Object  Acceptance Mask Register */
#define CAN_MO12_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001918Cu)

/** Alias (User Manual Name) for CAN_MO12_AMR.
* To use register names with standard convension, please use CAN_MO12_AMR.
*/
#define	CAN_MOAMR12	(CAN_MO12_AMR)

/** \brief  1198, Message Object  Arbitration Register */
#define CAN_MO12_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019198u)

/** Alias (User Manual Name) for CAN_MO12_AR.
* To use register names with standard convension, please use CAN_MO12_AR.
*/
#define	CAN_MOAR12	(CAN_MO12_AR)

/** \brief  119C, Message Object  Control Register */
#define CAN_MO12_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001919Cu)

/** Alias (User Manual Name) for CAN_MO12_CTR.
* To use register names with standard convension, please use CAN_MO12_CTR.
*/
#define	CAN_MOCTR12	(CAN_MO12_CTR)

/** \brief  1194, Message Object  Data Register High */
#define CAN_MO12_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019194u)

/** Alias (User Manual Name) for CAN_MO12_DATAH.
* To use register names with standard convension, please use CAN_MO12_DATAH.
*/
#define	CAN_MODATAH12	(CAN_MO12_DATAH)

/** \brief  1190, Message Object  Data Register Low */
#define CAN_MO12_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019190u)

/** Alias (User Manual Name) for CAN_MO12_DATAL.
* To use register names with standard convension, please use CAN_MO12_DATAL.
*/
#define	CAN_MODATAL12	(CAN_MO12_DATAL)

/** \brief  1180, Message Object  Function Control Register */
#define CAN_MO12_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019180u)

/** Alias (User Manual Name) for CAN_MO12_EDATA0.
* To use register names with standard convension, please use CAN_MO12_EDATA0.
*/
#define	CAN_EMO12DATA0	(CAN_MO12_EDATA0)

/** \brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO12_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019184u)

/** Alias (User Manual Name) for CAN_MO12_EDATA1.
* To use register names with standard convension, please use CAN_MO12_EDATA1.
*/
#define	CAN_EMO12DATA1	(CAN_MO12_EDATA1)

/** \brief  1188, Message Object  Interrupt Pointer Register */
#define CAN_MO12_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019188u)

/** Alias (User Manual Name) for CAN_MO12_EDATA2.
* To use register names with standard convension, please use CAN_MO12_EDATA2.
*/
#define	CAN_EMO12DATA2	(CAN_MO12_EDATA2)

/** \brief  118C, Message Object  Acceptance Mask Register */
#define CAN_MO12_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001918Cu)

/** Alias (User Manual Name) for CAN_MO12_EDATA3.
* To use register names with standard convension, please use CAN_MO12_EDATA3.
*/
#define	CAN_EMO12DATA3	(CAN_MO12_EDATA3)

/** \brief  1190, Message Object  Data Register Low */
#define CAN_MO12_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019190u)

