leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO12_EDATA4.
* To use register names with standard convension, please use CAN_MO12_EDATA4.
*/
#define	CAN_EMO12DATA4	(CAN_MO12_EDATA4)

/** \brief  1194, Message Object  Data Register High */
#define CAN_MO12_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019194u)

/** Alias (User Manual Name) for CAN_MO12_EDATA5.
* To use register names with standard convension, please use CAN_MO12_EDATA5.
*/
#define	CAN_EMO12DATA5	(CAN_MO12_EDATA5)

/** \brief  1198, Message Object  Arbitration Register */
#define CAN_MO12_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019198u)

/** Alias (User Manual Name) for CAN_MO12_EDATA6.
* To use register names with standard convension, please use CAN_MO12_EDATA6.
*/
#define	CAN_EMO12DATA6	(CAN_MO12_EDATA6)

/** \brief  1180, Message Object  Function Control Register */
#define CAN_MO12_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019180u)

/** Alias (User Manual Name) for CAN_MO12_FCR.
* To use register names with standard convension, please use CAN_MO12_FCR.
*/
#define	CAN_MOFCR12	(CAN_MO12_FCR)

/** \brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO12_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019184u)

/** Alias (User Manual Name) for CAN_MO12_FGPR.
* To use register names with standard convension, please use CAN_MO12_FGPR.
*/
#define	CAN_MOFGPR12	(CAN_MO12_FGPR)

/** \brief  1188, Message Object  Interrupt Pointer Register */
#define CAN_MO12_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019188u)

/** Alias (User Manual Name) for CAN_MO12_IPR.
* To use register names with standard convension, please use CAN_MO12_IPR.
*/
#define	CAN_MOIPR12	(CAN_MO12_IPR)

/** \brief  119C, Message Object  Control Register */
#define CAN_MO12_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001919Cu)

/** Alias (User Manual Name) for CAN_MO12_STAT.
* To use register names with standard convension, please use CAN_MO12_STAT.
*/
#define	CAN_MOSTAT12	(CAN_MO12_STAT)

/** \brief  11AC, Message Object  Acceptance Mask Register */
#define CAN_MO13_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00191ACu)

/** Alias (User Manual Name) for CAN_MO13_AMR.
* To use register names with standard convension, please use CAN_MO13_AMR.
*/
#define	CAN_MOAMR13	(CAN_MO13_AMR)

/** \brief  11B8, Message Object  Arbitration Register */
#define CAN_MO13_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00191B8u)

/** Alias (User Manual Name) for CAN_MO13_AR.
* To use register names with standard convension, please use CAN_MO13_AR.
*/
#define	CAN_MOAR13	(CAN_MO13_AR)

/** \brief  11BC, Message Object  Control Register */
#define CAN_MO13_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00191BCu)

/** Alias (User Manual Name) for CAN_MO13_CTR.
* To use register names with standard convension, please use CAN_MO13_CTR.
*/
#define	CAN_MOCTR13	(CAN_MO13_CTR)

/** \brief  11B4, Message Object  Data Register High */
#define CAN_MO13_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00191B4u)

/** Alias (User Manual Name) for CAN_MO13_DATAH.
* To use register names with standard convension, please use CAN_MO13_DATAH.
*/
#define	CAN_MODATAH13	(CAN_MO13_DATAH)

/** \brief  11B0, Message Object  Data Register Low */
#define CAN_MO13_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00191B0u)

/** Alias (User Manual Name) for CAN_MO13_DATAL.
* To use register names with standard convension, please use CAN_MO13_DATAL.
*/
#define	CAN_MODATAL13	(CAN_MO13_DATAL)

/** \brief  11A0, Message Object  Function Control Register */
#define CAN_MO13_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00191A0u)

/** Alias (User Manual Name) for CAN_MO13_EDATA0.
* To use register names with standard convension, please use CAN_MO13_EDATA0.
*/
#define	CAN_EMO13DATA0	(CAN_MO13_EDATA0)

/** \brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO13_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00191A4u)

/** Alias (User Manual Name) for CAN_MO13_EDATA1.
* To use register names with standard convension, please use CAN_MO13_EDATA1.
*/
#define	CAN_EMO13DATA1	(CAN_MO13_EDATA1)

/** \brief  11A8, Message Object  Interrupt Pointer Register */
#define CAN_MO13_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00191A8u)

/** Alias (User Manual Name) for CAN_MO13_EDATA2.
* To use register names with standard convension, please use CAN_MO13_EDATA2.
*/
#define	CAN_EMO13DATA2	(CAN_MO13_EDATA2)

/** \brief  11AC, Message Object  Acceptance Mask Register */
#define CAN_MO13_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00191ACu)

/** Alias (User Manual Name) for CAN_MO13_EDATA3.
* To use register names with standard convension, please use CAN_MO13_EDATA3.
*/
#define	CAN_EMO13DATA3	(CAN_MO13_EDATA3)

/** \brief  11B0, Message Object  Data Register Low */
#define CAN_MO13_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00191B0u)

/** Alias (User Manual Name) for CAN_MO13_EDATA4.
* To use register names with standard convension, please use CAN_MO13_EDATA4.
*/
#define	CAN_EMO13DATA4	(CAN_MO13_EDATA4)

/** \brief  11B4, Message Object  Data Register High */
#define CAN_MO13_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00191B4u)

/** Alias (User Manual Name) for CAN_MO13_EDATA5.
* To use register names with standard convension, please use CAN_MO13_EDATA5.
*/
#define	CAN_EMO13DATA5	(CAN_MO13_EDATA5)

/** \brief  11B8, Message Object  Arbitration Register */
#define CAN_MO13_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00191B8u)

/** Alias (User Manual Name) for CAN_MO13_EDATA6.
* To use register names with standard convension, please use CAN_MO13_EDATA6.
*/
#define	CAN_EMO13DATA6	(CAN_MO13_EDATA6)

/** \brief  11A0, Message Object  Function Control Register */
#define CAN_MO13_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00191A0u)

/** Alias (User Manual Name) for CAN_MO13_FCR.
* To use register names with standard convension, please use CAN_MO13_FCR.
*/
#define	CAN_MOFCR13	(CAN_MO13_FCR)

/** \brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO13_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00191A4u)

/** Alias (User Manual Name) for CAN_MO13_FGPR.
* To use register names with standard convension, please use CAN_MO13_FGPR.
*/
#define	CAN_MOFGPR13	(CAN_MO13_FGPR)

/** \brief  11A8, Message Object  Interrupt Pointer Register */
#define CAN_MO13_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00191A8u)

/** Alias (User Manual Name) for CAN_MO13_IPR.
* To use register names with standard convension, please use CAN_MO13_IPR.
*/
#define	CAN_MOIPR13	(CAN_MO13_IPR)

