leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  11F0, Message Object  Data Register Low */
#define CAN_MO15_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00191F0u)

/** Alias (User Manual Name) for CAN_MO15_DATAL.
* To use register names with standard convension, please use CAN_MO15_DATAL.
*/
#define	CAN_MODATAL15	(CAN_MO15_DATAL)

/** \brief  11E0, Message Object  Function Control Register */
#define CAN_MO15_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00191E0u)

/** Alias (User Manual Name) for CAN_MO15_EDATA0.
* To use register names with standard convension, please use CAN_MO15_EDATA0.
*/
#define	CAN_EMO15DATA0	(CAN_MO15_EDATA0)

/** \brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO15_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00191E4u)

/** Alias (User Manual Name) for CAN_MO15_EDATA1.
* To use register names with standard convension, please use CAN_MO15_EDATA1.
*/
#define	CAN_EMO15DATA1	(CAN_MO15_EDATA1)

/** \brief  11E8, Message Object  Interrupt Pointer Register */
#define CAN_MO15_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00191E8u)

/** Alias (User Manual Name) for CAN_MO15_EDATA2.
* To use register names with standard convension, please use CAN_MO15_EDATA2.
*/
#define	CAN_EMO15DATA2	(CAN_MO15_EDATA2)

/** \brief  11EC, Message Object  Acceptance Mask Register */
#define CAN_MO15_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00191ECu)

/** Alias (User Manual Name) for CAN_MO15_EDATA3.
* To use register names with standard convension, please use CAN_MO15_EDATA3.
*/
#define	CAN_EMO15DATA3	(CAN_MO15_EDATA3)

/** \brief  11F0, Message Object  Data Register Low */
#define CAN_MO15_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00191F0u)

/** Alias (User Manual Name) for CAN_MO15_EDATA4.
* To use register names with standard convension, please use CAN_MO15_EDATA4.
*/
#define	CAN_EMO15DATA4	(CAN_MO15_EDATA4)

/** \brief  11F4, Message Object  Data Register High */
#define CAN_MO15_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00191F4u)

/** Alias (User Manual Name) for CAN_MO15_EDATA5.
* To use register names with standard convension, please use CAN_MO15_EDATA5.
*/
#define	CAN_EMO15DATA5	(CAN_MO15_EDATA5)

/** \brief  11F8, Message Object  Arbitration Register */
#define CAN_MO15_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00191F8u)

/** Alias (User Manual Name) for CAN_MO15_EDATA6.
* To use register names with standard convension, please use CAN_MO15_EDATA6.
*/
#define	CAN_EMO15DATA6	(CAN_MO15_EDATA6)

/** \brief  11E0, Message Object  Function Control Register */
#define CAN_MO15_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00191E0u)

/** Alias (User Manual Name) for CAN_MO15_FCR.
* To use register names with standard convension, please use CAN_MO15_FCR.
*/
#define	CAN_MOFCR15	(CAN_MO15_FCR)

/** \brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO15_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00191E4u)

/** Alias (User Manual Name) for CAN_MO15_FGPR.
* To use register names with standard convension, please use CAN_MO15_FGPR.
*/
#define	CAN_MOFGPR15	(CAN_MO15_FGPR)

/** \brief  11E8, Message Object  Interrupt Pointer Register */
#define CAN_MO15_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00191E8u)

/** Alias (User Manual Name) for CAN_MO15_IPR.
* To use register names with standard convension, please use CAN_MO15_IPR.
*/
#define	CAN_MOIPR15	(CAN_MO15_IPR)

/** \brief  11FC, Message Object  Control Register */
#define CAN_MO15_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00191FCu)

/** Alias (User Manual Name) for CAN_MO15_STAT.
* To use register names with standard convension, please use CAN_MO15_STAT.
*/
#define	CAN_MOSTAT15	(CAN_MO15_STAT)

/** \brief  120C, Message Object  Acceptance Mask Register */
#define CAN_MO16_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001920Cu)

/** Alias (User Manual Name) for CAN_MO16_AMR.
* To use register names with standard convension, please use CAN_MO16_AMR.
*/
#define	CAN_MOAMR16	(CAN_MO16_AMR)

/** \brief  1218, Message Object  Arbitration Register */
#define CAN_MO16_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019218u)

/** Alias (User Manual Name) for CAN_MO16_AR.
* To use register names with standard convension, please use CAN_MO16_AR.
*/
#define	CAN_MOAR16	(CAN_MO16_AR)

/** \brief  121C, Message Object  Control Register */
#define CAN_MO16_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001921Cu)

/** Alias (User Manual Name) for CAN_MO16_CTR.
* To use register names with standard convension, please use CAN_MO16_CTR.
*/
#define	CAN_MOCTR16	(CAN_MO16_CTR)

/** \brief  1214, Message Object  Data Register High */
#define CAN_MO16_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019214u)

/** Alias (User Manual Name) for CAN_MO16_DATAH.
* To use register names with standard convension, please use CAN_MO16_DATAH.
*/
#define	CAN_MODATAH16	(CAN_MO16_DATAH)

/** \brief  1210, Message Object  Data Register Low */
#define CAN_MO16_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019210u)

/** Alias (User Manual Name) for CAN_MO16_DATAL.
* To use register names with standard convension, please use CAN_MO16_DATAL.
*/
#define	CAN_MODATAL16	(CAN_MO16_DATAL)

/** \brief  1200, Message Object  Function Control Register */
#define CAN_MO16_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019200u)

/** Alias (User Manual Name) for CAN_MO16_EDATA0.
* To use register names with standard convension, please use CAN_MO16_EDATA0.
*/
#define	CAN_EMO16DATA0	(CAN_MO16_EDATA0)

/** \brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO16_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019204u)

/** Alias (User Manual Name) for CAN_MO16_EDATA1.
* To use register names with standard convension, please use CAN_MO16_EDATA1.
*/
#define	CAN_EMO16DATA1	(CAN_MO16_EDATA1)

/** \brief  1208, Message Object  Interrupt Pointer Register */
#define CAN_MO16_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019208u)

/** Alias (User Manual Name) for CAN_MO16_EDATA2.
* To use register names with standard convension, please use CAN_MO16_EDATA2.
*/
#define	CAN_EMO16DATA2	(CAN_MO16_EDATA2)

