leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  120C, Message Object  Acceptance Mask Register */
#define CAN_MO16_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001920Cu)

/** Alias (User Manual Name) for CAN_MO16_EDATA3.
* To use register names with standard convension, please use CAN_MO16_EDATA3.
*/
#define	CAN_EMO16DATA3	(CAN_MO16_EDATA3)

/** \brief  1210, Message Object  Data Register Low */
#define CAN_MO16_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019210u)

/** Alias (User Manual Name) for CAN_MO16_EDATA4.
* To use register names with standard convension, please use CAN_MO16_EDATA4.
*/
#define	CAN_EMO16DATA4	(CAN_MO16_EDATA4)

/** \brief  1214, Message Object  Data Register High */
#define CAN_MO16_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019214u)

/** Alias (User Manual Name) for CAN_MO16_EDATA5.
* To use register names with standard convension, please use CAN_MO16_EDATA5.
*/
#define	CAN_EMO16DATA5	(CAN_MO16_EDATA5)

/** \brief  1218, Message Object  Arbitration Register */
#define CAN_MO16_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019218u)

/** Alias (User Manual Name) for CAN_MO16_EDATA6.
* To use register names with standard convension, please use CAN_MO16_EDATA6.
*/
#define	CAN_EMO16DATA6	(CAN_MO16_EDATA6)

/** \brief  1200, Message Object  Function Control Register */
#define CAN_MO16_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019200u)

/** Alias (User Manual Name) for CAN_MO16_FCR.
* To use register names with standard convension, please use CAN_MO16_FCR.
*/
#define	CAN_MOFCR16	(CAN_MO16_FCR)

/** \brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO16_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019204u)

/** Alias (User Manual Name) for CAN_MO16_FGPR.
* To use register names with standard convension, please use CAN_MO16_FGPR.
*/
#define	CAN_MOFGPR16	(CAN_MO16_FGPR)

/** \brief  1208, Message Object  Interrupt Pointer Register */
#define CAN_MO16_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019208u)

/** Alias (User Manual Name) for CAN_MO16_IPR.
* To use register names with standard convension, please use CAN_MO16_IPR.
*/
#define	CAN_MOIPR16	(CAN_MO16_IPR)

/** \brief  121C, Message Object  Control Register */
#define CAN_MO16_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001921Cu)

/** Alias (User Manual Name) for CAN_MO16_STAT.
* To use register names with standard convension, please use CAN_MO16_STAT.
*/
#define	CAN_MOSTAT16	(CAN_MO16_STAT)

/** \brief  122C, Message Object  Acceptance Mask Register */
#define CAN_MO17_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001922Cu)

/** Alias (User Manual Name) for CAN_MO17_AMR.
* To use register names with standard convension, please use CAN_MO17_AMR.
*/
#define	CAN_MOAMR17	(CAN_MO17_AMR)

/** \brief  1238, Message Object  Arbitration Register */
#define CAN_MO17_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019238u)

/** Alias (User Manual Name) for CAN_MO17_AR.
* To use register names with standard convension, please use CAN_MO17_AR.
*/
#define	CAN_MOAR17	(CAN_MO17_AR)

/** \brief  123C, Message Object  Control Register */
#define CAN_MO17_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001923Cu)

/** Alias (User Manual Name) for CAN_MO17_CTR.
* To use register names with standard convension, please use CAN_MO17_CTR.
*/
#define	CAN_MOCTR17	(CAN_MO17_CTR)

/** \brief  1234, Message Object  Data Register High */
#define CAN_MO17_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019234u)

/** Alias (User Manual Name) for CAN_MO17_DATAH.
* To use register names with standard convension, please use CAN_MO17_DATAH.
*/
#define	CAN_MODATAH17	(CAN_MO17_DATAH)

/** \brief  1230, Message Object  Data Register Low */
#define CAN_MO17_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019230u)

/** Alias (User Manual Name) for CAN_MO17_DATAL.
* To use register names with standard convension, please use CAN_MO17_DATAL.
*/
#define	CAN_MODATAL17	(CAN_MO17_DATAL)

/** \brief  1220, Message Object  Function Control Register */
#define CAN_MO17_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019220u)

/** Alias (User Manual Name) for CAN_MO17_EDATA0.
* To use register names with standard convension, please use CAN_MO17_EDATA0.
*/
#define	CAN_EMO17DATA0	(CAN_MO17_EDATA0)

/** \brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO17_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019224u)

/** Alias (User Manual Name) for CAN_MO17_EDATA1.
* To use register names with standard convension, please use CAN_MO17_EDATA1.
*/
#define	CAN_EMO17DATA1	(CAN_MO17_EDATA1)

/** \brief  1228, Message Object  Interrupt Pointer Register */
#define CAN_MO17_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019228u)

/** Alias (User Manual Name) for CAN_MO17_EDATA2.
* To use register names with standard convension, please use CAN_MO17_EDATA2.
*/
#define	CAN_EMO17DATA2	(CAN_MO17_EDATA2)

/** \brief  122C, Message Object  Acceptance Mask Register */
#define CAN_MO17_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001922Cu)

/** Alias (User Manual Name) for CAN_MO17_EDATA3.
* To use register names with standard convension, please use CAN_MO17_EDATA3.
*/
#define	CAN_EMO17DATA3	(CAN_MO17_EDATA3)

/** \brief  1230, Message Object  Data Register Low */
#define CAN_MO17_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019230u)

/** Alias (User Manual Name) for CAN_MO17_EDATA4.
* To use register names with standard convension, please use CAN_MO17_EDATA4.
*/
#define	CAN_EMO17DATA4	(CAN_MO17_EDATA4)

/** \brief  1234, Message Object  Data Register High */
#define CAN_MO17_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019234u)

/** Alias (User Manual Name) for CAN_MO17_EDATA5.
* To use register names with standard convension, please use CAN_MO17_EDATA5.
*/
#define	CAN_EMO17DATA5	(CAN_MO17_EDATA5)

/** \brief  1238, Message Object  Arbitration Register */
#define CAN_MO17_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019238u)

/** Alias (User Manual Name) for CAN_MO17_EDATA6.
* To use register names with standard convension, please use CAN_MO17_EDATA6.
*/
#define	CAN_EMO17DATA6	(CAN_MO17_EDATA6)

/** \brief  1220, Message Object  Function Control Register */
#define CAN_MO17_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019220u)

/** Alias (User Manual Name) for CAN_MO17_FCR.
* To use register names with standard convension, please use CAN_MO17_FCR.
*/
#define	CAN_MOFCR17	(CAN_MO17_FCR)

/** \brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO17_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019224u)

/** Alias (User Manual Name) for CAN_MO17_FGPR.
* To use register names with standard convension, please use CAN_MO17_FGPR.
*/
#define	CAN_MOFGPR17	(CAN_MO17_FGPR)

/** \brief  1228, Message Object  Interrupt Pointer Register */
#define CAN_MO17_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019228u)

