leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO17_IPR.
* To use register names with standard convension, please use CAN_MO17_IPR.
*/
#define	CAN_MOIPR17	(CAN_MO17_IPR)

/** \brief  123C, Message Object  Control Register */
#define CAN_MO17_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001923Cu)

/** Alias (User Manual Name) for CAN_MO17_STAT.
* To use register names with standard convension, please use CAN_MO17_STAT.
*/
#define	CAN_MOSTAT17	(CAN_MO17_STAT)

/** \brief  124C, Message Object  Acceptance Mask Register */
#define CAN_MO18_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001924Cu)

/** Alias (User Manual Name) for CAN_MO18_AMR.
* To use register names with standard convension, please use CAN_MO18_AMR.
*/
#define	CAN_MOAMR18	(CAN_MO18_AMR)

/** \brief  1258, Message Object  Arbitration Register */
#define CAN_MO18_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019258u)

/** Alias (User Manual Name) for CAN_MO18_AR.
* To use register names with standard convension, please use CAN_MO18_AR.
*/
#define	CAN_MOAR18	(CAN_MO18_AR)

/** \brief  125C, Message Object  Control Register */
#define CAN_MO18_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001925Cu)

/** Alias (User Manual Name) for CAN_MO18_CTR.
* To use register names with standard convension, please use CAN_MO18_CTR.
*/
#define	CAN_MOCTR18	(CAN_MO18_CTR)

/** \brief  1254, Message Object  Data Register High */
#define CAN_MO18_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019254u)

/** Alias (User Manual Name) for CAN_MO18_DATAH.
* To use register names with standard convension, please use CAN_MO18_DATAH.
*/
#define	CAN_MODATAH18	(CAN_MO18_DATAH)

/** \brief  1250, Message Object  Data Register Low */
#define CAN_MO18_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019250u)

/** Alias (User Manual Name) for CAN_MO18_DATAL.
* To use register names with standard convension, please use CAN_MO18_DATAL.
*/
#define	CAN_MODATAL18	(CAN_MO18_DATAL)

/** \brief  1240, Message Object  Function Control Register */
#define CAN_MO18_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019240u)

/** Alias (User Manual Name) for CAN_MO18_EDATA0.
* To use register names with standard convension, please use CAN_MO18_EDATA0.
*/
#define	CAN_EMO18DATA0	(CAN_MO18_EDATA0)

/** \brief  1244, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO18_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019244u)

/** Alias (User Manual Name) for CAN_MO18_EDATA1.
* To use register names with standard convension, please use CAN_MO18_EDATA1.
*/
#define	CAN_EMO18DATA1	(CAN_MO18_EDATA1)

/** \brief  1248, Message Object  Interrupt Pointer Register */
#define CAN_MO18_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019248u)

/** Alias (User Manual Name) for CAN_MO18_EDATA2.
* To use register names with standard convension, please use CAN_MO18_EDATA2.
*/
#define	CAN_EMO18DATA2	(CAN_MO18_EDATA2)

/** \brief  124C, Message Object  Acceptance Mask Register */
#define CAN_MO18_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001924Cu)

/** Alias (User Manual Name) for CAN_MO18_EDATA3.
* To use register names with standard convension, please use CAN_MO18_EDATA3.
*/
#define	CAN_EMO18DATA3	(CAN_MO18_EDATA3)

/** \brief  1250, Message Object  Data Register Low */
#define CAN_MO18_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019250u)

/** Alias (User Manual Name) for CAN_MO18_EDATA4.
* To use register names with standard convension, please use CAN_MO18_EDATA4.
*/
#define	CAN_EMO18DATA4	(CAN_MO18_EDATA4)

/** \brief  1254, Message Object  Data Register High */
#define CAN_MO18_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019254u)

/** Alias (User Manual Name) for CAN_MO18_EDATA5.
* To use register names with standard convension, please use CAN_MO18_EDATA5.
*/
#define	CAN_EMO18DATA5	(CAN_MO18_EDATA5)

/** \brief  1258, Message Object  Arbitration Register */
#define CAN_MO18_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019258u)

/** Alias (User Manual Name) for CAN_MO18_EDATA6.
* To use register names with standard convension, please use CAN_MO18_EDATA6.
*/
#define	CAN_EMO18DATA6	(CAN_MO18_EDATA6)

/** \brief  1240, Message Object  Function Control Register */
#define CAN_MO18_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019240u)

/** Alias (User Manual Name) for CAN_MO18_FCR.
* To use register names with standard convension, please use CAN_MO18_FCR.
*/
#define	CAN_MOFCR18	(CAN_MO18_FCR)

/** \brief  1244, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO18_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019244u)

/** Alias (User Manual Name) for CAN_MO18_FGPR.
* To use register names with standard convension, please use CAN_MO18_FGPR.
*/
#define	CAN_MOFGPR18	(CAN_MO18_FGPR)

/** \brief  1248, Message Object  Interrupt Pointer Register */
#define CAN_MO18_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019248u)

/** Alias (User Manual Name) for CAN_MO18_IPR.
* To use register names with standard convension, please use CAN_MO18_IPR.
*/
#define	CAN_MOIPR18	(CAN_MO18_IPR)

/** \brief  125C, Message Object  Control Register */
#define CAN_MO18_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001925Cu)

/** Alias (User Manual Name) for CAN_MO18_STAT.
* To use register names with standard convension, please use CAN_MO18_STAT.
*/
#define	CAN_MOSTAT18	(CAN_MO18_STAT)

/** \brief  126C, Message Object  Acceptance Mask Register */
#define CAN_MO19_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001926Cu)

/** Alias (User Manual Name) for CAN_MO19_AMR.
* To use register names with standard convension, please use CAN_MO19_AMR.
*/
#define	CAN_MOAMR19	(CAN_MO19_AMR)

/** \brief  1278, Message Object  Arbitration Register */
#define CAN_MO19_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019278u)

/** Alias (User Manual Name) for CAN_MO19_AR.
* To use register names with standard convension, please use CAN_MO19_AR.
*/
#define	CAN_MOAR19	(CAN_MO19_AR)

/** \brief  127C, Message Object  Control Register */
#define CAN_MO19_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001927Cu)

