leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO19_CTR.
* To use register names with standard convension, please use CAN_MO19_CTR.
*/
#define	CAN_MOCTR19	(CAN_MO19_CTR)

/** \brief  1274, Message Object  Data Register High */
#define CAN_MO19_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019274u)

/** Alias (User Manual Name) for CAN_MO19_DATAH.
* To use register names with standard convension, please use CAN_MO19_DATAH.
*/
#define	CAN_MODATAH19	(CAN_MO19_DATAH)

/** \brief  1270, Message Object  Data Register Low */
#define CAN_MO19_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019270u)

/** Alias (User Manual Name) for CAN_MO19_DATAL.
* To use register names with standard convension, please use CAN_MO19_DATAL.
*/
#define	CAN_MODATAL19	(CAN_MO19_DATAL)

/** \brief  1260, Message Object  Function Control Register */
#define CAN_MO19_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019260u)

/** Alias (User Manual Name) for CAN_MO19_EDATA0.
* To use register names with standard convension, please use CAN_MO19_EDATA0.
*/
#define	CAN_EMO19DATA0	(CAN_MO19_EDATA0)

/** \brief  1264, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO19_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019264u)

/** Alias (User Manual Name) for CAN_MO19_EDATA1.
* To use register names with standard convension, please use CAN_MO19_EDATA1.
*/
#define	CAN_EMO19DATA1	(CAN_MO19_EDATA1)

/** \brief  1268, Message Object  Interrupt Pointer Register */
#define CAN_MO19_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019268u)

/** Alias (User Manual Name) for CAN_MO19_EDATA2.
* To use register names with standard convension, please use CAN_MO19_EDATA2.
*/
#define	CAN_EMO19DATA2	(CAN_MO19_EDATA2)

/** \brief  126C, Message Object  Acceptance Mask Register */
#define CAN_MO19_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001926Cu)

/** Alias (User Manual Name) for CAN_MO19_EDATA3.
* To use register names with standard convension, please use CAN_MO19_EDATA3.
*/
#define	CAN_EMO19DATA3	(CAN_MO19_EDATA3)

/** \brief  1270, Message Object  Data Register Low */
#define CAN_MO19_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019270u)

/** Alias (User Manual Name) for CAN_MO19_EDATA4.
* To use register names with standard convension, please use CAN_MO19_EDATA4.
*/
#define	CAN_EMO19DATA4	(CAN_MO19_EDATA4)

/** \brief  1274, Message Object  Data Register High */
#define CAN_MO19_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019274u)

/** Alias (User Manual Name) for CAN_MO19_EDATA5.
* To use register names with standard convension, please use CAN_MO19_EDATA5.
*/
#define	CAN_EMO19DATA5	(CAN_MO19_EDATA5)

/** \brief  1278, Message Object  Arbitration Register */
#define CAN_MO19_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019278u)

/** Alias (User Manual Name) for CAN_MO19_EDATA6.
* To use register names with standard convension, please use CAN_MO19_EDATA6.
*/
#define	CAN_EMO19DATA6	(CAN_MO19_EDATA6)

/** \brief  1260, Message Object  Function Control Register */
#define CAN_MO19_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019260u)

/** Alias (User Manual Name) for CAN_MO19_FCR.
* To use register names with standard convension, please use CAN_MO19_FCR.
*/
#define	CAN_MOFCR19	(CAN_MO19_FCR)

/** \brief  1264, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO19_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019264u)

/** Alias (User Manual Name) for CAN_MO19_FGPR.
* To use register names with standard convension, please use CAN_MO19_FGPR.
*/
#define	CAN_MOFGPR19	(CAN_MO19_FGPR)

/** \brief  1268, Message Object  Interrupt Pointer Register */
#define CAN_MO19_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019268u)

/** Alias (User Manual Name) for CAN_MO19_IPR.
* To use register names with standard convension, please use CAN_MO19_IPR.
*/
#define	CAN_MOIPR19	(CAN_MO19_IPR)

/** \brief  127C, Message Object  Control Register */
#define CAN_MO19_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001927Cu)

/** Alias (User Manual Name) for CAN_MO19_STAT.
* To use register names with standard convension, please use CAN_MO19_STAT.
*/
#define	CAN_MOSTAT19	(CAN_MO19_STAT)

/** \brief  102C, Message Object  Acceptance Mask Register */
#define CAN_MO1_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001902Cu)

/** Alias (User Manual Name) for CAN_MO1_AMR.
* To use register names with standard convension, please use CAN_MO1_AMR.
*/
#define	CAN_MOAMR1	(CAN_MO1_AMR)

/** \brief  1038, Message Object  Arbitration Register */
#define CAN_MO1_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019038u)

/** Alias (User Manual Name) for CAN_MO1_AR.
* To use register names with standard convension, please use CAN_MO1_AR.
*/
#define	CAN_MOAR1	(CAN_MO1_AR)

/** \brief  103C, Message Object  Control Register */
#define CAN_MO1_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001903Cu)

/** Alias (User Manual Name) for CAN_MO1_CTR.
* To use register names with standard convension, please use CAN_MO1_CTR.
*/
#define	CAN_MOCTR1	(CAN_MO1_CTR)

/** \brief  1034, Message Object  Data Register High */
#define CAN_MO1_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019034u)

/** Alias (User Manual Name) for CAN_MO1_DATAH.
* To use register names with standard convension, please use CAN_MO1_DATAH.
*/
#define	CAN_MODATAH1	(CAN_MO1_DATAH)

/** \brief  1030, Message Object  Data Register Low */
#define CAN_MO1_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019030u)

/** Alias (User Manual Name) for CAN_MO1_DATAL.
* To use register names with standard convension, please use CAN_MO1_DATAL.
*/
#define	CAN_MODATAL1	(CAN_MO1_DATAL)

/** \brief  1020, Message Object  Function Control Register */
#define CAN_MO1_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019020u)

/** Alias (User Manual Name) for CAN_MO1_EDATA0.
* To use register names with standard convension, please use CAN_MO1_EDATA0.
*/
#define	CAN_EMO1DATA0	(CAN_MO1_EDATA0)

/** \brief  1024, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO1_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019024u)

/** Alias (User Manual Name) for CAN_MO1_EDATA1.
* To use register names with standard convension, please use CAN_MO1_EDATA1.
*/
#define	CAN_EMO1DATA1	(CAN_MO1_EDATA1)

/** \brief  1028, Message Object  Interrupt Pointer Register */
#define CAN_MO1_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019028u)

/** Alias (User Manual Name) for CAN_MO1_EDATA2.
* To use register names with standard convension, please use CAN_MO1_EDATA2.
*/
#define	CAN_EMO1DATA2	(CAN_MO1_EDATA2)

/** \brief  102C, Message Object  Acceptance Mask Register */
#define CAN_MO1_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001902Cu)

/** Alias (User Manual Name) for CAN_MO1_EDATA3.
* To use register names with standard convension, please use CAN_MO1_EDATA3.
*/
#define	CAN_EMO1DATA3	(CAN_MO1_EDATA3)

