leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1030, Message Object  Data Register Low */
#define CAN_MO1_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019030u)

/** Alias (User Manual Name) for CAN_MO1_EDATA4.
* To use register names with standard convension, please use CAN_MO1_EDATA4.
*/
#define	CAN_EMO1DATA4	(CAN_MO1_EDATA4)

/** \brief  1034, Message Object  Data Register High */
#define CAN_MO1_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019034u)

/** Alias (User Manual Name) for CAN_MO1_EDATA5.
* To use register names with standard convension, please use CAN_MO1_EDATA5.
*/
#define	CAN_EMO1DATA5	(CAN_MO1_EDATA5)

/** \brief  1038, Message Object  Arbitration Register */
#define CAN_MO1_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019038u)

/** Alias (User Manual Name) for CAN_MO1_EDATA6.
* To use register names with standard convension, please use CAN_MO1_EDATA6.
*/
#define	CAN_EMO1DATA6	(CAN_MO1_EDATA6)

/** \brief  1020, Message Object  Function Control Register */
#define CAN_MO1_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019020u)

/** Alias (User Manual Name) for CAN_MO1_FCR.
* To use register names with standard convension, please use CAN_MO1_FCR.
*/
#define	CAN_MOFCR1	(CAN_MO1_FCR)

/** \brief  1024, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO1_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019024u)

/** Alias (User Manual Name) for CAN_MO1_FGPR.
* To use register names with standard convension, please use CAN_MO1_FGPR.
*/
#define	CAN_MOFGPR1	(CAN_MO1_FGPR)

/** \brief  1028, Message Object  Interrupt Pointer Register */
#define CAN_MO1_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019028u)

/** Alias (User Manual Name) for CAN_MO1_IPR.
* To use register names with standard convension, please use CAN_MO1_IPR.
*/
#define	CAN_MOIPR1	(CAN_MO1_IPR)

/** \brief  103C, Message Object  Control Register */
#define CAN_MO1_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001903Cu)

/** Alias (User Manual Name) for CAN_MO1_STAT.
* To use register names with standard convension, please use CAN_MO1_STAT.
*/
#define	CAN_MOSTAT1	(CAN_MO1_STAT)

/** \brief  128C, Message Object  Acceptance Mask Register */
#define CAN_MO20_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001928Cu)

/** Alias (User Manual Name) for CAN_MO20_AMR.
* To use register names with standard convension, please use CAN_MO20_AMR.
*/
#define	CAN_MOAMR20	(CAN_MO20_AMR)

/** \brief  1298, Message Object  Arbitration Register */
#define CAN_MO20_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019298u)

/** Alias (User Manual Name) for CAN_MO20_AR.
* To use register names with standard convension, please use CAN_MO20_AR.
*/
#define	CAN_MOAR20	(CAN_MO20_AR)

/** \brief  129C, Message Object  Control Register */
#define CAN_MO20_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001929Cu)

/** Alias (User Manual Name) for CAN_MO20_CTR.
* To use register names with standard convension, please use CAN_MO20_CTR.
*/
#define	CAN_MOCTR20	(CAN_MO20_CTR)

/** \brief  1294, Message Object  Data Register High */
#define CAN_MO20_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019294u)

/** Alias (User Manual Name) for CAN_MO20_DATAH.
* To use register names with standard convension, please use CAN_MO20_DATAH.
*/
#define	CAN_MODATAH20	(CAN_MO20_DATAH)

/** \brief  1290, Message Object  Data Register Low */
#define CAN_MO20_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019290u)

/** Alias (User Manual Name) for CAN_MO20_DATAL.
* To use register names with standard convension, please use CAN_MO20_DATAL.
*/
#define	CAN_MODATAL20	(CAN_MO20_DATAL)

/** \brief  1280, Message Object  Function Control Register */
#define CAN_MO20_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019280u)

/** Alias (User Manual Name) for CAN_MO20_EDATA0.
* To use register names with standard convension, please use CAN_MO20_EDATA0.
*/
#define	CAN_EMO20DATA0	(CAN_MO20_EDATA0)

/** \brief  1284, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO20_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019284u)

/** Alias (User Manual Name) for CAN_MO20_EDATA1.
* To use register names with standard convension, please use CAN_MO20_EDATA1.
*/
#define	CAN_EMO20DATA1	(CAN_MO20_EDATA1)

/** \brief  1288, Message Object  Interrupt Pointer Register */
#define CAN_MO20_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019288u)

/** Alias (User Manual Name) for CAN_MO20_EDATA2.
* To use register names with standard convension, please use CAN_MO20_EDATA2.
*/
#define	CAN_EMO20DATA2	(CAN_MO20_EDATA2)

/** \brief  128C, Message Object  Acceptance Mask Register */
#define CAN_MO20_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001928Cu)

/** Alias (User Manual Name) for CAN_MO20_EDATA3.
* To use register names with standard convension, please use CAN_MO20_EDATA3.
*/
#define	CAN_EMO20DATA3	(CAN_MO20_EDATA3)

/** \brief  1290, Message Object  Data Register Low */
#define CAN_MO20_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019290u)

/** Alias (User Manual Name) for CAN_MO20_EDATA4.
* To use register names with standard convension, please use CAN_MO20_EDATA4.
*/
#define	CAN_EMO20DATA4	(CAN_MO20_EDATA4)

/** \brief  1294, Message Object  Data Register High */
#define CAN_MO20_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019294u)

/** Alias (User Manual Name) for CAN_MO20_EDATA5.
* To use register names with standard convension, please use CAN_MO20_EDATA5.
*/
#define	CAN_EMO20DATA5	(CAN_MO20_EDATA5)

/** \brief  1298, Message Object  Arbitration Register */
#define CAN_MO20_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019298u)

/** Alias (User Manual Name) for CAN_MO20_EDATA6.
* To use register names with standard convension, please use CAN_MO20_EDATA6.
*/
#define	CAN_EMO20DATA6	(CAN_MO20_EDATA6)

/** \brief  1280, Message Object  Function Control Register */
#define CAN_MO20_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019280u)

/** Alias (User Manual Name) for CAN_MO20_FCR.
* To use register names with standard convension, please use CAN_MO20_FCR.
*/
#define	CAN_MOFCR20	(CAN_MO20_FCR)

/** \brief  1284, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO20_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019284u)

/** Alias (User Manual Name) for CAN_MO20_FGPR.
* To use register names with standard convension, please use CAN_MO20_FGPR.
*/
#define	CAN_MOFGPR20	(CAN_MO20_FGPR)

