leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO23_EDATA4.
* To use register names with standard convension, please use CAN_MO23_EDATA4.
*/
#define	CAN_EMO23DATA4	(CAN_MO23_EDATA4)

/** \brief  12F4, Message Object  Data Register High */
#define CAN_MO23_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00192F4u)

/** Alias (User Manual Name) for CAN_MO23_EDATA5.
* To use register names with standard convension, please use CAN_MO23_EDATA5.
*/
#define	CAN_EMO23DATA5	(CAN_MO23_EDATA5)

/** \brief  12F8, Message Object  Arbitration Register */
#define CAN_MO23_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00192F8u)

/** Alias (User Manual Name) for CAN_MO23_EDATA6.
* To use register names with standard convension, please use CAN_MO23_EDATA6.
*/
#define	CAN_EMO23DATA6	(CAN_MO23_EDATA6)

/** \brief  12E0, Message Object  Function Control Register */
#define CAN_MO23_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00192E0u)

/** Alias (User Manual Name) for CAN_MO23_FCR.
* To use register names with standard convension, please use CAN_MO23_FCR.
*/
#define	CAN_MOFCR23	(CAN_MO23_FCR)

/** \brief  12E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO23_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00192E4u)

/** Alias (User Manual Name) for CAN_MO23_FGPR.
* To use register names with standard convension, please use CAN_MO23_FGPR.
*/
#define	CAN_MOFGPR23	(CAN_MO23_FGPR)

/** \brief  12E8, Message Object  Interrupt Pointer Register */
#define CAN_MO23_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00192E8u)

/** Alias (User Manual Name) for CAN_MO23_IPR.
* To use register names with standard convension, please use CAN_MO23_IPR.
*/
#define	CAN_MOIPR23	(CAN_MO23_IPR)

/** \brief  12FC, Message Object  Control Register */
#define CAN_MO23_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00192FCu)

/** Alias (User Manual Name) for CAN_MO23_STAT.
* To use register names with standard convension, please use CAN_MO23_STAT.
*/
#define	CAN_MOSTAT23	(CAN_MO23_STAT)

/** \brief  130C, Message Object  Acceptance Mask Register */
#define CAN_MO24_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001930Cu)

/** Alias (User Manual Name) for CAN_MO24_AMR.
* To use register names with standard convension, please use CAN_MO24_AMR.
*/
#define	CAN_MOAMR24	(CAN_MO24_AMR)

/** \brief  1318, Message Object  Arbitration Register */
#define CAN_MO24_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019318u)

/** Alias (User Manual Name) for CAN_MO24_AR.
* To use register names with standard convension, please use CAN_MO24_AR.
*/
#define	CAN_MOAR24	(CAN_MO24_AR)

/** \brief  131C, Message Object  Control Register */
#define CAN_MO24_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001931Cu)

/** Alias (User Manual Name) for CAN_MO24_CTR.
* To use register names with standard convension, please use CAN_MO24_CTR.
*/
#define	CAN_MOCTR24	(CAN_MO24_CTR)

/** \brief  1314, Message Object  Data Register High */
#define CAN_MO24_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019314u)

/** Alias (User Manual Name) for CAN_MO24_DATAH.
* To use register names with standard convension, please use CAN_MO24_DATAH.
*/
#define	CAN_MODATAH24	(CAN_MO24_DATAH)

/** \brief  1310, Message Object  Data Register Low */
#define CAN_MO24_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019310u)

/** Alias (User Manual Name) for CAN_MO24_DATAL.
* To use register names with standard convension, please use CAN_MO24_DATAL.
*/
#define	CAN_MODATAL24	(CAN_MO24_DATAL)

/** \brief  1300, Message Object  Function Control Register */
#define CAN_MO24_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019300u)

/** Alias (User Manual Name) for CAN_MO24_EDATA0.
* To use register names with standard convension, please use CAN_MO24_EDATA0.
*/
#define	CAN_EMO24DATA0	(CAN_MO24_EDATA0)

/** \brief  1304, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO24_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019304u)

/** Alias (User Manual Name) for CAN_MO24_EDATA1.
* To use register names with standard convension, please use CAN_MO24_EDATA1.
*/
#define	CAN_EMO24DATA1	(CAN_MO24_EDATA1)

/** \brief  1308, Message Object  Interrupt Pointer Register */
#define CAN_MO24_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019308u)

/** Alias (User Manual Name) for CAN_MO24_EDATA2.
* To use register names with standard convension, please use CAN_MO24_EDATA2.
*/
#define	CAN_EMO24DATA2	(CAN_MO24_EDATA2)

/** \brief  130C, Message Object  Acceptance Mask Register */
#define CAN_MO24_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001930Cu)

/** Alias (User Manual Name) for CAN_MO24_EDATA3.
* To use register names with standard convension, please use CAN_MO24_EDATA3.
*/
#define	CAN_EMO24DATA3	(CAN_MO24_EDATA3)

/** \brief  1310, Message Object  Data Register Low */
#define CAN_MO24_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019310u)

/** Alias (User Manual Name) for CAN_MO24_EDATA4.
* To use register names with standard convension, please use CAN_MO24_EDATA4.
*/
#define	CAN_EMO24DATA4	(CAN_MO24_EDATA4)

/** \brief  1314, Message Object  Data Register High */
#define CAN_MO24_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019314u)

/** Alias (User Manual Name) for CAN_MO24_EDATA5.
* To use register names with standard convension, please use CAN_MO24_EDATA5.
*/
#define	CAN_EMO24DATA5	(CAN_MO24_EDATA5)

/** \brief  1318, Message Object  Arbitration Register */
#define CAN_MO24_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019318u)

/** Alias (User Manual Name) for CAN_MO24_EDATA6.
* To use register names with standard convension, please use CAN_MO24_EDATA6.
*/
#define	CAN_EMO24DATA6	(CAN_MO24_EDATA6)

/** \brief  1300, Message Object  Function Control Register */
#define CAN_MO24_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019300u)

/** Alias (User Manual Name) for CAN_MO24_FCR.
* To use register names with standard convension, please use CAN_MO24_FCR.
*/
#define	CAN_MOFCR24	(CAN_MO24_FCR)

/** \brief  1304, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO24_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019304u)

