leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO24_FGPR.
* To use register names with standard convension, please use CAN_MO24_FGPR.
*/
#define	CAN_MOFGPR24	(CAN_MO24_FGPR)

/** \brief  1308, Message Object  Interrupt Pointer Register */
#define CAN_MO24_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019308u)

/** Alias (User Manual Name) for CAN_MO24_IPR.
* To use register names with standard convension, please use CAN_MO24_IPR.
*/
#define	CAN_MOIPR24	(CAN_MO24_IPR)

/** \brief  131C, Message Object  Control Register */
#define CAN_MO24_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001931Cu)

/** Alias (User Manual Name) for CAN_MO24_STAT.
* To use register names with standard convension, please use CAN_MO24_STAT.
*/
#define	CAN_MOSTAT24	(CAN_MO24_STAT)

/** \brief  132C, Message Object  Acceptance Mask Register */
#define CAN_MO25_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001932Cu)

/** Alias (User Manual Name) for CAN_MO25_AMR.
* To use register names with standard convension, please use CAN_MO25_AMR.
*/
#define	CAN_MOAMR25	(CAN_MO25_AMR)

/** \brief  1338, Message Object  Arbitration Register */
#define CAN_MO25_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019338u)

/** Alias (User Manual Name) for CAN_MO25_AR.
* To use register names with standard convension, please use CAN_MO25_AR.
*/
#define	CAN_MOAR25	(CAN_MO25_AR)

/** \brief  133C, Message Object  Control Register */
#define CAN_MO25_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001933Cu)

/** Alias (User Manual Name) for CAN_MO25_CTR.
* To use register names with standard convension, please use CAN_MO25_CTR.
*/
#define	CAN_MOCTR25	(CAN_MO25_CTR)

/** \brief  1334, Message Object  Data Register High */
#define CAN_MO25_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019334u)

/** Alias (User Manual Name) for CAN_MO25_DATAH.
* To use register names with standard convension, please use CAN_MO25_DATAH.
*/
#define	CAN_MODATAH25	(CAN_MO25_DATAH)

/** \brief  1330, Message Object  Data Register Low */
#define CAN_MO25_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019330u)

/** Alias (User Manual Name) for CAN_MO25_DATAL.
* To use register names with standard convension, please use CAN_MO25_DATAL.
*/
#define	CAN_MODATAL25	(CAN_MO25_DATAL)

/** \brief  1320, Message Object  Function Control Register */
#define CAN_MO25_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019320u)

/** Alias (User Manual Name) for CAN_MO25_EDATA0.
* To use register names with standard convension, please use CAN_MO25_EDATA0.
*/
#define	CAN_EMO25DATA0	(CAN_MO25_EDATA0)

/** \brief  1324, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO25_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019324u)

/** Alias (User Manual Name) for CAN_MO25_EDATA1.
* To use register names with standard convension, please use CAN_MO25_EDATA1.
*/
#define	CAN_EMO25DATA1	(CAN_MO25_EDATA1)

/** \brief  1328, Message Object  Interrupt Pointer Register */
#define CAN_MO25_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019328u)

/** Alias (User Manual Name) for CAN_MO25_EDATA2.
* To use register names with standard convension, please use CAN_MO25_EDATA2.
*/
#define	CAN_EMO25DATA2	(CAN_MO25_EDATA2)

/** \brief  132C, Message Object  Acceptance Mask Register */
#define CAN_MO25_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001932Cu)

/** Alias (User Manual Name) for CAN_MO25_EDATA3.
* To use register names with standard convension, please use CAN_MO25_EDATA3.
*/
#define	CAN_EMO25DATA3	(CAN_MO25_EDATA3)

/** \brief  1330, Message Object  Data Register Low */
#define CAN_MO25_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019330u)

/** Alias (User Manual Name) for CAN_MO25_EDATA4.
* To use register names with standard convension, please use CAN_MO25_EDATA4.
*/
#define	CAN_EMO25DATA4	(CAN_MO25_EDATA4)

/** \brief  1334, Message Object  Data Register High */
#define CAN_MO25_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019334u)

/** Alias (User Manual Name) for CAN_MO25_EDATA5.
* To use register names with standard convension, please use CAN_MO25_EDATA5.
*/
#define	CAN_EMO25DATA5	(CAN_MO25_EDATA5)

/** \brief  1338, Message Object  Arbitration Register */
#define CAN_MO25_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019338u)

/** Alias (User Manual Name) for CAN_MO25_EDATA6.
* To use register names with standard convension, please use CAN_MO25_EDATA6.
*/
#define	CAN_EMO25DATA6	(CAN_MO25_EDATA6)

/** \brief  1320, Message Object  Function Control Register */
#define CAN_MO25_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019320u)

/** Alias (User Manual Name) for CAN_MO25_FCR.
* To use register names with standard convension, please use CAN_MO25_FCR.
*/
#define	CAN_MOFCR25	(CAN_MO25_FCR)

/** \brief  1324, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO25_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019324u)

/** Alias (User Manual Name) for CAN_MO25_FGPR.
* To use register names with standard convension, please use CAN_MO25_FGPR.
*/
#define	CAN_MOFGPR25	(CAN_MO25_FGPR)

/** \brief  1328, Message Object  Interrupt Pointer Register */
#define CAN_MO25_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019328u)

/** Alias (User Manual Name) for CAN_MO25_IPR.
* To use register names with standard convension, please use CAN_MO25_IPR.
*/
#define	CAN_MOIPR25	(CAN_MO25_IPR)

/** \brief  133C, Message Object  Control Register */
#define CAN_MO25_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001933Cu)

/** Alias (User Manual Name) for CAN_MO25_STAT.
* To use register names with standard convension, please use CAN_MO25_STAT.
*/
#define	CAN_MOSTAT25	(CAN_MO25_STAT)

/** \brief  134C, Message Object  Acceptance Mask Register */
#define CAN_MO26_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001934Cu)

/** Alias (User Manual Name) for CAN_MO26_AMR.
* To use register names with standard convension, please use CAN_MO26_AMR.
*/
#define	CAN_MOAMR26	(CAN_MO26_AMR)

/** \brief  1358, Message Object  Arbitration Register */
#define CAN_MO26_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019358u)

/** Alias (User Manual Name) for CAN_MO26_AR.
* To use register names with standard convension, please use CAN_MO26_AR.
*/
#define	CAN_MOAR26	(CAN_MO26_AR)

/** \brief  135C, Message Object  Control Register */
#define CAN_MO26_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001935Cu)

