leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO27_EDATA4.
* To use register names with standard convension, please use CAN_MO27_EDATA4.
*/
#define	CAN_EMO27DATA4	(CAN_MO27_EDATA4)

/** \brief  1374, Message Object  Data Register High */
#define CAN_MO27_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019374u)

/** Alias (User Manual Name) for CAN_MO27_EDATA5.
* To use register names with standard convension, please use CAN_MO27_EDATA5.
*/
#define	CAN_EMO27DATA5	(CAN_MO27_EDATA5)

/** \brief  1378, Message Object  Arbitration Register */
#define CAN_MO27_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019378u)

/** Alias (User Manual Name) for CAN_MO27_EDATA6.
* To use register names with standard convension, please use CAN_MO27_EDATA6.
*/
#define	CAN_EMO27DATA6	(CAN_MO27_EDATA6)

/** \brief  1360, Message Object  Function Control Register */
#define CAN_MO27_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019360u)

/** Alias (User Manual Name) for CAN_MO27_FCR.
* To use register names with standard convension, please use CAN_MO27_FCR.
*/
#define	CAN_MOFCR27	(CAN_MO27_FCR)

/** \brief  1364, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO27_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019364u)

/** Alias (User Manual Name) for CAN_MO27_FGPR.
* To use register names with standard convension, please use CAN_MO27_FGPR.
*/
#define	CAN_MOFGPR27	(CAN_MO27_FGPR)

/** \brief  1368, Message Object  Interrupt Pointer Register */
#define CAN_MO27_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019368u)

/** Alias (User Manual Name) for CAN_MO27_IPR.
* To use register names with standard convension, please use CAN_MO27_IPR.
*/
#define	CAN_MOIPR27	(CAN_MO27_IPR)

/** \brief  137C, Message Object  Control Register */
#define CAN_MO27_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001937Cu)

/** Alias (User Manual Name) for CAN_MO27_STAT.
* To use register names with standard convension, please use CAN_MO27_STAT.
*/
#define	CAN_MOSTAT27	(CAN_MO27_STAT)

/** \brief  138C, Message Object  Acceptance Mask Register */
#define CAN_MO28_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001938Cu)

/** Alias (User Manual Name) for CAN_MO28_AMR.
* To use register names with standard convension, please use CAN_MO28_AMR.
*/
#define	CAN_MOAMR28	(CAN_MO28_AMR)

/** \brief  1398, Message Object  Arbitration Register */
#define CAN_MO28_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019398u)

/** Alias (User Manual Name) for CAN_MO28_AR.
* To use register names with standard convension, please use CAN_MO28_AR.
*/
#define	CAN_MOAR28	(CAN_MO28_AR)

/** \brief  139C, Message Object  Control Register */
#define CAN_MO28_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001939Cu)

/** Alias (User Manual Name) for CAN_MO28_CTR.
* To use register names with standard convension, please use CAN_MO28_CTR.
*/
#define	CAN_MOCTR28	(CAN_MO28_CTR)

/** \brief  1394, Message Object  Data Register High */
#define CAN_MO28_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019394u)

/** Alias (User Manual Name) for CAN_MO28_DATAH.
* To use register names with standard convension, please use CAN_MO28_DATAH.
*/
#define	CAN_MODATAH28	(CAN_MO28_DATAH)

/** \brief  1390, Message Object  Data Register Low */
#define CAN_MO28_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019390u)

/** Alias (User Manual Name) for CAN_MO28_DATAL.
* To use register names with standard convension, please use CAN_MO28_DATAL.
*/
#define	CAN_MODATAL28	(CAN_MO28_DATAL)

/** \brief  1380, Message Object  Function Control Register */
#define CAN_MO28_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019380u)

/** Alias (User Manual Name) for CAN_MO28_EDATA0.
* To use register names with standard convension, please use CAN_MO28_EDATA0.
*/
#define	CAN_EMO28DATA0	(CAN_MO28_EDATA0)

/** \brief  1384, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO28_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019384u)

/** Alias (User Manual Name) for CAN_MO28_EDATA1.
* To use register names with standard convension, please use CAN_MO28_EDATA1.
*/
#define	CAN_EMO28DATA1	(CAN_MO28_EDATA1)

/** \brief  1388, Message Object  Interrupt Pointer Register */
#define CAN_MO28_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019388u)

/** Alias (User Manual Name) for CAN_MO28_EDATA2.
* To use register names with standard convension, please use CAN_MO28_EDATA2.
*/
#define	CAN_EMO28DATA2	(CAN_MO28_EDATA2)

/** \brief  138C, Message Object  Acceptance Mask Register */
#define CAN_MO28_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001938Cu)

/** Alias (User Manual Name) for CAN_MO28_EDATA3.
* To use register names with standard convension, please use CAN_MO28_EDATA3.
*/
#define	CAN_EMO28DATA3	(CAN_MO28_EDATA3)

/** \brief  1390, Message Object  Data Register Low */
#define CAN_MO28_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019390u)

/** Alias (User Manual Name) for CAN_MO28_EDATA4.
* To use register names with standard convension, please use CAN_MO28_EDATA4.
*/
#define	CAN_EMO28DATA4	(CAN_MO28_EDATA4)

/** \brief  1394, Message Object  Data Register High */
#define CAN_MO28_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019394u)

/** Alias (User Manual Name) for CAN_MO28_EDATA5.
* To use register names with standard convension, please use CAN_MO28_EDATA5.
*/
#define	CAN_EMO28DATA5	(CAN_MO28_EDATA5)

/** \brief  1398, Message Object  Arbitration Register */
#define CAN_MO28_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019398u)

/** Alias (User Manual Name) for CAN_MO28_EDATA6.
* To use register names with standard convension, please use CAN_MO28_EDATA6.
*/
#define	CAN_EMO28DATA6	(CAN_MO28_EDATA6)

/** \brief  1380, Message Object  Function Control Register */
#define CAN_MO28_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019380u)

/** Alias (User Manual Name) for CAN_MO28_FCR.
* To use register names with standard convension, please use CAN_MO28_FCR.
*/
#define	CAN_MOFCR28	(CAN_MO28_FCR)

