leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1384, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO28_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019384u)

/** Alias (User Manual Name) for CAN_MO28_FGPR.
* To use register names with standard convension, please use CAN_MO28_FGPR.
*/
#define	CAN_MOFGPR28	(CAN_MO28_FGPR)

/** \brief  1388, Message Object  Interrupt Pointer Register */
#define CAN_MO28_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019388u)

/** Alias (User Manual Name) for CAN_MO28_IPR.
* To use register names with standard convension, please use CAN_MO28_IPR.
*/
#define	CAN_MOIPR28	(CAN_MO28_IPR)

/** \brief  139C, Message Object  Control Register */
#define CAN_MO28_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001939Cu)

/** Alias (User Manual Name) for CAN_MO28_STAT.
* To use register names with standard convension, please use CAN_MO28_STAT.
*/
#define	CAN_MOSTAT28	(CAN_MO28_STAT)

/** \brief  13AC, Message Object  Acceptance Mask Register */
#define CAN_MO29_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00193ACu)

/** Alias (User Manual Name) for CAN_MO29_AMR.
* To use register names with standard convension, please use CAN_MO29_AMR.
*/
#define	CAN_MOAMR29	(CAN_MO29_AMR)

/** \brief  13B8, Message Object  Arbitration Register */
#define CAN_MO29_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00193B8u)

/** Alias (User Manual Name) for CAN_MO29_AR.
* To use register names with standard convension, please use CAN_MO29_AR.
*/
#define	CAN_MOAR29	(CAN_MO29_AR)

/** \brief  13BC, Message Object  Control Register */
#define CAN_MO29_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00193BCu)

/** Alias (User Manual Name) for CAN_MO29_CTR.
* To use register names with standard convension, please use CAN_MO29_CTR.
*/
#define	CAN_MOCTR29	(CAN_MO29_CTR)

/** \brief  13B4, Message Object  Data Register High */
#define CAN_MO29_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00193B4u)

/** Alias (User Manual Name) for CAN_MO29_DATAH.
* To use register names with standard convension, please use CAN_MO29_DATAH.
*/
#define	CAN_MODATAH29	(CAN_MO29_DATAH)

/** \brief  13B0, Message Object  Data Register Low */
#define CAN_MO29_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00193B0u)

/** Alias (User Manual Name) for CAN_MO29_DATAL.
* To use register names with standard convension, please use CAN_MO29_DATAL.
*/
#define	CAN_MODATAL29	(CAN_MO29_DATAL)

/** \brief  13A0, Message Object  Function Control Register */
#define CAN_MO29_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00193A0u)

/** Alias (User Manual Name) for CAN_MO29_EDATA0.
* To use register names with standard convension, please use CAN_MO29_EDATA0.
*/
#define	CAN_EMO29DATA0	(CAN_MO29_EDATA0)

/** \brief  13A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO29_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00193A4u)

/** Alias (User Manual Name) for CAN_MO29_EDATA1.
* To use register names with standard convension, please use CAN_MO29_EDATA1.
*/
#define	CAN_EMO29DATA1	(CAN_MO29_EDATA1)

/** \brief  13A8, Message Object  Interrupt Pointer Register */
#define CAN_MO29_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00193A8u)

/** Alias (User Manual Name) for CAN_MO29_EDATA2.
* To use register names with standard convension, please use CAN_MO29_EDATA2.
*/
#define	CAN_EMO29DATA2	(CAN_MO29_EDATA2)

/** \brief  13AC, Message Object  Acceptance Mask Register */
#define CAN_MO29_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00193ACu)

/** Alias (User Manual Name) for CAN_MO29_EDATA3.
* To use register names with standard convension, please use CAN_MO29_EDATA3.
*/
#define	CAN_EMO29DATA3	(CAN_MO29_EDATA3)

/** \brief  13B0, Message Object  Data Register Low */
#define CAN_MO29_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00193B0u)

/** Alias (User Manual Name) for CAN_MO29_EDATA4.
* To use register names with standard convension, please use CAN_MO29_EDATA4.
*/
#define	CAN_EMO29DATA4	(CAN_MO29_EDATA4)

/** \brief  13B4, Message Object  Data Register High */
#define CAN_MO29_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00193B4u)

/** Alias (User Manual Name) for CAN_MO29_EDATA5.
* To use register names with standard convension, please use CAN_MO29_EDATA5.
*/
#define	CAN_EMO29DATA5	(CAN_MO29_EDATA5)

/** \brief  13B8, Message Object  Arbitration Register */
#define CAN_MO29_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00193B8u)

/** Alias (User Manual Name) for CAN_MO29_EDATA6.
* To use register names with standard convension, please use CAN_MO29_EDATA6.
*/
#define	CAN_EMO29DATA6	(CAN_MO29_EDATA6)

/** \brief  13A0, Message Object  Function Control Register */
#define CAN_MO29_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00193A0u)

/** Alias (User Manual Name) for CAN_MO29_FCR.
* To use register names with standard convension, please use CAN_MO29_FCR.
*/
#define	CAN_MOFCR29	(CAN_MO29_FCR)

/** \brief  13A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO29_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00193A4u)

/** Alias (User Manual Name) for CAN_MO29_FGPR.
* To use register names with standard convension, please use CAN_MO29_FGPR.
*/
#define	CAN_MOFGPR29	(CAN_MO29_FGPR)

/** \brief  13A8, Message Object  Interrupt Pointer Register */
#define CAN_MO29_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00193A8u)

/** Alias (User Manual Name) for CAN_MO29_IPR.
* To use register names with standard convension, please use CAN_MO29_IPR.
*/
#define	CAN_MOIPR29	(CAN_MO29_IPR)

/** \brief  13BC, Message Object  Control Register */
#define CAN_MO29_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00193BCu)

/** Alias (User Manual Name) for CAN_MO29_STAT.
* To use register names with standard convension, please use CAN_MO29_STAT.
*/
#define	CAN_MOSTAT29	(CAN_MO29_STAT)

/** \brief  104C, Message Object  Acceptance Mask Register */
#define CAN_MO2_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001904Cu)

/** Alias (User Manual Name) for CAN_MO2_AMR.
* To use register names with standard convension, please use CAN_MO2_AMR.
*/
#define	CAN_MOAMR2	(CAN_MO2_AMR)

/** \brief  1058, Message Object  Arbitration Register */
#define CAN_MO2_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019058u)

/** Alias (User Manual Name) for CAN_MO2_AR.
* To use register names with standard convension, please use CAN_MO2_AR.
*/
#define	CAN_MOAR2	(CAN_MO2_AR)

/** \brief  105C, Message Object  Control Register */
#define CAN_MO2_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001905Cu)

/** Alias (User Manual Name) for CAN_MO2_CTR.
* To use register names with standard convension, please use CAN_MO2_CTR.
*/
#define	CAN_MOCTR2	(CAN_MO2_CTR)

/** \brief  1054, Message Object  Data Register High */
#define CAN_MO2_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019054u)

/** Alias (User Manual Name) for CAN_MO2_DATAH.
* To use register names with standard convension, please use CAN_MO2_DATAH.
*/
#define	CAN_MODATAH2	(CAN_MO2_DATAH)

