leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1050, Message Object  Data Register Low */
#define CAN_MO2_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019050u)

/** Alias (User Manual Name) for CAN_MO2_DATAL.
* To use register names with standard convension, please use CAN_MO2_DATAL.
*/
#define	CAN_MODATAL2	(CAN_MO2_DATAL)

/** \brief  1040, Message Object  Function Control Register */
#define CAN_MO2_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019040u)

/** Alias (User Manual Name) for CAN_MO2_EDATA0.
* To use register names with standard convension, please use CAN_MO2_EDATA0.
*/
#define	CAN_EMO2DATA0	(CAN_MO2_EDATA0)

/** \brief  1044, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO2_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019044u)

/** Alias (User Manual Name) for CAN_MO2_EDATA1.
* To use register names with standard convension, please use CAN_MO2_EDATA1.
*/
#define	CAN_EMO2DATA1	(CAN_MO2_EDATA1)

/** \brief  1048, Message Object  Interrupt Pointer Register */
#define CAN_MO2_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019048u)

/** Alias (User Manual Name) for CAN_MO2_EDATA2.
* To use register names with standard convension, please use CAN_MO2_EDATA2.
*/
#define	CAN_EMO2DATA2	(CAN_MO2_EDATA2)

/** \brief  104C, Message Object  Acceptance Mask Register */
#define CAN_MO2_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001904Cu)

/** Alias (User Manual Name) for CAN_MO2_EDATA3.
* To use register names with standard convension, please use CAN_MO2_EDATA3.
*/
#define	CAN_EMO2DATA3	(CAN_MO2_EDATA3)

/** \brief  1050, Message Object  Data Register Low */
#define CAN_MO2_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019050u)

/** Alias (User Manual Name) for CAN_MO2_EDATA4.
* To use register names with standard convension, please use CAN_MO2_EDATA4.
*/
#define	CAN_EMO2DATA4	(CAN_MO2_EDATA4)

/** \brief  1054, Message Object  Data Register High */
#define CAN_MO2_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019054u)

/** Alias (User Manual Name) for CAN_MO2_EDATA5.
* To use register names with standard convension, please use CAN_MO2_EDATA5.
*/
#define	CAN_EMO2DATA5	(CAN_MO2_EDATA5)

/** \brief  1058, Message Object  Arbitration Register */
#define CAN_MO2_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019058u)

/** Alias (User Manual Name) for CAN_MO2_EDATA6.
* To use register names with standard convension, please use CAN_MO2_EDATA6.
*/
#define	CAN_EMO2DATA6	(CAN_MO2_EDATA6)

/** \brief  1040, Message Object  Function Control Register */
#define CAN_MO2_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019040u)

/** Alias (User Manual Name) for CAN_MO2_FCR.
* To use register names with standard convension, please use CAN_MO2_FCR.
*/
#define	CAN_MOFCR2	(CAN_MO2_FCR)

/** \brief  1044, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO2_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019044u)

/** Alias (User Manual Name) for CAN_MO2_FGPR.
* To use register names with standard convension, please use CAN_MO2_FGPR.
*/
#define	CAN_MOFGPR2	(CAN_MO2_FGPR)

/** \brief  1048, Message Object  Interrupt Pointer Register */
#define CAN_MO2_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019048u)

/** Alias (User Manual Name) for CAN_MO2_IPR.
* To use register names with standard convension, please use CAN_MO2_IPR.
*/
#define	CAN_MOIPR2	(CAN_MO2_IPR)

/** \brief  105C, Message Object  Control Register */
#define CAN_MO2_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001905Cu)

/** Alias (User Manual Name) for CAN_MO2_STAT.
* To use register names with standard convension, please use CAN_MO2_STAT.
*/
#define	CAN_MOSTAT2	(CAN_MO2_STAT)

/** \brief  13CC, Message Object  Acceptance Mask Register */
#define CAN_MO30_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00193CCu)

/** Alias (User Manual Name) for CAN_MO30_AMR.
* To use register names with standard convension, please use CAN_MO30_AMR.
*/
#define	CAN_MOAMR30	(CAN_MO30_AMR)

/** \brief  13D8, Message Object  Arbitration Register */
#define CAN_MO30_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00193D8u)

/** Alias (User Manual Name) for CAN_MO30_AR.
* To use register names with standard convension, please use CAN_MO30_AR.
*/
#define	CAN_MOAR30	(CAN_MO30_AR)

/** \brief  13DC, Message Object  Control Register */
#define CAN_MO30_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00193DCu)

/** Alias (User Manual Name) for CAN_MO30_CTR.
* To use register names with standard convension, please use CAN_MO30_CTR.
*/
#define	CAN_MOCTR30	(CAN_MO30_CTR)

/** \brief  13D4, Message Object  Data Register High */
#define CAN_MO30_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00193D4u)

/** Alias (User Manual Name) for CAN_MO30_DATAH.
* To use register names with standard convension, please use CAN_MO30_DATAH.
*/
#define	CAN_MODATAH30	(CAN_MO30_DATAH)

/** \brief  13D0, Message Object  Data Register Low */
#define CAN_MO30_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00193D0u)

/** Alias (User Manual Name) for CAN_MO30_DATAL.
* To use register names with standard convension, please use CAN_MO30_DATAL.
*/
#define	CAN_MODATAL30	(CAN_MO30_DATAL)

/** \brief  13C0, Message Object  Function Control Register */
#define CAN_MO30_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00193C0u)

/** Alias (User Manual Name) for CAN_MO30_EDATA0.
* To use register names with standard convension, please use CAN_MO30_EDATA0.
*/
#define	CAN_EMO30DATA0	(CAN_MO30_EDATA0)

/** \brief  13C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO30_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00193C4u)

/** Alias (User Manual Name) for CAN_MO30_EDATA1.
* To use register names with standard convension, please use CAN_MO30_EDATA1.
*/
#define	CAN_EMO30DATA1	(CAN_MO30_EDATA1)

/** \brief  13C8, Message Object  Interrupt Pointer Register */
#define CAN_MO30_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00193C8u)

/** Alias (User Manual Name) for CAN_MO30_EDATA2.
* To use register names with standard convension, please use CAN_MO30_EDATA2.
*/
#define	CAN_EMO30DATA2	(CAN_MO30_EDATA2)

