leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  13CC, Message Object  Acceptance Mask Register */
#define CAN_MO30_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00193CCu)

/** Alias (User Manual Name) for CAN_MO30_EDATA3.
* To use register names with standard convension, please use CAN_MO30_EDATA3.
*/
#define	CAN_EMO30DATA3	(CAN_MO30_EDATA3)

/** \brief  13D0, Message Object  Data Register Low */
#define CAN_MO30_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00193D0u)

/** Alias (User Manual Name) for CAN_MO30_EDATA4.
* To use register names with standard convension, please use CAN_MO30_EDATA4.
*/
#define	CAN_EMO30DATA4	(CAN_MO30_EDATA4)

/** \brief  13D4, Message Object  Data Register High */
#define CAN_MO30_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00193D4u)

/** Alias (User Manual Name) for CAN_MO30_EDATA5.
* To use register names with standard convension, please use CAN_MO30_EDATA5.
*/
#define	CAN_EMO30DATA5	(CAN_MO30_EDATA5)

/** \brief  13D8, Message Object  Arbitration Register */
#define CAN_MO30_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00193D8u)

/** Alias (User Manual Name) for CAN_MO30_EDATA6.
* To use register names with standard convension, please use CAN_MO30_EDATA6.
*/
#define	CAN_EMO30DATA6	(CAN_MO30_EDATA6)

/** \brief  13C0, Message Object  Function Control Register */
#define CAN_MO30_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00193C0u)

/** Alias (User Manual Name) for CAN_MO30_FCR.
* To use register names with standard convension, please use CAN_MO30_FCR.
*/
#define	CAN_MOFCR30	(CAN_MO30_FCR)

/** \brief  13C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO30_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00193C4u)

/** Alias (User Manual Name) for CAN_MO30_FGPR.
* To use register names with standard convension, please use CAN_MO30_FGPR.
*/
#define	CAN_MOFGPR30	(CAN_MO30_FGPR)

/** \brief  13C8, Message Object  Interrupt Pointer Register */
#define CAN_MO30_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00193C8u)

/** Alias (User Manual Name) for CAN_MO30_IPR.
* To use register names with standard convension, please use CAN_MO30_IPR.
*/
#define	CAN_MOIPR30	(CAN_MO30_IPR)

/** \brief  13DC, Message Object  Control Register */
#define CAN_MO30_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00193DCu)

/** Alias (User Manual Name) for CAN_MO30_STAT.
* To use register names with standard convension, please use CAN_MO30_STAT.
*/
#define	CAN_MOSTAT30	(CAN_MO30_STAT)

/** \brief  13EC, Message Object  Acceptance Mask Register */
#define CAN_MO31_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00193ECu)

/** Alias (User Manual Name) for CAN_MO31_AMR.
* To use register names with standard convension, please use CAN_MO31_AMR.
*/
#define	CAN_MOAMR31	(CAN_MO31_AMR)

/** \brief  13F8, Message Object  Arbitration Register */
#define CAN_MO31_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00193F8u)

/** Alias (User Manual Name) for CAN_MO31_AR.
* To use register names with standard convension, please use CAN_MO31_AR.
*/
#define	CAN_MOAR31	(CAN_MO31_AR)

/** \brief  13FC, Message Object  Control Register */
#define CAN_MO31_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00193FCu)

/** Alias (User Manual Name) for CAN_MO31_CTR.
* To use register names with standard convension, please use CAN_MO31_CTR.
*/
#define	CAN_MOCTR31	(CAN_MO31_CTR)

/** \brief  13F4, Message Object  Data Register High */
#define CAN_MO31_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00193F4u)

/** Alias (User Manual Name) for CAN_MO31_DATAH.
* To use register names with standard convension, please use CAN_MO31_DATAH.
*/
#define	CAN_MODATAH31	(CAN_MO31_DATAH)

/** \brief  13F0, Message Object  Data Register Low */
#define CAN_MO31_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00193F0u)

/** Alias (User Manual Name) for CAN_MO31_DATAL.
* To use register names with standard convension, please use CAN_MO31_DATAL.
*/
#define	CAN_MODATAL31	(CAN_MO31_DATAL)

/** \brief  13E0, Message Object  Function Control Register */
#define CAN_MO31_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00193E0u)

/** Alias (User Manual Name) for CAN_MO31_EDATA0.
* To use register names with standard convension, please use CAN_MO31_EDATA0.
*/
#define	CAN_EMO31DATA0	(CAN_MO31_EDATA0)

/** \brief  13E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO31_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00193E4u)

/** Alias (User Manual Name) for CAN_MO31_EDATA1.
* To use register names with standard convension, please use CAN_MO31_EDATA1.
*/
#define	CAN_EMO31DATA1	(CAN_MO31_EDATA1)

/** \brief  13E8, Message Object  Interrupt Pointer Register */
#define CAN_MO31_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00193E8u)

/** Alias (User Manual Name) for CAN_MO31_EDATA2.
* To use register names with standard convension, please use CAN_MO31_EDATA2.
*/
#define	CAN_EMO31DATA2	(CAN_MO31_EDATA2)

/** \brief  13EC, Message Object  Acceptance Mask Register */
#define CAN_MO31_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00193ECu)

/** Alias (User Manual Name) for CAN_MO31_EDATA3.
* To use register names with standard convension, please use CAN_MO31_EDATA3.
*/
#define	CAN_EMO31DATA3	(CAN_MO31_EDATA3)

/** \brief  13F0, Message Object  Data Register Low */
#define CAN_MO31_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00193F0u)

/** Alias (User Manual Name) for CAN_MO31_EDATA4.
* To use register names with standard convension, please use CAN_MO31_EDATA4.
*/
#define	CAN_EMO31DATA4	(CAN_MO31_EDATA4)

/** \brief  13F4, Message Object  Data Register High */
#define CAN_MO31_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00193F4u)

/** Alias (User Manual Name) for CAN_MO31_EDATA5.
* To use register names with standard convension, please use CAN_MO31_EDATA5.
*/
#define	CAN_EMO31DATA5	(CAN_MO31_EDATA5)

/** \brief  13F8, Message Object  Arbitration Register */
#define CAN_MO31_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00193F8u)

/** Alias (User Manual Name) for CAN_MO31_EDATA6.
* To use register names with standard convension, please use CAN_MO31_EDATA6.
*/
#define	CAN_EMO31DATA6	(CAN_MO31_EDATA6)

/** \brief  13E0, Message Object  Function Control Register */
#define CAN_MO31_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00193E0u)

/** Alias (User Manual Name) for CAN_MO31_FCR.
* To use register names with standard convension, please use CAN_MO31_FCR.
*/
#define	CAN_MOFCR31	(CAN_MO31_FCR)

/** \brief  13E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO31_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00193E4u)

/** Alias (User Manual Name) for CAN_MO31_FGPR.
* To use register names with standard convension, please use CAN_MO31_FGPR.
*/
#define	CAN_MOFGPR31	(CAN_MO31_FGPR)

/** \brief  13E8, Message Object  Interrupt Pointer Register */
#define CAN_MO31_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00193E8u)

