leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  14CC, Message Object  Acceptance Mask Register */
#define CAN_MO38_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00194CCu)

/** Alias (User Manual Name) for CAN_MO38_EDATA3.
* To use register names with standard convension, please use CAN_MO38_EDATA3.
*/
#define	CAN_EMO38DATA3	(CAN_MO38_EDATA3)

/** \brief  14D0, Message Object  Data Register Low */
#define CAN_MO38_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00194D0u)

/** Alias (User Manual Name) for CAN_MO38_EDATA4.
* To use register names with standard convension, please use CAN_MO38_EDATA4.
*/
#define	CAN_EMO38DATA4	(CAN_MO38_EDATA4)

/** \brief  14D4, Message Object  Data Register High */
#define CAN_MO38_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00194D4u)

/** Alias (User Manual Name) for CAN_MO38_EDATA5.
* To use register names with standard convension, please use CAN_MO38_EDATA5.
*/
#define	CAN_EMO38DATA5	(CAN_MO38_EDATA5)

/** \brief  14D8, Message Object  Arbitration Register */
#define CAN_MO38_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00194D8u)

/** Alias (User Manual Name) for CAN_MO38_EDATA6.
* To use register names with standard convension, please use CAN_MO38_EDATA6.
*/
#define	CAN_EMO38DATA6	(CAN_MO38_EDATA6)

/** \brief  14C0, Message Object  Function Control Register */
#define CAN_MO38_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00194C0u)

/** Alias (User Manual Name) for CAN_MO38_FCR.
* To use register names with standard convension, please use CAN_MO38_FCR.
*/
#define	CAN_MOFCR38	(CAN_MO38_FCR)

/** \brief  14C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO38_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00194C4u)

/** Alias (User Manual Name) for CAN_MO38_FGPR.
* To use register names with standard convension, please use CAN_MO38_FGPR.
*/
#define	CAN_MOFGPR38	(CAN_MO38_FGPR)

/** \brief  14C8, Message Object  Interrupt Pointer Register */
#define CAN_MO38_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00194C8u)

/** Alias (User Manual Name) for CAN_MO38_IPR.
* To use register names with standard convension, please use CAN_MO38_IPR.
*/
#define	CAN_MOIPR38	(CAN_MO38_IPR)

/** \brief  14DC, Message Object  Control Register */
#define CAN_MO38_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00194DCu)

/** Alias (User Manual Name) for CAN_MO38_STAT.
* To use register names with standard convension, please use CAN_MO38_STAT.
*/
#define	CAN_MOSTAT38	(CAN_MO38_STAT)

/** \brief  14EC, Message Object  Acceptance Mask Register */
#define CAN_MO39_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00194ECu)

/** Alias (User Manual Name) for CAN_MO39_AMR.
* To use register names with standard convension, please use CAN_MO39_AMR.
*/
#define	CAN_MOAMR39	(CAN_MO39_AMR)

/** \brief  14F8, Message Object  Arbitration Register */
#define CAN_MO39_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00194F8u)

/** Alias (User Manual Name) for CAN_MO39_AR.
* To use register names with standard convension, please use CAN_MO39_AR.
*/
#define	CAN_MOAR39	(CAN_MO39_AR)

/** \brief  14FC, Message Object  Control Register */
#define CAN_MO39_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00194FCu)

/** Alias (User Manual Name) for CAN_MO39_CTR.
* To use register names with standard convension, please use CAN_MO39_CTR.
*/
#define	CAN_MOCTR39	(CAN_MO39_CTR)

/** \brief  14F4, Message Object  Data Register High */
#define CAN_MO39_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00194F4u)

/** Alias (User Manual Name) for CAN_MO39_DATAH.
* To use register names with standard convension, please use CAN_MO39_DATAH.
*/
#define	CAN_MODATAH39	(CAN_MO39_DATAH)

/** \brief  14F0, Message Object  Data Register Low */
#define CAN_MO39_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00194F0u)

/** Alias (User Manual Name) for CAN_MO39_DATAL.
* To use register names with standard convension, please use CAN_MO39_DATAL.
*/
#define	CAN_MODATAL39	(CAN_MO39_DATAL)

/** \brief  14E0, Message Object  Function Control Register */
#define CAN_MO39_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00194E0u)

/** Alias (User Manual Name) for CAN_MO39_EDATA0.
* To use register names with standard convension, please use CAN_MO39_EDATA0.
*/
#define	CAN_EMO39DATA0	(CAN_MO39_EDATA0)

/** \brief  14E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO39_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00194E4u)

/** Alias (User Manual Name) for CAN_MO39_EDATA1.
* To use register names with standard convension, please use CAN_MO39_EDATA1.
*/
#define	CAN_EMO39DATA1	(CAN_MO39_EDATA1)

/** \brief  14E8, Message Object  Interrupt Pointer Register */
#define CAN_MO39_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00194E8u)

/** Alias (User Manual Name) for CAN_MO39_EDATA2.
* To use register names with standard convension, please use CAN_MO39_EDATA2.
*/
#define	CAN_EMO39DATA2	(CAN_MO39_EDATA2)

/** \brief  14EC, Message Object  Acceptance Mask Register */
#define CAN_MO39_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00194ECu)

/** Alias (User Manual Name) for CAN_MO39_EDATA3.
* To use register names with standard convension, please use CAN_MO39_EDATA3.
*/
#define	CAN_EMO39DATA3	(CAN_MO39_EDATA3)

/** \brief  14F0, Message Object  Data Register Low */
#define CAN_MO39_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00194F0u)

/** Alias (User Manual Name) for CAN_MO39_EDATA4.
* To use register names with standard convension, please use CAN_MO39_EDATA4.
*/
#define	CAN_EMO39DATA4	(CAN_MO39_EDATA4)

/** \brief  14F4, Message Object  Data Register High */
#define CAN_MO39_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00194F4u)

/** Alias (User Manual Name) for CAN_MO39_EDATA5.
* To use register names with standard convension, please use CAN_MO39_EDATA5.
*/
#define	CAN_EMO39DATA5	(CAN_MO39_EDATA5)

/** \brief  14F8, Message Object  Arbitration Register */
#define CAN_MO39_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00194F8u)

/** Alias (User Manual Name) for CAN_MO39_EDATA6.
* To use register names with standard convension, please use CAN_MO39_EDATA6.
*/
#define	CAN_EMO39DATA6	(CAN_MO39_EDATA6)

