leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO41_DATAH.
* To use register names with standard convension, please use CAN_MO41_DATAH.
*/
#define	CAN_MODATAH41	(CAN_MO41_DATAH)

/** \brief  1530, Message Object  Data Register Low */
#define CAN_MO41_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019530u)

/** Alias (User Manual Name) for CAN_MO41_DATAL.
* To use register names with standard convension, please use CAN_MO41_DATAL.
*/
#define	CAN_MODATAL41	(CAN_MO41_DATAL)

/** \brief  1520, Message Object  Function Control Register */
#define CAN_MO41_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019520u)

/** Alias (User Manual Name) for CAN_MO41_EDATA0.
* To use register names with standard convension, please use CAN_MO41_EDATA0.
*/
#define	CAN_EMO41DATA0	(CAN_MO41_EDATA0)

/** \brief  1524, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO41_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019524u)

/** Alias (User Manual Name) for CAN_MO41_EDATA1.
* To use register names with standard convension, please use CAN_MO41_EDATA1.
*/
#define	CAN_EMO41DATA1	(CAN_MO41_EDATA1)

/** \brief  1528, Message Object  Interrupt Pointer Register */
#define CAN_MO41_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019528u)

/** Alias (User Manual Name) for CAN_MO41_EDATA2.
* To use register names with standard convension, please use CAN_MO41_EDATA2.
*/
#define	CAN_EMO41DATA2	(CAN_MO41_EDATA2)

/** \brief  152C, Message Object  Acceptance Mask Register */
#define CAN_MO41_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001952Cu)

/** Alias (User Manual Name) for CAN_MO41_EDATA3.
* To use register names with standard convension, please use CAN_MO41_EDATA3.
*/
#define	CAN_EMO41DATA3	(CAN_MO41_EDATA3)

/** \brief  1530, Message Object  Data Register Low */
#define CAN_MO41_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019530u)

/** Alias (User Manual Name) for CAN_MO41_EDATA4.
* To use register names with standard convension, please use CAN_MO41_EDATA4.
*/
#define	CAN_EMO41DATA4	(CAN_MO41_EDATA4)

/** \brief  1534, Message Object  Data Register High */
#define CAN_MO41_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019534u)

/** Alias (User Manual Name) for CAN_MO41_EDATA5.
* To use register names with standard convension, please use CAN_MO41_EDATA5.
*/
#define	CAN_EMO41DATA5	(CAN_MO41_EDATA5)

/** \brief  1538, Message Object  Arbitration Register */
#define CAN_MO41_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019538u)

/** Alias (User Manual Name) for CAN_MO41_EDATA6.
* To use register names with standard convension, please use CAN_MO41_EDATA6.
*/
#define	CAN_EMO41DATA6	(CAN_MO41_EDATA6)

/** \brief  1520, Message Object  Function Control Register */
#define CAN_MO41_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019520u)

/** Alias (User Manual Name) for CAN_MO41_FCR.
* To use register names with standard convension, please use CAN_MO41_FCR.
*/
#define	CAN_MOFCR41	(CAN_MO41_FCR)

/** \brief  1524, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO41_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019524u)

/** Alias (User Manual Name) for CAN_MO41_FGPR.
* To use register names with standard convension, please use CAN_MO41_FGPR.
*/
#define	CAN_MOFGPR41	(CAN_MO41_FGPR)

/** \brief  1528, Message Object  Interrupt Pointer Register */
#define CAN_MO41_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019528u)

/** Alias (User Manual Name) for CAN_MO41_IPR.
* To use register names with standard convension, please use CAN_MO41_IPR.
*/
#define	CAN_MOIPR41	(CAN_MO41_IPR)

/** \brief  153C, Message Object  Control Register */
#define CAN_MO41_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001953Cu)

/** Alias (User Manual Name) for CAN_MO41_STAT.
* To use register names with standard convension, please use CAN_MO41_STAT.
*/
#define	CAN_MOSTAT41	(CAN_MO41_STAT)

/** \brief  154C, Message Object  Acceptance Mask Register */
#define CAN_MO42_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001954Cu)

/** Alias (User Manual Name) for CAN_MO42_AMR.
* To use register names with standard convension, please use CAN_MO42_AMR.
*/
#define	CAN_MOAMR42	(CAN_MO42_AMR)

/** \brief  1558, Message Object  Arbitration Register */
#define CAN_MO42_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019558u)

/** Alias (User Manual Name) for CAN_MO42_AR.
* To use register names with standard convension, please use CAN_MO42_AR.
*/
#define	CAN_MOAR42	(CAN_MO42_AR)

/** \brief  155C, Message Object  Control Register */
#define CAN_MO42_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001955Cu)

/** Alias (User Manual Name) for CAN_MO42_CTR.
* To use register names with standard convension, please use CAN_MO42_CTR.
*/
#define	CAN_MOCTR42	(CAN_MO42_CTR)

/** \brief  1554, Message Object  Data Register High */
#define CAN_MO42_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019554u)

/** Alias (User Manual Name) for CAN_MO42_DATAH.
* To use register names with standard convension, please use CAN_MO42_DATAH.
*/
#define	CAN_MODATAH42	(CAN_MO42_DATAH)

/** \brief  1550, Message Object  Data Register Low */
#define CAN_MO42_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019550u)

/** Alias (User Manual Name) for CAN_MO42_DATAL.
* To use register names with standard convension, please use CAN_MO42_DATAL.
*/
#define	CAN_MODATAL42	(CAN_MO42_DATAL)

/** \brief  1540, Message Object  Function Control Register */
#define CAN_MO42_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019540u)

/** Alias (User Manual Name) for CAN_MO42_EDATA0.
* To use register names with standard convension, please use CAN_MO42_EDATA0.
*/
#define	CAN_EMO42DATA0	(CAN_MO42_EDATA0)

/** \brief  1544, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO42_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019544u)

/** Alias (User Manual Name) for CAN_MO42_EDATA1.
* To use register names with standard convension, please use CAN_MO42_EDATA1.
*/
#define	CAN_EMO42DATA1	(CAN_MO42_EDATA1)

