leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1548, Message Object  Interrupt Pointer Register */
#define CAN_MO42_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019548u)

/** Alias (User Manual Name) for CAN_MO42_EDATA2.
* To use register names with standard convension, please use CAN_MO42_EDATA2.
*/
#define	CAN_EMO42DATA2	(CAN_MO42_EDATA2)

/** \brief  154C, Message Object  Acceptance Mask Register */
#define CAN_MO42_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001954Cu)

/** Alias (User Manual Name) for CAN_MO42_EDATA3.
* To use register names with standard convension, please use CAN_MO42_EDATA3.
*/
#define	CAN_EMO42DATA3	(CAN_MO42_EDATA3)

/** \brief  1550, Message Object  Data Register Low */
#define CAN_MO42_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019550u)

/** Alias (User Manual Name) for CAN_MO42_EDATA4.
* To use register names with standard convension, please use CAN_MO42_EDATA4.
*/
#define	CAN_EMO42DATA4	(CAN_MO42_EDATA4)

/** \brief  1554, Message Object  Data Register High */
#define CAN_MO42_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019554u)

/** Alias (User Manual Name) for CAN_MO42_EDATA5.
* To use register names with standard convension, please use CAN_MO42_EDATA5.
*/
#define	CAN_EMO42DATA5	(CAN_MO42_EDATA5)

/** \brief  1558, Message Object  Arbitration Register */
#define CAN_MO42_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019558u)

/** Alias (User Manual Name) for CAN_MO42_EDATA6.
* To use register names with standard convension, please use CAN_MO42_EDATA6.
*/
#define	CAN_EMO42DATA6	(CAN_MO42_EDATA6)

/** \brief  1540, Message Object  Function Control Register */
#define CAN_MO42_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019540u)

/** Alias (User Manual Name) for CAN_MO42_FCR.
* To use register names with standard convension, please use CAN_MO42_FCR.
*/
#define	CAN_MOFCR42	(CAN_MO42_FCR)

/** \brief  1544, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO42_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019544u)

/** Alias (User Manual Name) for CAN_MO42_FGPR.
* To use register names with standard convension, please use CAN_MO42_FGPR.
*/
#define	CAN_MOFGPR42	(CAN_MO42_FGPR)

/** \brief  1548, Message Object  Interrupt Pointer Register */
#define CAN_MO42_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019548u)

/** Alias (User Manual Name) for CAN_MO42_IPR.
* To use register names with standard convension, please use CAN_MO42_IPR.
*/
#define	CAN_MOIPR42	(CAN_MO42_IPR)

/** \brief  155C, Message Object  Control Register */
#define CAN_MO42_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001955Cu)

/** Alias (User Manual Name) for CAN_MO42_STAT.
* To use register names with standard convension, please use CAN_MO42_STAT.
*/
#define	CAN_MOSTAT42	(CAN_MO42_STAT)

/** \brief  156C, Message Object  Acceptance Mask Register */
#define CAN_MO43_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001956Cu)

/** Alias (User Manual Name) for CAN_MO43_AMR.
* To use register names with standard convension, please use CAN_MO43_AMR.
*/
#define	CAN_MOAMR43	(CAN_MO43_AMR)

/** \brief  1578, Message Object  Arbitration Register */
#define CAN_MO43_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019578u)

/** Alias (User Manual Name) for CAN_MO43_AR.
* To use register names with standard convension, please use CAN_MO43_AR.
*/
#define	CAN_MOAR43	(CAN_MO43_AR)

/** \brief  157C, Message Object  Control Register */
#define CAN_MO43_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001957Cu)

/** Alias (User Manual Name) for CAN_MO43_CTR.
* To use register names with standard convension, please use CAN_MO43_CTR.
*/
#define	CAN_MOCTR43	(CAN_MO43_CTR)

/** \brief  1574, Message Object  Data Register High */
#define CAN_MO43_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019574u)

/** Alias (User Manual Name) for CAN_MO43_DATAH.
* To use register names with standard convension, please use CAN_MO43_DATAH.
*/
#define	CAN_MODATAH43	(CAN_MO43_DATAH)

/** \brief  1570, Message Object  Data Register Low */
#define CAN_MO43_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019570u)

/** Alias (User Manual Name) for CAN_MO43_DATAL.
* To use register names with standard convension, please use CAN_MO43_DATAL.
*/
#define	CAN_MODATAL43	(CAN_MO43_DATAL)

/** \brief  1560, Message Object  Function Control Register */
#define CAN_MO43_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019560u)

/** Alias (User Manual Name) for CAN_MO43_EDATA0.
* To use register names with standard convension, please use CAN_MO43_EDATA0.
*/
#define	CAN_EMO43DATA0	(CAN_MO43_EDATA0)

/** \brief  1564, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO43_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019564u)

/** Alias (User Manual Name) for CAN_MO43_EDATA1.
* To use register names with standard convension, please use CAN_MO43_EDATA1.
*/
#define	CAN_EMO43DATA1	(CAN_MO43_EDATA1)

/** \brief  1568, Message Object  Interrupt Pointer Register */
#define CAN_MO43_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019568u)

/** Alias (User Manual Name) for CAN_MO43_EDATA2.
* To use register names with standard convension, please use CAN_MO43_EDATA2.
*/
#define	CAN_EMO43DATA2	(CAN_MO43_EDATA2)

/** \brief  156C, Message Object  Acceptance Mask Register */
#define CAN_MO43_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001956Cu)

/** Alias (User Manual Name) for CAN_MO43_EDATA3.
* To use register names with standard convension, please use CAN_MO43_EDATA3.
*/
#define	CAN_EMO43DATA3	(CAN_MO43_EDATA3)

/** \brief  1570, Message Object  Data Register Low */
#define CAN_MO43_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019570u)

/** Alias (User Manual Name) for CAN_MO43_EDATA4.
* To use register names with standard convension, please use CAN_MO43_EDATA4.
*/
#define	CAN_EMO43DATA4	(CAN_MO43_EDATA4)

/** \brief  1574, Message Object  Data Register High */
#define CAN_MO43_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019574u)

/** Alias (User Manual Name) for CAN_MO43_EDATA5.
* To use register names with standard convension, please use CAN_MO43_EDATA5.
*/
#define	CAN_EMO43DATA5	(CAN_MO43_EDATA5)

/** \brief  1578, Message Object  Arbitration Register */
#define CAN_MO43_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019578u)

/** Alias (User Manual Name) for CAN_MO43_EDATA6.
* To use register names with standard convension, please use CAN_MO43_EDATA6.
*/
#define	CAN_EMO43DATA6	(CAN_MO43_EDATA6)

