leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1560, Message Object  Function Control Register */
#define CAN_MO43_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019560u)

/** Alias (User Manual Name) for CAN_MO43_FCR.
* To use register names with standard convension, please use CAN_MO43_FCR.
*/
#define	CAN_MOFCR43	(CAN_MO43_FCR)

/** \brief  1564, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO43_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019564u)

/** Alias (User Manual Name) for CAN_MO43_FGPR.
* To use register names with standard convension, please use CAN_MO43_FGPR.
*/
#define	CAN_MOFGPR43	(CAN_MO43_FGPR)

/** \brief  1568, Message Object  Interrupt Pointer Register */
#define CAN_MO43_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019568u)

/** Alias (User Manual Name) for CAN_MO43_IPR.
* To use register names with standard convension, please use CAN_MO43_IPR.
*/
#define	CAN_MOIPR43	(CAN_MO43_IPR)

/** \brief  157C, Message Object  Control Register */
#define CAN_MO43_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001957Cu)

/** Alias (User Manual Name) for CAN_MO43_STAT.
* To use register names with standard convension, please use CAN_MO43_STAT.
*/
#define	CAN_MOSTAT43	(CAN_MO43_STAT)

/** \brief  158C, Message Object  Acceptance Mask Register */
#define CAN_MO44_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001958Cu)

/** Alias (User Manual Name) for CAN_MO44_AMR.
* To use register names with standard convension, please use CAN_MO44_AMR.
*/
#define	CAN_MOAMR44	(CAN_MO44_AMR)

/** \brief  1598, Message Object  Arbitration Register */
#define CAN_MO44_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019598u)

/** Alias (User Manual Name) for CAN_MO44_AR.
* To use register names with standard convension, please use CAN_MO44_AR.
*/
#define	CAN_MOAR44	(CAN_MO44_AR)

/** \brief  159C, Message Object  Control Register */
#define CAN_MO44_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001959Cu)

/** Alias (User Manual Name) for CAN_MO44_CTR.
* To use register names with standard convension, please use CAN_MO44_CTR.
*/
#define	CAN_MOCTR44	(CAN_MO44_CTR)

/** \brief  1594, Message Object  Data Register High */
#define CAN_MO44_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019594u)

/** Alias (User Manual Name) for CAN_MO44_DATAH.
* To use register names with standard convension, please use CAN_MO44_DATAH.
*/
#define	CAN_MODATAH44	(CAN_MO44_DATAH)

/** \brief  1590, Message Object  Data Register Low */
#define CAN_MO44_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019590u)

/** Alias (User Manual Name) for CAN_MO44_DATAL.
* To use register names with standard convension, please use CAN_MO44_DATAL.
*/
#define	CAN_MODATAL44	(CAN_MO44_DATAL)

/** \brief  1580, Message Object  Function Control Register */
#define CAN_MO44_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019580u)

/** Alias (User Manual Name) for CAN_MO44_EDATA0.
* To use register names with standard convension, please use CAN_MO44_EDATA0.
*/
#define	CAN_EMO44DATA0	(CAN_MO44_EDATA0)

/** \brief  1584, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO44_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019584u)

/** Alias (User Manual Name) for CAN_MO44_EDATA1.
* To use register names with standard convension, please use CAN_MO44_EDATA1.
*/
#define	CAN_EMO44DATA1	(CAN_MO44_EDATA1)

/** \brief  1588, Message Object  Interrupt Pointer Register */
#define CAN_MO44_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019588u)

/** Alias (User Manual Name) for CAN_MO44_EDATA2.
* To use register names with standard convension, please use CAN_MO44_EDATA2.
*/
#define	CAN_EMO44DATA2	(CAN_MO44_EDATA2)

/** \brief  158C, Message Object  Acceptance Mask Register */
#define CAN_MO44_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001958Cu)

/** Alias (User Manual Name) for CAN_MO44_EDATA3.
* To use register names with standard convension, please use CAN_MO44_EDATA3.
*/
#define	CAN_EMO44DATA3	(CAN_MO44_EDATA3)

/** \brief  1590, Message Object  Data Register Low */
#define CAN_MO44_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019590u)

/** Alias (User Manual Name) for CAN_MO44_EDATA4.
* To use register names with standard convension, please use CAN_MO44_EDATA4.
*/
#define	CAN_EMO44DATA4	(CAN_MO44_EDATA4)

/** \brief  1594, Message Object  Data Register High */
#define CAN_MO44_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019594u)

/** Alias (User Manual Name) for CAN_MO44_EDATA5.
* To use register names with standard convension, please use CAN_MO44_EDATA5.
*/
#define	CAN_EMO44DATA5	(CAN_MO44_EDATA5)

/** \brief  1598, Message Object  Arbitration Register */
#define CAN_MO44_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019598u)

/** Alias (User Manual Name) for CAN_MO44_EDATA6.
* To use register names with standard convension, please use CAN_MO44_EDATA6.
*/
#define	CAN_EMO44DATA6	(CAN_MO44_EDATA6)

/** \brief  1580, Message Object  Function Control Register */
#define CAN_MO44_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019580u)

/** Alias (User Manual Name) for CAN_MO44_FCR.
* To use register names with standard convension, please use CAN_MO44_FCR.
*/
#define	CAN_MOFCR44	(CAN_MO44_FCR)

/** \brief  1584, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO44_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019584u)

/** Alias (User Manual Name) for CAN_MO44_FGPR.
* To use register names with standard convension, please use CAN_MO44_FGPR.
*/
#define	CAN_MOFGPR44	(CAN_MO44_FGPR)

/** \brief  1588, Message Object  Interrupt Pointer Register */
#define CAN_MO44_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019588u)

/** Alias (User Manual Name) for CAN_MO44_IPR.
* To use register names with standard convension, please use CAN_MO44_IPR.
*/
#define	CAN_MOIPR44	(CAN_MO44_IPR)

/** \brief  159C, Message Object  Control Register */
#define CAN_MO44_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001959Cu)

/** Alias (User Manual Name) for CAN_MO44_STAT.
* To use register names with standard convension, please use CAN_MO44_STAT.
*/
#define	CAN_MOSTAT44	(CAN_MO44_STAT)

/** \brief  15AC, Message Object  Acceptance Mask Register */
#define CAN_MO45_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00195ACu)

