leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO4_EDATA3.
* To use register names with standard convension, please use CAN_MO4_EDATA3.
*/
#define	CAN_EMO4DATA3	(CAN_MO4_EDATA3)

/** \brief  1090, Message Object  Data Register Low */
#define CAN_MO4_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019090u)

/** Alias (User Manual Name) for CAN_MO4_EDATA4.
* To use register names with standard convension, please use CAN_MO4_EDATA4.
*/
#define	CAN_EMO4DATA4	(CAN_MO4_EDATA4)

/** \brief  1094, Message Object  Data Register High */
#define CAN_MO4_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019094u)

/** Alias (User Manual Name) for CAN_MO4_EDATA5.
* To use register names with standard convension, please use CAN_MO4_EDATA5.
*/
#define	CAN_EMO4DATA5	(CAN_MO4_EDATA5)

/** \brief  1098, Message Object  Arbitration Register */
#define CAN_MO4_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019098u)

/** Alias (User Manual Name) for CAN_MO4_EDATA6.
* To use register names with standard convension, please use CAN_MO4_EDATA6.
*/
#define	CAN_EMO4DATA6	(CAN_MO4_EDATA6)

/** \brief  1080, Message Object  Function Control Register */
#define CAN_MO4_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019080u)

/** Alias (User Manual Name) for CAN_MO4_FCR.
* To use register names with standard convension, please use CAN_MO4_FCR.
*/
#define	CAN_MOFCR4	(CAN_MO4_FCR)

/** \brief  1084, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO4_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019084u)

/** Alias (User Manual Name) for CAN_MO4_FGPR.
* To use register names with standard convension, please use CAN_MO4_FGPR.
*/
#define	CAN_MOFGPR4	(CAN_MO4_FGPR)

/** \brief  1088, Message Object  Interrupt Pointer Register */
#define CAN_MO4_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019088u)

/** Alias (User Manual Name) for CAN_MO4_IPR.
* To use register names with standard convension, please use CAN_MO4_IPR.
*/
#define	CAN_MOIPR4	(CAN_MO4_IPR)

/** \brief  109C, Message Object  Control Register */
#define CAN_MO4_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001909Cu)

/** Alias (User Manual Name) for CAN_MO4_STAT.
* To use register names with standard convension, please use CAN_MO4_STAT.
*/
#define	CAN_MOSTAT4	(CAN_MO4_STAT)

/** \brief  164C, Message Object  Acceptance Mask Register */
#define CAN_MO50_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001964Cu)

/** Alias (User Manual Name) for CAN_MO50_AMR.
* To use register names with standard convension, please use CAN_MO50_AMR.
*/
#define	CAN_MOAMR50	(CAN_MO50_AMR)

/** \brief  1658, Message Object  Arbitration Register */
#define CAN_MO50_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019658u)

/** Alias (User Manual Name) for CAN_MO50_AR.
* To use register names with standard convension, please use CAN_MO50_AR.
*/
#define	CAN_MOAR50	(CAN_MO50_AR)

/** \brief  165C, Message Object  Control Register */
#define CAN_MO50_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001965Cu)

/** Alias (User Manual Name) for CAN_MO50_CTR.
* To use register names with standard convension, please use CAN_MO50_CTR.
*/
#define	CAN_MOCTR50	(CAN_MO50_CTR)

/** \brief  1654, Message Object  Data Register High */
#define CAN_MO50_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019654u)

/** Alias (User Manual Name) for CAN_MO50_DATAH.
* To use register names with standard convension, please use CAN_MO50_DATAH.
*/
#define	CAN_MODATAH50	(CAN_MO50_DATAH)

/** \brief  1650, Message Object  Data Register Low */
#define CAN_MO50_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019650u)

/** Alias (User Manual Name) for CAN_MO50_DATAL.
* To use register names with standard convension, please use CAN_MO50_DATAL.
*/
#define	CAN_MODATAL50	(CAN_MO50_DATAL)

/** \brief  1640, Message Object  Function Control Register */
#define CAN_MO50_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019640u)

/** Alias (User Manual Name) for CAN_MO50_EDATA0.
* To use register names with standard convension, please use CAN_MO50_EDATA0.
*/
#define	CAN_EMO50DATA0	(CAN_MO50_EDATA0)

/** \brief  1644, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO50_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019644u)

/** Alias (User Manual Name) for CAN_MO50_EDATA1.
* To use register names with standard convension, please use CAN_MO50_EDATA1.
*/
#define	CAN_EMO50DATA1	(CAN_MO50_EDATA1)

/** \brief  1648, Message Object  Interrupt Pointer Register */
#define CAN_MO50_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019648u)

/** Alias (User Manual Name) for CAN_MO50_EDATA2.
* To use register names with standard convension, please use CAN_MO50_EDATA2.
*/
#define	CAN_EMO50DATA2	(CAN_MO50_EDATA2)

/** \brief  164C, Message Object  Acceptance Mask Register */
#define CAN_MO50_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001964Cu)

/** Alias (User Manual Name) for CAN_MO50_EDATA3.
* To use register names with standard convension, please use CAN_MO50_EDATA3.
*/
#define	CAN_EMO50DATA3	(CAN_MO50_EDATA3)

/** \brief  1650, Message Object  Data Register Low */
#define CAN_MO50_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019650u)

/** Alias (User Manual Name) for CAN_MO50_EDATA4.
* To use register names with standard convension, please use CAN_MO50_EDATA4.
*/
#define	CAN_EMO50DATA4	(CAN_MO50_EDATA4)

/** \brief  1654, Message Object  Data Register High */
#define CAN_MO50_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019654u)

/** Alias (User Manual Name) for CAN_MO50_EDATA5.
* To use register names with standard convension, please use CAN_MO50_EDATA5.
*/
#define	CAN_EMO50DATA5	(CAN_MO50_EDATA5)

/** \brief  1658, Message Object  Arbitration Register */
#define CAN_MO50_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019658u)

/** Alias (User Manual Name) for CAN_MO50_EDATA6.
* To use register names with standard convension, please use CAN_MO50_EDATA6.
*/
#define	CAN_EMO50DATA6	(CAN_MO50_EDATA6)

