leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1750, Message Object  Data Register Low */
#define CAN_MO58_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019750u)

/** Alias (User Manual Name) for CAN_MO58_EDATA4.
* To use register names with standard convension, please use CAN_MO58_EDATA4.
*/
#define	CAN_EMO58DATA4	(CAN_MO58_EDATA4)

/** \brief  1754, Message Object  Data Register High */
#define CAN_MO58_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019754u)

/** Alias (User Manual Name) for CAN_MO58_EDATA5.
* To use register names with standard convension, please use CAN_MO58_EDATA5.
*/
#define	CAN_EMO58DATA5	(CAN_MO58_EDATA5)

/** \brief  1758, Message Object  Arbitration Register */
#define CAN_MO58_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019758u)

/** Alias (User Manual Name) for CAN_MO58_EDATA6.
* To use register names with standard convension, please use CAN_MO58_EDATA6.
*/
#define	CAN_EMO58DATA6	(CAN_MO58_EDATA6)

/** \brief  1740, Message Object  Function Control Register */
#define CAN_MO58_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019740u)

/** Alias (User Manual Name) for CAN_MO58_FCR.
* To use register names with standard convension, please use CAN_MO58_FCR.
*/
#define	CAN_MOFCR58	(CAN_MO58_FCR)

/** \brief  1744, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO58_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019744u)

/** Alias (User Manual Name) for CAN_MO58_FGPR.
* To use register names with standard convension, please use CAN_MO58_FGPR.
*/
#define	CAN_MOFGPR58	(CAN_MO58_FGPR)

/** \brief  1748, Message Object  Interrupt Pointer Register */
#define CAN_MO58_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019748u)

/** Alias (User Manual Name) for CAN_MO58_IPR.
* To use register names with standard convension, please use CAN_MO58_IPR.
*/
#define	CAN_MOIPR58	(CAN_MO58_IPR)

/** \brief  175C, Message Object  Control Register */
#define CAN_MO58_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001975Cu)

/** Alias (User Manual Name) for CAN_MO58_STAT.
* To use register names with standard convension, please use CAN_MO58_STAT.
*/
#define	CAN_MOSTAT58	(CAN_MO58_STAT)

/** \brief  176C, Message Object  Acceptance Mask Register */
#define CAN_MO59_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001976Cu)

/** Alias (User Manual Name) for CAN_MO59_AMR.
* To use register names with standard convension, please use CAN_MO59_AMR.
*/
#define	CAN_MOAMR59	(CAN_MO59_AMR)

/** \brief  1778, Message Object  Arbitration Register */
#define CAN_MO59_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019778u)

/** Alias (User Manual Name) for CAN_MO59_AR.
* To use register names with standard convension, please use CAN_MO59_AR.
*/
#define	CAN_MOAR59	(CAN_MO59_AR)

/** \brief  177C, Message Object  Control Register */
#define CAN_MO59_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001977Cu)

/** Alias (User Manual Name) for CAN_MO59_CTR.
* To use register names with standard convension, please use CAN_MO59_CTR.
*/
#define	CAN_MOCTR59	(CAN_MO59_CTR)

/** \brief  1774, Message Object  Data Register High */
#define CAN_MO59_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019774u)

/** Alias (User Manual Name) for CAN_MO59_DATAH.
* To use register names with standard convension, please use CAN_MO59_DATAH.
*/
#define	CAN_MODATAH59	(CAN_MO59_DATAH)

/** \brief  1770, Message Object  Data Register Low */
#define CAN_MO59_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019770u)

/** Alias (User Manual Name) for CAN_MO59_DATAL.
* To use register names with standard convension, please use CAN_MO59_DATAL.
*/
#define	CAN_MODATAL59	(CAN_MO59_DATAL)

/** \brief  1760, Message Object  Function Control Register */
#define CAN_MO59_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019760u)

/** Alias (User Manual Name) for CAN_MO59_EDATA0.
* To use register names with standard convension, please use CAN_MO59_EDATA0.
*/
#define	CAN_EMO59DATA0	(CAN_MO59_EDATA0)

/** \brief  1764, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO59_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019764u)

/** Alias (User Manual Name) for CAN_MO59_EDATA1.
* To use register names with standard convension, please use CAN_MO59_EDATA1.
*/
#define	CAN_EMO59DATA1	(CAN_MO59_EDATA1)

/** \brief  1768, Message Object  Interrupt Pointer Register */
#define CAN_MO59_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019768u)

/** Alias (User Manual Name) for CAN_MO59_EDATA2.
* To use register names with standard convension, please use CAN_MO59_EDATA2.
*/
#define	CAN_EMO59DATA2	(CAN_MO59_EDATA2)

/** \brief  176C, Message Object  Acceptance Mask Register */
#define CAN_MO59_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001976Cu)

/** Alias (User Manual Name) for CAN_MO59_EDATA3.
* To use register names with standard convension, please use CAN_MO59_EDATA3.
*/
#define	CAN_EMO59DATA3	(CAN_MO59_EDATA3)

/** \brief  1770, Message Object  Data Register Low */
#define CAN_MO59_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019770u)

/** Alias (User Manual Name) for CAN_MO59_EDATA4.
* To use register names with standard convension, please use CAN_MO59_EDATA4.
*/
#define	CAN_EMO59DATA4	(CAN_MO59_EDATA4)

/** \brief  1774, Message Object  Data Register High */
#define CAN_MO59_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019774u)

/** Alias (User Manual Name) for CAN_MO59_EDATA5.
* To use register names with standard convension, please use CAN_MO59_EDATA5.
*/
#define	CAN_EMO59DATA5	(CAN_MO59_EDATA5)

/** \brief  1778, Message Object  Arbitration Register */
#define CAN_MO59_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019778u)

/** Alias (User Manual Name) for CAN_MO59_EDATA6.
* To use register names with standard convension, please use CAN_MO59_EDATA6.
*/
#define	CAN_EMO59DATA6	(CAN_MO59_EDATA6)

/** \brief  1760, Message Object  Function Control Register */
#define CAN_MO59_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019760u)

