leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO60_DATAH.
* To use register names with standard convension, please use CAN_MO60_DATAH.
*/
#define	CAN_MODATAH60	(CAN_MO60_DATAH)

/** \brief  1790, Message Object  Data Register Low */
#define CAN_MO60_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019790u)

/** Alias (User Manual Name) for CAN_MO60_DATAL.
* To use register names with standard convension, please use CAN_MO60_DATAL.
*/
#define	CAN_MODATAL60	(CAN_MO60_DATAL)

/** \brief  1780, Message Object  Function Control Register */
#define CAN_MO60_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019780u)

/** Alias (User Manual Name) for CAN_MO60_EDATA0.
* To use register names with standard convension, please use CAN_MO60_EDATA0.
*/
#define	CAN_EMO60DATA0	(CAN_MO60_EDATA0)

/** \brief  1784, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO60_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019784u)

/** Alias (User Manual Name) for CAN_MO60_EDATA1.
* To use register names with standard convension, please use CAN_MO60_EDATA1.
*/
#define	CAN_EMO60DATA1	(CAN_MO60_EDATA1)

/** \brief  1788, Message Object  Interrupt Pointer Register */
#define CAN_MO60_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019788u)

/** Alias (User Manual Name) for CAN_MO60_EDATA2.
* To use register names with standard convension, please use CAN_MO60_EDATA2.
*/
#define	CAN_EMO60DATA2	(CAN_MO60_EDATA2)

/** \brief  178C, Message Object  Acceptance Mask Register */
#define CAN_MO60_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001978Cu)

/** Alias (User Manual Name) for CAN_MO60_EDATA3.
* To use register names with standard convension, please use CAN_MO60_EDATA3.
*/
#define	CAN_EMO60DATA3	(CAN_MO60_EDATA3)

/** \brief  1790, Message Object  Data Register Low */
#define CAN_MO60_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019790u)

/** Alias (User Manual Name) for CAN_MO60_EDATA4.
* To use register names with standard convension, please use CAN_MO60_EDATA4.
*/
#define	CAN_EMO60DATA4	(CAN_MO60_EDATA4)

/** \brief  1794, Message Object  Data Register High */
#define CAN_MO60_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019794u)

/** Alias (User Manual Name) for CAN_MO60_EDATA5.
* To use register names with standard convension, please use CAN_MO60_EDATA5.
*/
#define	CAN_EMO60DATA5	(CAN_MO60_EDATA5)

/** \brief  1798, Message Object  Arbitration Register */
#define CAN_MO60_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019798u)

/** Alias (User Manual Name) for CAN_MO60_EDATA6.
* To use register names with standard convension, please use CAN_MO60_EDATA6.
*/
#define	CAN_EMO60DATA6	(CAN_MO60_EDATA6)

/** \brief  1780, Message Object  Function Control Register */
#define CAN_MO60_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019780u)

/** Alias (User Manual Name) for CAN_MO60_FCR.
* To use register names with standard convension, please use CAN_MO60_FCR.
*/
#define	CAN_MOFCR60	(CAN_MO60_FCR)

/** \brief  1784, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO60_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019784u)

/** Alias (User Manual Name) for CAN_MO60_FGPR.
* To use register names with standard convension, please use CAN_MO60_FGPR.
*/
#define	CAN_MOFGPR60	(CAN_MO60_FGPR)

/** \brief  1788, Message Object  Interrupt Pointer Register */
#define CAN_MO60_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019788u)

/** Alias (User Manual Name) for CAN_MO60_IPR.
* To use register names with standard convension, please use CAN_MO60_IPR.
*/
#define	CAN_MOIPR60	(CAN_MO60_IPR)

/** \brief  179C, Message Object  Control Register */
#define CAN_MO60_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001979Cu)

/** Alias (User Manual Name) for CAN_MO60_STAT.
* To use register names with standard convension, please use CAN_MO60_STAT.
*/
#define	CAN_MOSTAT60	(CAN_MO60_STAT)

/** \brief  17AC, Message Object  Acceptance Mask Register */
#define CAN_MO61_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00197ACu)

/** Alias (User Manual Name) for CAN_MO61_AMR.
* To use register names with standard convension, please use CAN_MO61_AMR.
*/
#define	CAN_MOAMR61	(CAN_MO61_AMR)

/** \brief  17B8, Message Object  Arbitration Register */
#define CAN_MO61_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00197B8u)

/** Alias (User Manual Name) for CAN_MO61_AR.
* To use register names with standard convension, please use CAN_MO61_AR.
*/
#define	CAN_MOAR61	(CAN_MO61_AR)

/** \brief  17BC, Message Object  Control Register */
#define CAN_MO61_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00197BCu)

/** Alias (User Manual Name) for CAN_MO61_CTR.
* To use register names with standard convension, please use CAN_MO61_CTR.
*/
#define	CAN_MOCTR61	(CAN_MO61_CTR)

/** \brief  17B4, Message Object  Data Register High */
#define CAN_MO61_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00197B4u)

/** Alias (User Manual Name) for CAN_MO61_DATAH.
* To use register names with standard convension, please use CAN_MO61_DATAH.
*/
#define	CAN_MODATAH61	(CAN_MO61_DATAH)

/** \brief  17B0, Message Object  Data Register Low */
#define CAN_MO61_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00197B0u)

/** Alias (User Manual Name) for CAN_MO61_DATAL.
* To use register names with standard convension, please use CAN_MO61_DATAL.
*/
#define	CAN_MODATAL61	(CAN_MO61_DATAL)

/** \brief  17A0, Message Object  Function Control Register */
#define CAN_MO61_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00197A0u)

/** Alias (User Manual Name) for CAN_MO61_EDATA0.
* To use register names with standard convension, please use CAN_MO61_EDATA0.
*/
#define	CAN_EMO61DATA0	(CAN_MO61_EDATA0)

/** \brief  17A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO61_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00197A4u)

/** Alias (User Manual Name) for CAN_MO61_EDATA1.
* To use register names with standard convension, please use CAN_MO61_EDATA1.
*/
#define	CAN_EMO61DATA1	(CAN_MO61_EDATA1)

/** \brief  17A8, Message Object  Interrupt Pointer Register */
#define CAN_MO61_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00197A8u)

/** Alias (User Manual Name) for CAN_MO61_EDATA2.
* To use register names with standard convension, please use CAN_MO61_EDATA2.
*/
#define	CAN_EMO61DATA2	(CAN_MO61_EDATA2)

/** \brief  17AC, Message Object  Acceptance Mask Register */
#define CAN_MO61_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00197ACu)

/** Alias (User Manual Name) for CAN_MO61_EDATA3.
* To use register names with standard convension, please use CAN_MO61_EDATA3.
*/
#define	CAN_EMO61DATA3	(CAN_MO61_EDATA3)

/** \brief  17B0, Message Object  Data Register Low */
#define CAN_MO61_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00197B0u)

