leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO61_EDATA4.
* To use register names with standard convension, please use CAN_MO61_EDATA4.
*/
#define	CAN_EMO61DATA4	(CAN_MO61_EDATA4)

/** \brief  17B4, Message Object  Data Register High */
#define CAN_MO61_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00197B4u)

/** Alias (User Manual Name) for CAN_MO61_EDATA5.
* To use register names with standard convension, please use CAN_MO61_EDATA5.
*/
#define	CAN_EMO61DATA5	(CAN_MO61_EDATA5)

/** \brief  17B8, Message Object  Arbitration Register */
#define CAN_MO61_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00197B8u)

/** Alias (User Manual Name) for CAN_MO61_EDATA6.
* To use register names with standard convension, please use CAN_MO61_EDATA6.
*/
#define	CAN_EMO61DATA6	(CAN_MO61_EDATA6)

/** \brief  17A0, Message Object  Function Control Register */
#define CAN_MO61_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00197A0u)

/** Alias (User Manual Name) for CAN_MO61_FCR.
* To use register names with standard convension, please use CAN_MO61_FCR.
*/
#define	CAN_MOFCR61	(CAN_MO61_FCR)

/** \brief  17A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO61_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00197A4u)

/** Alias (User Manual Name) for CAN_MO61_FGPR.
* To use register names with standard convension, please use CAN_MO61_FGPR.
*/
#define	CAN_MOFGPR61	(CAN_MO61_FGPR)

/** \brief  17A8, Message Object  Interrupt Pointer Register */
#define CAN_MO61_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00197A8u)

/** Alias (User Manual Name) for CAN_MO61_IPR.
* To use register names with standard convension, please use CAN_MO61_IPR.
*/
#define	CAN_MOIPR61	(CAN_MO61_IPR)

/** \brief  17BC, Message Object  Control Register */
#define CAN_MO61_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00197BCu)

/** Alias (User Manual Name) for CAN_MO61_STAT.
* To use register names with standard convension, please use CAN_MO61_STAT.
*/
#define	CAN_MOSTAT61	(CAN_MO61_STAT)

/** \brief  17CC, Message Object  Acceptance Mask Register */
#define CAN_MO62_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00197CCu)

/** Alias (User Manual Name) for CAN_MO62_AMR.
* To use register names with standard convension, please use CAN_MO62_AMR.
*/
#define	CAN_MOAMR62	(CAN_MO62_AMR)

/** \brief  17D8, Message Object  Arbitration Register */
#define CAN_MO62_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00197D8u)

/** Alias (User Manual Name) for CAN_MO62_AR.
* To use register names with standard convension, please use CAN_MO62_AR.
*/
#define	CAN_MOAR62	(CAN_MO62_AR)

/** \brief  17DC, Message Object  Control Register */
#define CAN_MO62_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00197DCu)

/** Alias (User Manual Name) for CAN_MO62_CTR.
* To use register names with standard convension, please use CAN_MO62_CTR.
*/
#define	CAN_MOCTR62	(CAN_MO62_CTR)

/** \brief  17D4, Message Object  Data Register High */
#define CAN_MO62_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00197D4u)

/** Alias (User Manual Name) for CAN_MO62_DATAH.
* To use register names with standard convension, please use CAN_MO62_DATAH.
*/
#define	CAN_MODATAH62	(CAN_MO62_DATAH)

/** \brief  17D0, Message Object  Data Register Low */
#define CAN_MO62_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00197D0u)

/** Alias (User Manual Name) for CAN_MO62_DATAL.
* To use register names with standard convension, please use CAN_MO62_DATAL.
*/
#define	CAN_MODATAL62	(CAN_MO62_DATAL)

/** \brief  17C0, Message Object  Function Control Register */
#define CAN_MO62_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00197C0u)

/** Alias (User Manual Name) for CAN_MO62_EDATA0.
* To use register names with standard convension, please use CAN_MO62_EDATA0.
*/
#define	CAN_EMO62DATA0	(CAN_MO62_EDATA0)

/** \brief  17C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO62_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00197C4u)

/** Alias (User Manual Name) for CAN_MO62_EDATA1.
* To use register names with standard convension, please use CAN_MO62_EDATA1.
*/
#define	CAN_EMO62DATA1	(CAN_MO62_EDATA1)

/** \brief  17C8, Message Object  Interrupt Pointer Register */
#define CAN_MO62_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00197C8u)

/** Alias (User Manual Name) for CAN_MO62_EDATA2.
* To use register names with standard convension, please use CAN_MO62_EDATA2.
*/
#define	CAN_EMO62DATA2	(CAN_MO62_EDATA2)

/** \brief  17CC, Message Object  Acceptance Mask Register */
#define CAN_MO62_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00197CCu)

/** Alias (User Manual Name) for CAN_MO62_EDATA3.
* To use register names with standard convension, please use CAN_MO62_EDATA3.
*/
#define	CAN_EMO62DATA3	(CAN_MO62_EDATA3)

/** \brief  17D0, Message Object  Data Register Low */
#define CAN_MO62_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00197D0u)

/** Alias (User Manual Name) for CAN_MO62_EDATA4.
* To use register names with standard convension, please use CAN_MO62_EDATA4.
*/
#define	CAN_EMO62DATA4	(CAN_MO62_EDATA4)

/** \brief  17D4, Message Object  Data Register High */
#define CAN_MO62_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00197D4u)

/** Alias (User Manual Name) for CAN_MO62_EDATA5.
* To use register names with standard convension, please use CAN_MO62_EDATA5.
*/
#define	CAN_EMO62DATA5	(CAN_MO62_EDATA5)

/** \brief  17D8, Message Object  Arbitration Register */
#define CAN_MO62_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00197D8u)

/** Alias (User Manual Name) for CAN_MO62_EDATA6.
* To use register names with standard convension, please use CAN_MO62_EDATA6.
*/
#define	CAN_EMO62DATA6	(CAN_MO62_EDATA6)

/** \brief  17C0, Message Object  Function Control Register */
#define CAN_MO62_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00197C0u)

/** Alias (User Manual Name) for CAN_MO62_FCR.
* To use register names with standard convension, please use CAN_MO62_FCR.
*/
#define	CAN_MOFCR62	(CAN_MO62_FCR)

/** \brief  17C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO62_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00197C4u)

