leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO62_FGPR.
* To use register names with standard convension, please use CAN_MO62_FGPR.
*/
#define	CAN_MOFGPR62	(CAN_MO62_FGPR)

/** \brief  17C8, Message Object  Interrupt Pointer Register */
#define CAN_MO62_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00197C8u)

/** Alias (User Manual Name) for CAN_MO62_IPR.
* To use register names with standard convension, please use CAN_MO62_IPR.
*/
#define	CAN_MOIPR62	(CAN_MO62_IPR)

/** \brief  17DC, Message Object  Control Register */
#define CAN_MO62_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00197DCu)

/** Alias (User Manual Name) for CAN_MO62_STAT.
* To use register names with standard convension, please use CAN_MO62_STAT.
*/
#define	CAN_MOSTAT62	(CAN_MO62_STAT)

/** \brief  17EC, Message Object  Acceptance Mask Register */
#define CAN_MO63_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00197ECu)

/** Alias (User Manual Name) for CAN_MO63_AMR.
* To use register names with standard convension, please use CAN_MO63_AMR.
*/
#define	CAN_MOAMR63	(CAN_MO63_AMR)

/** \brief  17F8, Message Object  Arbitration Register */
#define CAN_MO63_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00197F8u)

/** Alias (User Manual Name) for CAN_MO63_AR.
* To use register names with standard convension, please use CAN_MO63_AR.
*/
#define	CAN_MOAR63	(CAN_MO63_AR)

/** \brief  17FC, Message Object  Control Register */
#define CAN_MO63_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00197FCu)

/** Alias (User Manual Name) for CAN_MO63_CTR.
* To use register names with standard convension, please use CAN_MO63_CTR.
*/
#define	CAN_MOCTR63	(CAN_MO63_CTR)

/** \brief  17F4, Message Object  Data Register High */
#define CAN_MO63_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00197F4u)

/** Alias (User Manual Name) for CAN_MO63_DATAH.
* To use register names with standard convension, please use CAN_MO63_DATAH.
*/
#define	CAN_MODATAH63	(CAN_MO63_DATAH)

/** \brief  17F0, Message Object  Data Register Low */
#define CAN_MO63_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00197F0u)

/** Alias (User Manual Name) for CAN_MO63_DATAL.
* To use register names with standard convension, please use CAN_MO63_DATAL.
*/
#define	CAN_MODATAL63	(CAN_MO63_DATAL)

/** \brief  17E0, Message Object  Function Control Register */
#define CAN_MO63_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00197E0u)

/** Alias (User Manual Name) for CAN_MO63_EDATA0.
* To use register names with standard convension, please use CAN_MO63_EDATA0.
*/
#define	CAN_EMO63DATA0	(CAN_MO63_EDATA0)

/** \brief  17E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO63_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00197E4u)

/** Alias (User Manual Name) for CAN_MO63_EDATA1.
* To use register names with standard convension, please use CAN_MO63_EDATA1.
*/
#define	CAN_EMO63DATA1	(CAN_MO63_EDATA1)

/** \brief  17E8, Message Object  Interrupt Pointer Register */
#define CAN_MO63_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00197E8u)

/** Alias (User Manual Name) for CAN_MO63_EDATA2.
* To use register names with standard convension, please use CAN_MO63_EDATA2.
*/
#define	CAN_EMO63DATA2	(CAN_MO63_EDATA2)

/** \brief  17EC, Message Object  Acceptance Mask Register */
#define CAN_MO63_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00197ECu)

/** Alias (User Manual Name) for CAN_MO63_EDATA3.
* To use register names with standard convension, please use CAN_MO63_EDATA3.
*/
#define	CAN_EMO63DATA3	(CAN_MO63_EDATA3)

/** \brief  17F0, Message Object  Data Register Low */
#define CAN_MO63_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00197F0u)

/** Alias (User Manual Name) for CAN_MO63_EDATA4.
* To use register names with standard convension, please use CAN_MO63_EDATA4.
*/
#define	CAN_EMO63DATA4	(CAN_MO63_EDATA4)

/** \brief  17F4, Message Object  Data Register High */
#define CAN_MO63_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00197F4u)

/** Alias (User Manual Name) for CAN_MO63_EDATA5.
* To use register names with standard convension, please use CAN_MO63_EDATA5.
*/
#define	CAN_EMO63DATA5	(CAN_MO63_EDATA5)

/** \brief  17F8, Message Object  Arbitration Register */
#define CAN_MO63_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00197F8u)

/** Alias (User Manual Name) for CAN_MO63_EDATA6.
* To use register names with standard convension, please use CAN_MO63_EDATA6.
*/
#define	CAN_EMO63DATA6	(CAN_MO63_EDATA6)

/** \brief  17E0, Message Object  Function Control Register */
#define CAN_MO63_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00197E0u)

/** Alias (User Manual Name) for CAN_MO63_FCR.
* To use register names with standard convension, please use CAN_MO63_FCR.
*/
#define	CAN_MOFCR63	(CAN_MO63_FCR)

/** \brief  17E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO63_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00197E4u)

/** Alias (User Manual Name) for CAN_MO63_FGPR.
* To use register names with standard convension, please use CAN_MO63_FGPR.
*/
#define	CAN_MOFGPR63	(CAN_MO63_FGPR)

/** \brief  17E8, Message Object  Interrupt Pointer Register */
#define CAN_MO63_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00197E8u)

/** Alias (User Manual Name) for CAN_MO63_IPR.
* To use register names with standard convension, please use CAN_MO63_IPR.
*/
#define	CAN_MOIPR63	(CAN_MO63_IPR)

/** \brief  17FC, Message Object  Control Register */
#define CAN_MO63_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00197FCu)

/** Alias (User Manual Name) for CAN_MO63_STAT.
* To use register names with standard convension, please use CAN_MO63_STAT.
*/
#define	CAN_MOSTAT63	(CAN_MO63_STAT)

/** \brief  180C, Message Object  Acceptance Mask Register */
#define CAN_MO64_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001980Cu)

/** Alias (User Manual Name) for CAN_MO64_AMR.
* To use register names with standard convension, please use CAN_MO64_AMR.
*/
#define	CAN_MOAMR64	(CAN_MO64_AMR)

/** \brief  1818, Message Object  Arbitration Register */
#define CAN_MO64_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019818u)

/** Alias (User Manual Name) for CAN_MO64_AR.
* To use register names with standard convension, please use CAN_MO64_AR.
*/
#define	CAN_MOAR64	(CAN_MO64_AR)

/** \brief  181C, Message Object  Control Register */
#define CAN_MO64_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001981Cu)

