leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO64_CTR.
* To use register names with standard convension, please use CAN_MO64_CTR.
*/
#define	CAN_MOCTR64	(CAN_MO64_CTR)

/** \brief  1814, Message Object  Data Register High */
#define CAN_MO64_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019814u)

/** Alias (User Manual Name) for CAN_MO64_DATAH.
* To use register names with standard convension, please use CAN_MO64_DATAH.
*/
#define	CAN_MODATAH64	(CAN_MO64_DATAH)

/** \brief  1810, Message Object  Data Register Low */
#define CAN_MO64_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019810u)

/** Alias (User Manual Name) for CAN_MO64_DATAL.
* To use register names with standard convension, please use CAN_MO64_DATAL.
*/
#define	CAN_MODATAL64	(CAN_MO64_DATAL)

/** \brief  1800, Message Object  Function Control Register */
#define CAN_MO64_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019800u)

/** Alias (User Manual Name) for CAN_MO64_EDATA0.
* To use register names with standard convension, please use CAN_MO64_EDATA0.
*/
#define	CAN_EMO64DATA0	(CAN_MO64_EDATA0)

/** \brief  1804, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO64_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019804u)

/** Alias (User Manual Name) for CAN_MO64_EDATA1.
* To use register names with standard convension, please use CAN_MO64_EDATA1.
*/
#define	CAN_EMO64DATA1	(CAN_MO64_EDATA1)

/** \brief  1808, Message Object  Interrupt Pointer Register */
#define CAN_MO64_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019808u)

/** Alias (User Manual Name) for CAN_MO64_EDATA2.
* To use register names with standard convension, please use CAN_MO64_EDATA2.
*/
#define	CAN_EMO64DATA2	(CAN_MO64_EDATA2)

/** \brief  180C, Message Object  Acceptance Mask Register */
#define CAN_MO64_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001980Cu)

/** Alias (User Manual Name) for CAN_MO64_EDATA3.
* To use register names with standard convension, please use CAN_MO64_EDATA3.
*/
#define	CAN_EMO64DATA3	(CAN_MO64_EDATA3)

/** \brief  1810, Message Object  Data Register Low */
#define CAN_MO64_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019810u)

/** Alias (User Manual Name) for CAN_MO64_EDATA4.
* To use register names with standard convension, please use CAN_MO64_EDATA4.
*/
#define	CAN_EMO64DATA4	(CAN_MO64_EDATA4)

/** \brief  1814, Message Object  Data Register High */
#define CAN_MO64_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019814u)

/** Alias (User Manual Name) for CAN_MO64_EDATA5.
* To use register names with standard convension, please use CAN_MO64_EDATA5.
*/
#define	CAN_EMO64DATA5	(CAN_MO64_EDATA5)

/** \brief  1818, Message Object  Arbitration Register */
#define CAN_MO64_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019818u)

/** Alias (User Manual Name) for CAN_MO64_EDATA6.
* To use register names with standard convension, please use CAN_MO64_EDATA6.
*/
#define	CAN_EMO64DATA6	(CAN_MO64_EDATA6)

/** \brief  1800, Message Object  Function Control Register */
#define CAN_MO64_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019800u)

/** Alias (User Manual Name) for CAN_MO64_FCR.
* To use register names with standard convension, please use CAN_MO64_FCR.
*/
#define	CAN_MOFCR64	(CAN_MO64_FCR)

/** \brief  1804, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO64_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019804u)

/** Alias (User Manual Name) for CAN_MO64_FGPR.
* To use register names with standard convension, please use CAN_MO64_FGPR.
*/
#define	CAN_MOFGPR64	(CAN_MO64_FGPR)

/** \brief  1808, Message Object  Interrupt Pointer Register */
#define CAN_MO64_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019808u)

/** Alias (User Manual Name) for CAN_MO64_IPR.
* To use register names with standard convension, please use CAN_MO64_IPR.
*/
#define	CAN_MOIPR64	(CAN_MO64_IPR)

/** \brief  181C, Message Object  Control Register */
#define CAN_MO64_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001981Cu)

/** Alias (User Manual Name) for CAN_MO64_STAT.
* To use register names with standard convension, please use CAN_MO64_STAT.
*/
#define	CAN_MOSTAT64	(CAN_MO64_STAT)

/** \brief  182C, Message Object  Acceptance Mask Register */
#define CAN_MO65_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001982Cu)

/** Alias (User Manual Name) for CAN_MO65_AMR.
* To use register names with standard convension, please use CAN_MO65_AMR.
*/
#define	CAN_MOAMR65	(CAN_MO65_AMR)

/** \brief  1838, Message Object  Arbitration Register */
#define CAN_MO65_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019838u)

/** Alias (User Manual Name) for CAN_MO65_AR.
* To use register names with standard convension, please use CAN_MO65_AR.
*/
#define	CAN_MOAR65	(CAN_MO65_AR)

/** \brief  183C, Message Object  Control Register */
#define CAN_MO65_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001983Cu)

/** Alias (User Manual Name) for CAN_MO65_CTR.
* To use register names with standard convension, please use CAN_MO65_CTR.
*/
#define	CAN_MOCTR65	(CAN_MO65_CTR)

/** \brief  1834, Message Object  Data Register High */
#define CAN_MO65_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019834u)

/** Alias (User Manual Name) for CAN_MO65_DATAH.
* To use register names with standard convension, please use CAN_MO65_DATAH.
*/
#define	CAN_MODATAH65	(CAN_MO65_DATAH)

/** \brief  1830, Message Object  Data Register Low */
#define CAN_MO65_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019830u)

/** Alias (User Manual Name) for CAN_MO65_DATAL.
* To use register names with standard convension, please use CAN_MO65_DATAL.
*/
#define	CAN_MODATAL65	(CAN_MO65_DATAL)

/** \brief  1820, Message Object  Function Control Register */
#define CAN_MO65_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019820u)

/** Alias (User Manual Name) for CAN_MO65_EDATA0.
* To use register names with standard convension, please use CAN_MO65_EDATA0.
*/
#define	CAN_EMO65DATA0	(CAN_MO65_EDATA0)

/** \brief  1824, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO65_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019824u)

/** Alias (User Manual Name) for CAN_MO65_EDATA1.
* To use register names with standard convension, please use CAN_MO65_EDATA1.
*/
#define	CAN_EMO65DATA1	(CAN_MO65_EDATA1)

