leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1828, Message Object  Interrupt Pointer Register */
#define CAN_MO65_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019828u)

/** Alias (User Manual Name) for CAN_MO65_EDATA2.
* To use register names with standard convension, please use CAN_MO65_EDATA2.
*/
#define	CAN_EMO65DATA2	(CAN_MO65_EDATA2)

/** \brief  182C, Message Object  Acceptance Mask Register */
#define CAN_MO65_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001982Cu)

/** Alias (User Manual Name) for CAN_MO65_EDATA3.
* To use register names with standard convension, please use CAN_MO65_EDATA3.
*/
#define	CAN_EMO65DATA3	(CAN_MO65_EDATA3)

/** \brief  1830, Message Object  Data Register Low */
#define CAN_MO65_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019830u)

/** Alias (User Manual Name) for CAN_MO65_EDATA4.
* To use register names with standard convension, please use CAN_MO65_EDATA4.
*/
#define	CAN_EMO65DATA4	(CAN_MO65_EDATA4)

/** \brief  1834, Message Object  Data Register High */
#define CAN_MO65_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019834u)

/** Alias (User Manual Name) for CAN_MO65_EDATA5.
* To use register names with standard convension, please use CAN_MO65_EDATA5.
*/
#define	CAN_EMO65DATA5	(CAN_MO65_EDATA5)

/** \brief  1838, Message Object  Arbitration Register */
#define CAN_MO65_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019838u)

/** Alias (User Manual Name) for CAN_MO65_EDATA6.
* To use register names with standard convension, please use CAN_MO65_EDATA6.
*/
#define	CAN_EMO65DATA6	(CAN_MO65_EDATA6)

/** \brief  1820, Message Object  Function Control Register */
#define CAN_MO65_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019820u)

/** Alias (User Manual Name) for CAN_MO65_FCR.
* To use register names with standard convension, please use CAN_MO65_FCR.
*/
#define	CAN_MOFCR65	(CAN_MO65_FCR)

/** \brief  1824, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO65_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019824u)

/** Alias (User Manual Name) for CAN_MO65_FGPR.
* To use register names with standard convension, please use CAN_MO65_FGPR.
*/
#define	CAN_MOFGPR65	(CAN_MO65_FGPR)

/** \brief  1828, Message Object  Interrupt Pointer Register */
#define CAN_MO65_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019828u)

/** Alias (User Manual Name) for CAN_MO65_IPR.
* To use register names with standard convension, please use CAN_MO65_IPR.
*/
#define	CAN_MOIPR65	(CAN_MO65_IPR)

/** \brief  183C, Message Object  Control Register */
#define CAN_MO65_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001983Cu)

/** Alias (User Manual Name) for CAN_MO65_STAT.
* To use register names with standard convension, please use CAN_MO65_STAT.
*/
#define	CAN_MOSTAT65	(CAN_MO65_STAT)

/** \brief  184C, Message Object  Acceptance Mask Register */
#define CAN_MO66_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001984Cu)

/** Alias (User Manual Name) for CAN_MO66_AMR.
* To use register names with standard convension, please use CAN_MO66_AMR.
*/
#define	CAN_MOAMR66	(CAN_MO66_AMR)

/** \brief  1858, Message Object  Arbitration Register */
#define CAN_MO66_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019858u)

/** Alias (User Manual Name) for CAN_MO66_AR.
* To use register names with standard convension, please use CAN_MO66_AR.
*/
#define	CAN_MOAR66	(CAN_MO66_AR)

/** \brief  185C, Message Object  Control Register */
#define CAN_MO66_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001985Cu)

/** Alias (User Manual Name) for CAN_MO66_CTR.
* To use register names with standard convension, please use CAN_MO66_CTR.
*/
#define	CAN_MOCTR66	(CAN_MO66_CTR)

/** \brief  1854, Message Object  Data Register High */
#define CAN_MO66_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019854u)

/** Alias (User Manual Name) for CAN_MO66_DATAH.
* To use register names with standard convension, please use CAN_MO66_DATAH.
*/
#define	CAN_MODATAH66	(CAN_MO66_DATAH)

/** \brief  1850, Message Object  Data Register Low */
#define CAN_MO66_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019850u)

/** Alias (User Manual Name) for CAN_MO66_DATAL.
* To use register names with standard convension, please use CAN_MO66_DATAL.
*/
#define	CAN_MODATAL66	(CAN_MO66_DATAL)

/** \brief  1840, Message Object  Function Control Register */
#define CAN_MO66_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019840u)

/** Alias (User Manual Name) for CAN_MO66_EDATA0.
* To use register names with standard convension, please use CAN_MO66_EDATA0.
*/
#define	CAN_EMO66DATA0	(CAN_MO66_EDATA0)

/** \brief  1844, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO66_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019844u)

/** Alias (User Manual Name) for CAN_MO66_EDATA1.
* To use register names with standard convension, please use CAN_MO66_EDATA1.
*/
#define	CAN_EMO66DATA1	(CAN_MO66_EDATA1)

/** \brief  1848, Message Object  Interrupt Pointer Register */
#define CAN_MO66_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019848u)

/** Alias (User Manual Name) for CAN_MO66_EDATA2.
* To use register names with standard convension, please use CAN_MO66_EDATA2.
*/
#define	CAN_EMO66DATA2	(CAN_MO66_EDATA2)

/** \brief  184C, Message Object  Acceptance Mask Register */
#define CAN_MO66_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001984Cu)

/** Alias (User Manual Name) for CAN_MO66_EDATA3.
* To use register names with standard convension, please use CAN_MO66_EDATA3.
*/
#define	CAN_EMO66DATA3	(CAN_MO66_EDATA3)

/** \brief  1850, Message Object  Data Register Low */
#define CAN_MO66_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019850u)

/** Alias (User Manual Name) for CAN_MO66_EDATA4.
* To use register names with standard convension, please use CAN_MO66_EDATA4.
*/
#define	CAN_EMO66DATA4	(CAN_MO66_EDATA4)

/** \brief  1854, Message Object  Data Register High */
#define CAN_MO66_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019854u)

