leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO66_EDATA5.
* To use register names with standard convension, please use CAN_MO66_EDATA5.
*/
#define	CAN_EMO66DATA5	(CAN_MO66_EDATA5)

/** \brief  1858, Message Object  Arbitration Register */
#define CAN_MO66_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019858u)

/** Alias (User Manual Name) for CAN_MO66_EDATA6.
* To use register names with standard convension, please use CAN_MO66_EDATA6.
*/
#define	CAN_EMO66DATA6	(CAN_MO66_EDATA6)

/** \brief  1840, Message Object  Function Control Register */
#define CAN_MO66_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019840u)

/** Alias (User Manual Name) for CAN_MO66_FCR.
* To use register names with standard convension, please use CAN_MO66_FCR.
*/
#define	CAN_MOFCR66	(CAN_MO66_FCR)

/** \brief  1844, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO66_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019844u)

/** Alias (User Manual Name) for CAN_MO66_FGPR.
* To use register names with standard convension, please use CAN_MO66_FGPR.
*/
#define	CAN_MOFGPR66	(CAN_MO66_FGPR)

/** \brief  1848, Message Object  Interrupt Pointer Register */
#define CAN_MO66_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019848u)

/** Alias (User Manual Name) for CAN_MO66_IPR.
* To use register names with standard convension, please use CAN_MO66_IPR.
*/
#define	CAN_MOIPR66	(CAN_MO66_IPR)

/** \brief  185C, Message Object  Control Register */
#define CAN_MO66_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001985Cu)

/** Alias (User Manual Name) for CAN_MO66_STAT.
* To use register names with standard convension, please use CAN_MO66_STAT.
*/
#define	CAN_MOSTAT66	(CAN_MO66_STAT)

/** \brief  186C, Message Object  Acceptance Mask Register */
#define CAN_MO67_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001986Cu)

/** Alias (User Manual Name) for CAN_MO67_AMR.
* To use register names with standard convension, please use CAN_MO67_AMR.
*/
#define	CAN_MOAMR67	(CAN_MO67_AMR)

/** \brief  1878, Message Object  Arbitration Register */
#define CAN_MO67_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019878u)

/** Alias (User Manual Name) for CAN_MO67_AR.
* To use register names with standard convension, please use CAN_MO67_AR.
*/
#define	CAN_MOAR67	(CAN_MO67_AR)

/** \brief  187C, Message Object  Control Register */
#define CAN_MO67_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001987Cu)

/** Alias (User Manual Name) for CAN_MO67_CTR.
* To use register names with standard convension, please use CAN_MO67_CTR.
*/
#define	CAN_MOCTR67	(CAN_MO67_CTR)

/** \brief  1874, Message Object  Data Register High */
#define CAN_MO67_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019874u)

/** Alias (User Manual Name) for CAN_MO67_DATAH.
* To use register names with standard convension, please use CAN_MO67_DATAH.
*/
#define	CAN_MODATAH67	(CAN_MO67_DATAH)

/** \brief  1870, Message Object  Data Register Low */
#define CAN_MO67_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019870u)

/** Alias (User Manual Name) for CAN_MO67_DATAL.
* To use register names with standard convension, please use CAN_MO67_DATAL.
*/
#define	CAN_MODATAL67	(CAN_MO67_DATAL)

/** \brief  1860, Message Object  Function Control Register */
#define CAN_MO67_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019860u)

/** Alias (User Manual Name) for CAN_MO67_EDATA0.
* To use register names with standard convension, please use CAN_MO67_EDATA0.
*/
#define	CAN_EMO67DATA0	(CAN_MO67_EDATA0)

/** \brief  1864, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO67_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019864u)

/** Alias (User Manual Name) for CAN_MO67_EDATA1.
* To use register names with standard convension, please use CAN_MO67_EDATA1.
*/
#define	CAN_EMO67DATA1	(CAN_MO67_EDATA1)

/** \brief  1868, Message Object  Interrupt Pointer Register */
#define CAN_MO67_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019868u)

/** Alias (User Manual Name) for CAN_MO67_EDATA2.
* To use register names with standard convension, please use CAN_MO67_EDATA2.
*/
#define	CAN_EMO67DATA2	(CAN_MO67_EDATA2)

/** \brief  186C, Message Object  Acceptance Mask Register */
#define CAN_MO67_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001986Cu)

/** Alias (User Manual Name) for CAN_MO67_EDATA3.
* To use register names with standard convension, please use CAN_MO67_EDATA3.
*/
#define	CAN_EMO67DATA3	(CAN_MO67_EDATA3)

/** \brief  1870, Message Object  Data Register Low */
#define CAN_MO67_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019870u)

/** Alias (User Manual Name) for CAN_MO67_EDATA4.
* To use register names with standard convension, please use CAN_MO67_EDATA4.
*/
#define	CAN_EMO67DATA4	(CAN_MO67_EDATA4)

/** \brief  1874, Message Object  Data Register High */
#define CAN_MO67_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019874u)

/** Alias (User Manual Name) for CAN_MO67_EDATA5.
* To use register names with standard convension, please use CAN_MO67_EDATA5.
*/
#define	CAN_EMO67DATA5	(CAN_MO67_EDATA5)

/** \brief  1878, Message Object  Arbitration Register */
#define CAN_MO67_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019878u)

/** Alias (User Manual Name) for CAN_MO67_EDATA6.
* To use register names with standard convension, please use CAN_MO67_EDATA6.
*/
#define	CAN_EMO67DATA6	(CAN_MO67_EDATA6)

/** \brief  1860, Message Object  Function Control Register */
#define CAN_MO67_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019860u)

/** Alias (User Manual Name) for CAN_MO67_FCR.
* To use register names with standard convension, please use CAN_MO67_FCR.
*/
#define	CAN_MOFCR67	(CAN_MO67_FCR)

/** \brief  1864, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO67_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019864u)

/** Alias (User Manual Name) for CAN_MO67_FGPR.
* To use register names with standard convension, please use CAN_MO67_FGPR.
*/
#define	CAN_MOFGPR67	(CAN_MO67_FGPR)

/** \brief  1868, Message Object  Interrupt Pointer Register */
#define CAN_MO67_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019868u)

/** Alias (User Manual Name) for CAN_MO67_IPR.
* To use register names with standard convension, please use CAN_MO67_IPR.
*/
#define	CAN_MOIPR67	(CAN_MO67_IPR)

/** \brief  187C, Message Object  Control Register */
#define CAN_MO67_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001987Cu)

/** Alias (User Manual Name) for CAN_MO67_STAT.
* To use register names with standard convension, please use CAN_MO67_STAT.
*/
#define	CAN_MOSTAT67	(CAN_MO67_STAT)

/** \brief  188C, Message Object  Acceptance Mask Register */
#define CAN_MO68_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001988Cu)

/** Alias (User Manual Name) for CAN_MO68_AMR.
* To use register names with standard convension, please use CAN_MO68_AMR.
*/
#define	CAN_MOAMR68	(CAN_MO68_AMR)

