leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO69_EDATA0.
* To use register names with standard convension, please use CAN_MO69_EDATA0.
*/
#define	CAN_EMO69DATA0	(CAN_MO69_EDATA0)

/** \brief  18A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO69_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00198A4u)

/** Alias (User Manual Name) for CAN_MO69_EDATA1.
* To use register names with standard convension, please use CAN_MO69_EDATA1.
*/
#define	CAN_EMO69DATA1	(CAN_MO69_EDATA1)

/** \brief  18A8, Message Object  Interrupt Pointer Register */
#define CAN_MO69_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00198A8u)

/** Alias (User Manual Name) for CAN_MO69_EDATA2.
* To use register names with standard convension, please use CAN_MO69_EDATA2.
*/
#define	CAN_EMO69DATA2	(CAN_MO69_EDATA2)

/** \brief  18AC, Message Object  Acceptance Mask Register */
#define CAN_MO69_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00198ACu)

/** Alias (User Manual Name) for CAN_MO69_EDATA3.
* To use register names with standard convension, please use CAN_MO69_EDATA3.
*/
#define	CAN_EMO69DATA3	(CAN_MO69_EDATA3)

/** \brief  18B0, Message Object  Data Register Low */
#define CAN_MO69_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00198B0u)

/** Alias (User Manual Name) for CAN_MO69_EDATA4.
* To use register names with standard convension, please use CAN_MO69_EDATA4.
*/
#define	CAN_EMO69DATA4	(CAN_MO69_EDATA4)

/** \brief  18B4, Message Object  Data Register High */
#define CAN_MO69_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00198B4u)

/** Alias (User Manual Name) for CAN_MO69_EDATA5.
* To use register names with standard convension, please use CAN_MO69_EDATA5.
*/
#define	CAN_EMO69DATA5	(CAN_MO69_EDATA5)

/** \brief  18B8, Message Object  Arbitration Register */
#define CAN_MO69_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00198B8u)

/** Alias (User Manual Name) for CAN_MO69_EDATA6.
* To use register names with standard convension, please use CAN_MO69_EDATA6.
*/
#define	CAN_EMO69DATA6	(CAN_MO69_EDATA6)

/** \brief  18A0, Message Object  Function Control Register */
#define CAN_MO69_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00198A0u)

/** Alias (User Manual Name) for CAN_MO69_FCR.
* To use register names with standard convension, please use CAN_MO69_FCR.
*/
#define	CAN_MOFCR69	(CAN_MO69_FCR)

/** \brief  18A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO69_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00198A4u)

/** Alias (User Manual Name) for CAN_MO69_FGPR.
* To use register names with standard convension, please use CAN_MO69_FGPR.
*/
#define	CAN_MOFGPR69	(CAN_MO69_FGPR)

/** \brief  18A8, Message Object  Interrupt Pointer Register */
#define CAN_MO69_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00198A8u)

/** Alias (User Manual Name) for CAN_MO69_IPR.
* To use register names with standard convension, please use CAN_MO69_IPR.
*/
#define	CAN_MOIPR69	(CAN_MO69_IPR)

/** \brief  18BC, Message Object  Control Register */
#define CAN_MO69_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00198BCu)

/** Alias (User Manual Name) for CAN_MO69_STAT.
* To use register names with standard convension, please use CAN_MO69_STAT.
*/
#define	CAN_MOSTAT69	(CAN_MO69_STAT)

/** \brief  10CC, Message Object  Acceptance Mask Register */
#define CAN_MO6_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00190CCu)

/** Alias (User Manual Name) for CAN_MO6_AMR.
* To use register names with standard convension, please use CAN_MO6_AMR.
*/
#define	CAN_MOAMR6	(CAN_MO6_AMR)

/** \brief  10D8, Message Object  Arbitration Register */
#define CAN_MO6_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00190D8u)

/** Alias (User Manual Name) for CAN_MO6_AR.
* To use register names with standard convension, please use CAN_MO6_AR.
*/
#define	CAN_MOAR6	(CAN_MO6_AR)

/** \brief  10DC, Message Object  Control Register */
#define CAN_MO6_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00190DCu)

/** Alias (User Manual Name) for CAN_MO6_CTR.
* To use register names with standard convension, please use CAN_MO6_CTR.
*/
#define	CAN_MOCTR6	(CAN_MO6_CTR)

/** \brief  10D4, Message Object  Data Register High */
#define CAN_MO6_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00190D4u)

/** Alias (User Manual Name) for CAN_MO6_DATAH.
* To use register names with standard convension, please use CAN_MO6_DATAH.
*/
#define	CAN_MODATAH6	(CAN_MO6_DATAH)

/** \brief  10D0, Message Object  Data Register Low */
#define CAN_MO6_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00190D0u)

/** Alias (User Manual Name) for CAN_MO6_DATAL.
* To use register names with standard convension, please use CAN_MO6_DATAL.
*/
#define	CAN_MODATAL6	(CAN_MO6_DATAL)

/** \brief  10C0, Message Object  Function Control Register */
#define CAN_MO6_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00190C0u)

/** Alias (User Manual Name) for CAN_MO6_EDATA0.
* To use register names with standard convension, please use CAN_MO6_EDATA0.
*/
#define	CAN_EMO6DATA0	(CAN_MO6_EDATA0)

/** \brief  10C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO6_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00190C4u)

/** Alias (User Manual Name) for CAN_MO6_EDATA1.
* To use register names with standard convension, please use CAN_MO6_EDATA1.
*/
#define	CAN_EMO6DATA1	(CAN_MO6_EDATA1)

/** \brief  10C8, Message Object  Interrupt Pointer Register */
#define CAN_MO6_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00190C8u)

/** Alias (User Manual Name) for CAN_MO6_EDATA2.
* To use register names with standard convension, please use CAN_MO6_EDATA2.
*/
#define	CAN_EMO6DATA2	(CAN_MO6_EDATA2)

/** \brief  10CC, Message Object  Acceptance Mask Register */
#define CAN_MO6_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00190CCu)

/** Alias (User Manual Name) for CAN_MO6_EDATA3.
* To use register names with standard convension, please use CAN_MO6_EDATA3.
*/
#define	CAN_EMO6DATA3	(CAN_MO6_EDATA3)

/** \brief  10D0, Message Object  Data Register Low */
#define CAN_MO6_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00190D0u)

/** Alias (User Manual Name) for CAN_MO6_EDATA4.
* To use register names with standard convension, please use CAN_MO6_EDATA4.
*/
#define	CAN_EMO6DATA4	(CAN_MO6_EDATA4)

/** \brief  10D4, Message Object  Data Register High */
#define CAN_MO6_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00190D4u)

