leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO6_EDATA5.
* To use register names with standard convension, please use CAN_MO6_EDATA5.
*/
#define	CAN_EMO6DATA5	(CAN_MO6_EDATA5)

/** \brief  10D8, Message Object  Arbitration Register */
#define CAN_MO6_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00190D8u)

/** Alias (User Manual Name) for CAN_MO6_EDATA6.
* To use register names with standard convension, please use CAN_MO6_EDATA6.
*/
#define	CAN_EMO6DATA6	(CAN_MO6_EDATA6)

/** \brief  10C0, Message Object  Function Control Register */
#define CAN_MO6_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00190C0u)

/** Alias (User Manual Name) for CAN_MO6_FCR.
* To use register names with standard convension, please use CAN_MO6_FCR.
*/
#define	CAN_MOFCR6	(CAN_MO6_FCR)

/** \brief  10C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO6_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00190C4u)

/** Alias (User Manual Name) for CAN_MO6_FGPR.
* To use register names with standard convension, please use CAN_MO6_FGPR.
*/
#define	CAN_MOFGPR6	(CAN_MO6_FGPR)

/** \brief  10C8, Message Object  Interrupt Pointer Register */
#define CAN_MO6_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00190C8u)

/** Alias (User Manual Name) for CAN_MO6_IPR.
* To use register names with standard convension, please use CAN_MO6_IPR.
*/
#define	CAN_MOIPR6	(CAN_MO6_IPR)

/** \brief  10DC, Message Object  Control Register */
#define CAN_MO6_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00190DCu)

/** Alias (User Manual Name) for CAN_MO6_STAT.
* To use register names with standard convension, please use CAN_MO6_STAT.
*/
#define	CAN_MOSTAT6	(CAN_MO6_STAT)

/** \brief  18CC, Message Object  Acceptance Mask Register */
#define CAN_MO70_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00198CCu)

/** Alias (User Manual Name) for CAN_MO70_AMR.
* To use register names with standard convension, please use CAN_MO70_AMR.
*/
#define	CAN_MOAMR70	(CAN_MO70_AMR)

/** \brief  18D8, Message Object  Arbitration Register */
#define CAN_MO70_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00198D8u)

/** Alias (User Manual Name) for CAN_MO70_AR.
* To use register names with standard convension, please use CAN_MO70_AR.
*/
#define	CAN_MOAR70	(CAN_MO70_AR)

/** \brief  18DC, Message Object  Control Register */
#define CAN_MO70_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00198DCu)

/** Alias (User Manual Name) for CAN_MO70_CTR.
* To use register names with standard convension, please use CAN_MO70_CTR.
*/
#define	CAN_MOCTR70	(CAN_MO70_CTR)

/** \brief  18D4, Message Object  Data Register High */
#define CAN_MO70_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00198D4u)

/** Alias (User Manual Name) for CAN_MO70_DATAH.
* To use register names with standard convension, please use CAN_MO70_DATAH.
*/
#define	CAN_MODATAH70	(CAN_MO70_DATAH)

/** \brief  18D0, Message Object  Data Register Low */
#define CAN_MO70_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00198D0u)

/** Alias (User Manual Name) for CAN_MO70_DATAL.
* To use register names with standard convension, please use CAN_MO70_DATAL.
*/
#define	CAN_MODATAL70	(CAN_MO70_DATAL)

/** \brief  18C0, Message Object  Function Control Register */
#define CAN_MO70_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00198C0u)

/** Alias (User Manual Name) for CAN_MO70_EDATA0.
* To use register names with standard convension, please use CAN_MO70_EDATA0.
*/
#define	CAN_EMO70DATA0	(CAN_MO70_EDATA0)

/** \brief  18C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO70_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00198C4u)

/** Alias (User Manual Name) for CAN_MO70_EDATA1.
* To use register names with standard convension, please use CAN_MO70_EDATA1.
*/
#define	CAN_EMO70DATA1	(CAN_MO70_EDATA1)

/** \brief  18C8, Message Object  Interrupt Pointer Register */
#define CAN_MO70_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00198C8u)

/** Alias (User Manual Name) for CAN_MO70_EDATA2.
* To use register names with standard convension, please use CAN_MO70_EDATA2.
*/
#define	CAN_EMO70DATA2	(CAN_MO70_EDATA2)

/** \brief  18CC, Message Object  Acceptance Mask Register */
#define CAN_MO70_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00198CCu)

/** Alias (User Manual Name) for CAN_MO70_EDATA3.
* To use register names with standard convension, please use CAN_MO70_EDATA3.
*/
#define	CAN_EMO70DATA3	(CAN_MO70_EDATA3)

/** \brief  18D0, Message Object  Data Register Low */
#define CAN_MO70_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00198D0u)

/** Alias (User Manual Name) for CAN_MO70_EDATA4.
* To use register names with standard convension, please use CAN_MO70_EDATA4.
*/
#define	CAN_EMO70DATA4	(CAN_MO70_EDATA4)

/** \brief  18D4, Message Object  Data Register High */
#define CAN_MO70_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00198D4u)

/** Alias (User Manual Name) for CAN_MO70_EDATA5.
* To use register names with standard convension, please use CAN_MO70_EDATA5.
*/
#define	CAN_EMO70DATA5	(CAN_MO70_EDATA5)

/** \brief  18D8, Message Object  Arbitration Register */
#define CAN_MO70_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00198D8u)

/** Alias (User Manual Name) for CAN_MO70_EDATA6.
* To use register names with standard convension, please use CAN_MO70_EDATA6.
*/
#define	CAN_EMO70DATA6	(CAN_MO70_EDATA6)

/** \brief  18C0, Message Object  Function Control Register */
#define CAN_MO70_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00198C0u)

/** Alias (User Manual Name) for CAN_MO70_FCR.
* To use register names with standard convension, please use CAN_MO70_FCR.
*/
#define	CAN_MOFCR70	(CAN_MO70_FCR)

/** \brief  18C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO70_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00198C4u)

/** Alias (User Manual Name) for CAN_MO70_FGPR.
* To use register names with standard convension, please use CAN_MO70_FGPR.
*/
#define	CAN_MOFGPR70	(CAN_MO70_FGPR)

/** \brief  18C8, Message Object  Interrupt Pointer Register */
#define CAN_MO70_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00198C8u)

/** Alias (User Manual Name) for CAN_MO70_IPR.
* To use register names with standard convension, please use CAN_MO70_IPR.
*/
#define	CAN_MOIPR70	(CAN_MO70_IPR)

/** \brief  18DC, Message Object  Control Register */
#define CAN_MO70_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00198DCu)

/** Alias (User Manual Name) for CAN_MO70_STAT.
* To use register names with standard convension, please use CAN_MO70_STAT.
*/
#define	CAN_MOSTAT70	(CAN_MO70_STAT)

/** \brief  18EC, Message Object  Acceptance Mask Register */
#define CAN_MO71_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00198ECu)

/** Alias (User Manual Name) for CAN_MO71_AMR.
* To use register names with standard convension, please use CAN_MO71_AMR.
*/
#define	CAN_MOAMR71	(CAN_MO71_AMR)

/** \brief  18F8, Message Object  Arbitration Register */
#define CAN_MO71_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00198F8u)

