leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO72_EDATA3.
* To use register names with standard convension, please use CAN_MO72_EDATA3.
*/
#define	CAN_EMO72DATA3	(CAN_MO72_EDATA3)

/** \brief  1910, Message Object  Data Register Low */
#define CAN_MO72_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019910u)

/** Alias (User Manual Name) for CAN_MO72_EDATA4.
* To use register names with standard convension, please use CAN_MO72_EDATA4.
*/
#define	CAN_EMO72DATA4	(CAN_MO72_EDATA4)

/** \brief  1914, Message Object  Data Register High */
#define CAN_MO72_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019914u)

/** Alias (User Manual Name) for CAN_MO72_EDATA5.
* To use register names with standard convension, please use CAN_MO72_EDATA5.
*/
#define	CAN_EMO72DATA5	(CAN_MO72_EDATA5)

/** \brief  1918, Message Object  Arbitration Register */
#define CAN_MO72_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019918u)

/** Alias (User Manual Name) for CAN_MO72_EDATA6.
* To use register names with standard convension, please use CAN_MO72_EDATA6.
*/
#define	CAN_EMO72DATA6	(CAN_MO72_EDATA6)

/** \brief  1900, Message Object  Function Control Register */
#define CAN_MO72_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019900u)

/** Alias (User Manual Name) for CAN_MO72_FCR.
* To use register names with standard convension, please use CAN_MO72_FCR.
*/
#define	CAN_MOFCR72	(CAN_MO72_FCR)

/** \brief  1904, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO72_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019904u)

/** Alias (User Manual Name) for CAN_MO72_FGPR.
* To use register names with standard convension, please use CAN_MO72_FGPR.
*/
#define	CAN_MOFGPR72	(CAN_MO72_FGPR)

/** \brief  1908, Message Object  Interrupt Pointer Register */
#define CAN_MO72_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019908u)

/** Alias (User Manual Name) for CAN_MO72_IPR.
* To use register names with standard convension, please use CAN_MO72_IPR.
*/
#define	CAN_MOIPR72	(CAN_MO72_IPR)

/** \brief  191C, Message Object  Control Register */
#define CAN_MO72_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001991Cu)

/** Alias (User Manual Name) for CAN_MO72_STAT.
* To use register names with standard convension, please use CAN_MO72_STAT.
*/
#define	CAN_MOSTAT72	(CAN_MO72_STAT)

/** \brief  192C, Message Object  Acceptance Mask Register */
#define CAN_MO73_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001992Cu)

/** Alias (User Manual Name) for CAN_MO73_AMR.
* To use register names with standard convension, please use CAN_MO73_AMR.
*/
#define	CAN_MOAMR73	(CAN_MO73_AMR)

/** \brief  1938, Message Object  Arbitration Register */
#define CAN_MO73_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019938u)

/** Alias (User Manual Name) for CAN_MO73_AR.
* To use register names with standard convension, please use CAN_MO73_AR.
*/
#define	CAN_MOAR73	(CAN_MO73_AR)

/** \brief  193C, Message Object  Control Register */
#define CAN_MO73_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001993Cu)

/** Alias (User Manual Name) for CAN_MO73_CTR.
* To use register names with standard convension, please use CAN_MO73_CTR.
*/
#define	CAN_MOCTR73	(CAN_MO73_CTR)

/** \brief  1934, Message Object  Data Register High */
#define CAN_MO73_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019934u)

/** Alias (User Manual Name) for CAN_MO73_DATAH.
* To use register names with standard convension, please use CAN_MO73_DATAH.
*/
#define	CAN_MODATAH73	(CAN_MO73_DATAH)

/** \brief  1930, Message Object  Data Register Low */
#define CAN_MO73_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019930u)

/** Alias (User Manual Name) for CAN_MO73_DATAL.
* To use register names with standard convension, please use CAN_MO73_DATAL.
*/
#define	CAN_MODATAL73	(CAN_MO73_DATAL)

/** \brief  1920, Message Object  Function Control Register */
#define CAN_MO73_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019920u)

/** Alias (User Manual Name) for CAN_MO73_EDATA0.
* To use register names with standard convension, please use CAN_MO73_EDATA0.
*/
#define	CAN_EMO73DATA0	(CAN_MO73_EDATA0)

/** \brief  1924, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO73_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019924u)

/** Alias (User Manual Name) for CAN_MO73_EDATA1.
* To use register names with standard convension, please use CAN_MO73_EDATA1.
*/
#define	CAN_EMO73DATA1	(CAN_MO73_EDATA1)

/** \brief  1928, Message Object  Interrupt Pointer Register */
#define CAN_MO73_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019928u)

/** Alias (User Manual Name) for CAN_MO73_EDATA2.
* To use register names with standard convension, please use CAN_MO73_EDATA2.
*/
#define	CAN_EMO73DATA2	(CAN_MO73_EDATA2)

/** \brief  192C, Message Object  Acceptance Mask Register */
#define CAN_MO73_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001992Cu)

/** Alias (User Manual Name) for CAN_MO73_EDATA3.
* To use register names with standard convension, please use CAN_MO73_EDATA3.
*/
#define	CAN_EMO73DATA3	(CAN_MO73_EDATA3)

/** \brief  1930, Message Object  Data Register Low */
#define CAN_MO73_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019930u)

/** Alias (User Manual Name) for CAN_MO73_EDATA4.
* To use register names with standard convension, please use CAN_MO73_EDATA4.
*/
#define	CAN_EMO73DATA4	(CAN_MO73_EDATA4)

/** \brief  1934, Message Object  Data Register High */
#define CAN_MO73_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019934u)

/** Alias (User Manual Name) for CAN_MO73_EDATA5.
* To use register names with standard convension, please use CAN_MO73_EDATA5.
*/
#define	CAN_EMO73DATA5	(CAN_MO73_EDATA5)

/** \brief  1938, Message Object  Arbitration Register */
#define CAN_MO73_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019938u)

/** Alias (User Manual Name) for CAN_MO73_EDATA6.
* To use register names with standard convension, please use CAN_MO73_EDATA6.
*/
#define	CAN_EMO73DATA6	(CAN_MO73_EDATA6)

/** \brief  1920, Message Object  Function Control Register */
#define CAN_MO73_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019920u)

/** Alias (User Manual Name) for CAN_MO73_FCR.
* To use register names with standard convension, please use CAN_MO73_FCR.
*/
#define	CAN_MOFCR73	(CAN_MO73_FCR)

