leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1980, Message Object  Function Control Register */
#define CAN_MO76_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019980u)

/** Alias (User Manual Name) for CAN_MO76_EDATA0.
* To use register names with standard convension, please use CAN_MO76_EDATA0.
*/
#define	CAN_EMO76DATA0	(CAN_MO76_EDATA0)

/** \brief  1984, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO76_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019984u)

/** Alias (User Manual Name) for CAN_MO76_EDATA1.
* To use register names with standard convension, please use CAN_MO76_EDATA1.
*/
#define	CAN_EMO76DATA1	(CAN_MO76_EDATA1)

/** \brief  1988, Message Object  Interrupt Pointer Register */
#define CAN_MO76_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019988u)

/** Alias (User Manual Name) for CAN_MO76_EDATA2.
* To use register names with standard convension, please use CAN_MO76_EDATA2.
*/
#define	CAN_EMO76DATA2	(CAN_MO76_EDATA2)

/** \brief  198C, Message Object  Acceptance Mask Register */
#define CAN_MO76_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001998Cu)

/** Alias (User Manual Name) for CAN_MO76_EDATA3.
* To use register names with standard convension, please use CAN_MO76_EDATA3.
*/
#define	CAN_EMO76DATA3	(CAN_MO76_EDATA3)

/** \brief  1990, Message Object  Data Register Low */
#define CAN_MO76_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019990u)

/** Alias (User Manual Name) for CAN_MO76_EDATA4.
* To use register names with standard convension, please use CAN_MO76_EDATA4.
*/
#define	CAN_EMO76DATA4	(CAN_MO76_EDATA4)

/** \brief  1994, Message Object  Data Register High */
#define CAN_MO76_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019994u)

/** Alias (User Manual Name) for CAN_MO76_EDATA5.
* To use register names with standard convension, please use CAN_MO76_EDATA5.
*/
#define	CAN_EMO76DATA5	(CAN_MO76_EDATA5)

/** \brief  1998, Message Object  Arbitration Register */
#define CAN_MO76_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019998u)

/** Alias (User Manual Name) for CAN_MO76_EDATA6.
* To use register names with standard convension, please use CAN_MO76_EDATA6.
*/
#define	CAN_EMO76DATA6	(CAN_MO76_EDATA6)

/** \brief  1980, Message Object  Function Control Register */
#define CAN_MO76_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019980u)

/** Alias (User Manual Name) for CAN_MO76_FCR.
* To use register names with standard convension, please use CAN_MO76_FCR.
*/
#define	CAN_MOFCR76	(CAN_MO76_FCR)

/** \brief  1984, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO76_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019984u)

/** Alias (User Manual Name) for CAN_MO76_FGPR.
* To use register names with standard convension, please use CAN_MO76_FGPR.
*/
#define	CAN_MOFGPR76	(CAN_MO76_FGPR)

/** \brief  1988, Message Object  Interrupt Pointer Register */
#define CAN_MO76_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019988u)

/** Alias (User Manual Name) for CAN_MO76_IPR.
* To use register names with standard convension, please use CAN_MO76_IPR.
*/
#define	CAN_MOIPR76	(CAN_MO76_IPR)

/** \brief  199C, Message Object  Control Register */
#define CAN_MO76_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001999Cu)

/** Alias (User Manual Name) for CAN_MO76_STAT.
* To use register names with standard convension, please use CAN_MO76_STAT.
*/
#define	CAN_MOSTAT76	(CAN_MO76_STAT)

/** \brief  19AC, Message Object  Acceptance Mask Register */
#define CAN_MO77_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00199ACu)

/** Alias (User Manual Name) for CAN_MO77_AMR.
* To use register names with standard convension, please use CAN_MO77_AMR.
*/
#define	CAN_MOAMR77	(CAN_MO77_AMR)

/** \brief  19B8, Message Object  Arbitration Register */
#define CAN_MO77_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00199B8u)

/** Alias (User Manual Name) for CAN_MO77_AR.
* To use register names with standard convension, please use CAN_MO77_AR.
*/
#define	CAN_MOAR77	(CAN_MO77_AR)

/** \brief  19BC, Message Object  Control Register */
#define CAN_MO77_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00199BCu)

/** Alias (User Manual Name) for CAN_MO77_CTR.
* To use register names with standard convension, please use CAN_MO77_CTR.
*/
#define	CAN_MOCTR77	(CAN_MO77_CTR)

/** \brief  19B4, Message Object  Data Register High */
#define CAN_MO77_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00199B4u)

/** Alias (User Manual Name) for CAN_MO77_DATAH.
* To use register names with standard convension, please use CAN_MO77_DATAH.
*/
#define	CAN_MODATAH77	(CAN_MO77_DATAH)

/** \brief  19B0, Message Object  Data Register Low */
#define CAN_MO77_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00199B0u)

/** Alias (User Manual Name) for CAN_MO77_DATAL.
* To use register names with standard convension, please use CAN_MO77_DATAL.
*/
#define	CAN_MODATAL77	(CAN_MO77_DATAL)

/** \brief  19A0, Message Object  Function Control Register */
#define CAN_MO77_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00199A0u)

/** Alias (User Manual Name) for CAN_MO77_EDATA0.
* To use register names with standard convension, please use CAN_MO77_EDATA0.
*/
#define	CAN_EMO77DATA0	(CAN_MO77_EDATA0)

/** \brief  19A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO77_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00199A4u)

/** Alias (User Manual Name) for CAN_MO77_EDATA1.
* To use register names with standard convension, please use CAN_MO77_EDATA1.
*/
#define	CAN_EMO77DATA1	(CAN_MO77_EDATA1)

/** \brief  19A8, Message Object  Interrupt Pointer Register */
#define CAN_MO77_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00199A8u)

/** Alias (User Manual Name) for CAN_MO77_EDATA2.
* To use register names with standard convension, please use CAN_MO77_EDATA2.
*/
#define	CAN_EMO77DATA2	(CAN_MO77_EDATA2)

/** \brief  19AC, Message Object  Acceptance Mask Register */
#define CAN_MO77_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00199ACu)

/** Alias (User Manual Name) for CAN_MO77_EDATA3.
* To use register names with standard convension, please use CAN_MO77_EDATA3.
*/
#define	CAN_EMO77DATA3	(CAN_MO77_EDATA3)

/** \brief  19B0, Message Object  Data Register Low */
#define CAN_MO77_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00199B0u)

