leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO77_EDATA4.
* To use register names with standard convension, please use CAN_MO77_EDATA4.
*/
#define	CAN_EMO77DATA4	(CAN_MO77_EDATA4)

/** \brief  19B4, Message Object  Data Register High */
#define CAN_MO77_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00199B4u)

/** Alias (User Manual Name) for CAN_MO77_EDATA5.
* To use register names with standard convension, please use CAN_MO77_EDATA5.
*/
#define	CAN_EMO77DATA5	(CAN_MO77_EDATA5)

/** \brief  19B8, Message Object  Arbitration Register */
#define CAN_MO77_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00199B8u)

/** Alias (User Manual Name) for CAN_MO77_EDATA6.
* To use register names with standard convension, please use CAN_MO77_EDATA6.
*/
#define	CAN_EMO77DATA6	(CAN_MO77_EDATA6)

/** \brief  19A0, Message Object  Function Control Register */
#define CAN_MO77_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00199A0u)

/** Alias (User Manual Name) for CAN_MO77_FCR.
* To use register names with standard convension, please use CAN_MO77_FCR.
*/
#define	CAN_MOFCR77	(CAN_MO77_FCR)

/** \brief  19A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO77_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00199A4u)

/** Alias (User Manual Name) for CAN_MO77_FGPR.
* To use register names with standard convension, please use CAN_MO77_FGPR.
*/
#define	CAN_MOFGPR77	(CAN_MO77_FGPR)

/** \brief  19A8, Message Object  Interrupt Pointer Register */
#define CAN_MO77_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00199A8u)

/** Alias (User Manual Name) for CAN_MO77_IPR.
* To use register names with standard convension, please use CAN_MO77_IPR.
*/
#define	CAN_MOIPR77	(CAN_MO77_IPR)

/** \brief  19BC, Message Object  Control Register */
#define CAN_MO77_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00199BCu)

/** Alias (User Manual Name) for CAN_MO77_STAT.
* To use register names with standard convension, please use CAN_MO77_STAT.
*/
#define	CAN_MOSTAT77	(CAN_MO77_STAT)

/** \brief  19CC, Message Object  Acceptance Mask Register */
#define CAN_MO78_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00199CCu)

/** Alias (User Manual Name) for CAN_MO78_AMR.
* To use register names with standard convension, please use CAN_MO78_AMR.
*/
#define	CAN_MOAMR78	(CAN_MO78_AMR)

/** \brief  19D8, Message Object  Arbitration Register */
#define CAN_MO78_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00199D8u)

/** Alias (User Manual Name) for CAN_MO78_AR.
* To use register names with standard convension, please use CAN_MO78_AR.
*/
#define	CAN_MOAR78	(CAN_MO78_AR)

/** \brief  19DC, Message Object  Control Register */
#define CAN_MO78_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00199DCu)

/** Alias (User Manual Name) for CAN_MO78_CTR.
* To use register names with standard convension, please use CAN_MO78_CTR.
*/
#define	CAN_MOCTR78	(CAN_MO78_CTR)

/** \brief  19D4, Message Object  Data Register High */
#define CAN_MO78_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00199D4u)

/** Alias (User Manual Name) for CAN_MO78_DATAH.
* To use register names with standard convension, please use CAN_MO78_DATAH.
*/
#define	CAN_MODATAH78	(CAN_MO78_DATAH)

/** \brief  19D0, Message Object  Data Register Low */
#define CAN_MO78_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00199D0u)

/** Alias (User Manual Name) for CAN_MO78_DATAL.
* To use register names with standard convension, please use CAN_MO78_DATAL.
*/
#define	CAN_MODATAL78	(CAN_MO78_DATAL)

/** \brief  19C0, Message Object  Function Control Register */
#define CAN_MO78_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00199C0u)

/** Alias (User Manual Name) for CAN_MO78_EDATA0.
* To use register names with standard convension, please use CAN_MO78_EDATA0.
*/
#define	CAN_EMO78DATA0	(CAN_MO78_EDATA0)

/** \brief  19C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO78_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00199C4u)

/** Alias (User Manual Name) for CAN_MO78_EDATA1.
* To use register names with standard convension, please use CAN_MO78_EDATA1.
*/
#define	CAN_EMO78DATA1	(CAN_MO78_EDATA1)

/** \brief  19C8, Message Object  Interrupt Pointer Register */
#define CAN_MO78_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00199C8u)

/** Alias (User Manual Name) for CAN_MO78_EDATA2.
* To use register names with standard convension, please use CAN_MO78_EDATA2.
*/
#define	CAN_EMO78DATA2	(CAN_MO78_EDATA2)

/** \brief  19CC, Message Object  Acceptance Mask Register */
#define CAN_MO78_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00199CCu)

/** Alias (User Manual Name) for CAN_MO78_EDATA3.
* To use register names with standard convension, please use CAN_MO78_EDATA3.
*/
#define	CAN_EMO78DATA3	(CAN_MO78_EDATA3)

/** \brief  19D0, Message Object  Data Register Low */
#define CAN_MO78_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00199D0u)

/** Alias (User Manual Name) for CAN_MO78_EDATA4.
* To use register names with standard convension, please use CAN_MO78_EDATA4.
*/
#define	CAN_EMO78DATA4	(CAN_MO78_EDATA4)

/** \brief  19D4, Message Object  Data Register High */
#define CAN_MO78_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00199D4u)

/** Alias (User Manual Name) for CAN_MO78_EDATA5.
* To use register names with standard convension, please use CAN_MO78_EDATA5.
*/
#define	CAN_EMO78DATA5	(CAN_MO78_EDATA5)

/** \brief  19D8, Message Object  Arbitration Register */
#define CAN_MO78_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00199D8u)

/** Alias (User Manual Name) for CAN_MO78_EDATA6.
* To use register names with standard convension, please use CAN_MO78_EDATA6.
*/
#define	CAN_EMO78DATA6	(CAN_MO78_EDATA6)

/** \brief  19C0, Message Object  Function Control Register */
#define CAN_MO78_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00199C0u)

/** Alias (User Manual Name) for CAN_MO78_FCR.
* To use register names with standard convension, please use CAN_MO78_FCR.
*/
#define	CAN_MOFCR78	(CAN_MO78_FCR)

/** \brief  19C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO78_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00199C4u)

