leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO7_CTR.
* To use register names with standard convension, please use CAN_MO7_CTR.
*/
#define	CAN_MOCTR7	(CAN_MO7_CTR)

/** \brief  10F4, Message Object  Data Register High */
#define CAN_MO7_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00190F4u)

/** Alias (User Manual Name) for CAN_MO7_DATAH.
* To use register names with standard convension, please use CAN_MO7_DATAH.
*/
#define	CAN_MODATAH7	(CAN_MO7_DATAH)

/** \brief  10F0, Message Object  Data Register Low */
#define CAN_MO7_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00190F0u)

/** Alias (User Manual Name) for CAN_MO7_DATAL.
* To use register names with standard convension, please use CAN_MO7_DATAL.
*/
#define	CAN_MODATAL7	(CAN_MO7_DATAL)

/** \brief  10E0, Message Object  Function Control Register */
#define CAN_MO7_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00190E0u)

/** Alias (User Manual Name) for CAN_MO7_EDATA0.
* To use register names with standard convension, please use CAN_MO7_EDATA0.
*/
#define	CAN_EMO7DATA0	(CAN_MO7_EDATA0)

/** \brief  10E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO7_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00190E4u)

/** Alias (User Manual Name) for CAN_MO7_EDATA1.
* To use register names with standard convension, please use CAN_MO7_EDATA1.
*/
#define	CAN_EMO7DATA1	(CAN_MO7_EDATA1)

/** \brief  10E8, Message Object  Interrupt Pointer Register */
#define CAN_MO7_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00190E8u)

/** Alias (User Manual Name) for CAN_MO7_EDATA2.
* To use register names with standard convension, please use CAN_MO7_EDATA2.
*/
#define	CAN_EMO7DATA2	(CAN_MO7_EDATA2)

/** \brief  10EC, Message Object  Acceptance Mask Register */
#define CAN_MO7_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00190ECu)

/** Alias (User Manual Name) for CAN_MO7_EDATA3.
* To use register names with standard convension, please use CAN_MO7_EDATA3.
*/
#define	CAN_EMO7DATA3	(CAN_MO7_EDATA3)

/** \brief  10F0, Message Object  Data Register Low */
#define CAN_MO7_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00190F0u)

/** Alias (User Manual Name) for CAN_MO7_EDATA4.
* To use register names with standard convension, please use CAN_MO7_EDATA4.
*/
#define	CAN_EMO7DATA4	(CAN_MO7_EDATA4)

/** \brief  10F4, Message Object  Data Register High */
#define CAN_MO7_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00190F4u)

/** Alias (User Manual Name) for CAN_MO7_EDATA5.
* To use register names with standard convension, please use CAN_MO7_EDATA5.
*/
#define	CAN_EMO7DATA5	(CAN_MO7_EDATA5)

/** \brief  10F8, Message Object  Arbitration Register */
#define CAN_MO7_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00190F8u)

/** Alias (User Manual Name) for CAN_MO7_EDATA6.
* To use register names with standard convension, please use CAN_MO7_EDATA6.
*/
#define	CAN_EMO7DATA6	(CAN_MO7_EDATA6)

/** \brief  10E0, Message Object  Function Control Register */
#define CAN_MO7_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00190E0u)

/** Alias (User Manual Name) for CAN_MO7_FCR.
* To use register names with standard convension, please use CAN_MO7_FCR.
*/
#define	CAN_MOFCR7	(CAN_MO7_FCR)

/** \brief  10E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO7_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00190E4u)

/** Alias (User Manual Name) for CAN_MO7_FGPR.
* To use register names with standard convension, please use CAN_MO7_FGPR.
*/
#define	CAN_MOFGPR7	(CAN_MO7_FGPR)

/** \brief  10E8, Message Object  Interrupt Pointer Register */
#define CAN_MO7_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00190E8u)

/** Alias (User Manual Name) for CAN_MO7_IPR.
* To use register names with standard convension, please use CAN_MO7_IPR.
*/
#define	CAN_MOIPR7	(CAN_MO7_IPR)

/** \brief  10FC, Message Object  Control Register */
#define CAN_MO7_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00190FCu)

/** Alias (User Manual Name) for CAN_MO7_STAT.
* To use register names with standard convension, please use CAN_MO7_STAT.
*/
#define	CAN_MOSTAT7	(CAN_MO7_STAT)

/** \brief  1A0C, Message Object  Acceptance Mask Register */
#define CAN_MO80_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019A0Cu)

/** Alias (User Manual Name) for CAN_MO80_AMR.
* To use register names with standard convension, please use CAN_MO80_AMR.
*/
#define	CAN_MOAMR80	(CAN_MO80_AMR)

/** \brief  1A18, Message Object  Arbitration Register */
#define CAN_MO80_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019A18u)

/** Alias (User Manual Name) for CAN_MO80_AR.
* To use register names with standard convension, please use CAN_MO80_AR.
*/
#define	CAN_MOAR80	(CAN_MO80_AR)

/** \brief  1A1C, Message Object  Control Register */
#define CAN_MO80_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019A1Cu)

/** Alias (User Manual Name) for CAN_MO80_CTR.
* To use register names with standard convension, please use CAN_MO80_CTR.
*/
#define	CAN_MOCTR80	(CAN_MO80_CTR)

/** \brief  1A14, Message Object  Data Register High */
#define CAN_MO80_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019A14u)

/** Alias (User Manual Name) for CAN_MO80_DATAH.
* To use register names with standard convension, please use CAN_MO80_DATAH.
*/
#define	CAN_MODATAH80	(CAN_MO80_DATAH)

/** \brief  1A10, Message Object  Data Register Low */
#define CAN_MO80_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019A10u)

/** Alias (User Manual Name) for CAN_MO80_DATAL.
* To use register names with standard convension, please use CAN_MO80_DATAL.
*/
#define	CAN_MODATAL80	(CAN_MO80_DATAL)

/** \brief  1A00, Message Object  Function Control Register */
#define CAN_MO80_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019A00u)

/** Alias (User Manual Name) for CAN_MO80_EDATA0.
* To use register names with standard convension, please use CAN_MO80_EDATA0.
*/
#define	CAN_EMO80DATA0	(CAN_MO80_EDATA0)

/** \brief  1A04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO80_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019A04u)

/** Alias (User Manual Name) for CAN_MO80_EDATA1.
* To use register names with standard convension, please use CAN_MO80_EDATA1.
*/
#define	CAN_EMO80DATA1	(CAN_MO80_EDATA1)

/** \brief  1A08, Message Object  Interrupt Pointer Register */
#define CAN_MO80_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019A08u)

/** Alias (User Manual Name) for CAN_MO80_EDATA2.
* To use register names with standard convension, please use CAN_MO80_EDATA2.
*/
#define	CAN_EMO80DATA2	(CAN_MO80_EDATA2)

/** \brief  1A0C, Message Object  Acceptance Mask Register */
#define CAN_MO80_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019A0Cu)

/** Alias (User Manual Name) for CAN_MO80_EDATA3.
* To use register names with standard convension, please use CAN_MO80_EDATA3.
*/
#define	CAN_EMO80DATA3	(CAN_MO80_EDATA3)

/** \brief  1A10, Message Object  Data Register Low */
#define CAN_MO80_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019A10u)

