leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO80_EDATA4.
* To use register names with standard convension, please use CAN_MO80_EDATA4.
*/
#define	CAN_EMO80DATA4	(CAN_MO80_EDATA4)

/** \brief  1A14, Message Object  Data Register High */
#define CAN_MO80_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019A14u)

/** Alias (User Manual Name) for CAN_MO80_EDATA5.
* To use register names with standard convension, please use CAN_MO80_EDATA5.
*/
#define	CAN_EMO80DATA5	(CAN_MO80_EDATA5)

/** \brief  1A18, Message Object  Arbitration Register */
#define CAN_MO80_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019A18u)

/** Alias (User Manual Name) for CAN_MO80_EDATA6.
* To use register names with standard convension, please use CAN_MO80_EDATA6.
*/
#define	CAN_EMO80DATA6	(CAN_MO80_EDATA6)

/** \brief  1A00, Message Object  Function Control Register */
#define CAN_MO80_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019A00u)

/** Alias (User Manual Name) for CAN_MO80_FCR.
* To use register names with standard convension, please use CAN_MO80_FCR.
*/
#define	CAN_MOFCR80	(CAN_MO80_FCR)

/** \brief  1A04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO80_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019A04u)

/** Alias (User Manual Name) for CAN_MO80_FGPR.
* To use register names with standard convension, please use CAN_MO80_FGPR.
*/
#define	CAN_MOFGPR80	(CAN_MO80_FGPR)

/** \brief  1A08, Message Object  Interrupt Pointer Register */
#define CAN_MO80_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019A08u)

/** Alias (User Manual Name) for CAN_MO80_IPR.
* To use register names with standard convension, please use CAN_MO80_IPR.
*/
#define	CAN_MOIPR80	(CAN_MO80_IPR)

/** \brief  1A1C, Message Object  Control Register */
#define CAN_MO80_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019A1Cu)

/** Alias (User Manual Name) for CAN_MO80_STAT.
* To use register names with standard convension, please use CAN_MO80_STAT.
*/
#define	CAN_MOSTAT80	(CAN_MO80_STAT)

/** \brief  1A2C, Message Object  Acceptance Mask Register */
#define CAN_MO81_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019A2Cu)

/** Alias (User Manual Name) for CAN_MO81_AMR.
* To use register names with standard convension, please use CAN_MO81_AMR.
*/
#define	CAN_MOAMR81	(CAN_MO81_AMR)

/** \brief  1A38, Message Object  Arbitration Register */
#define CAN_MO81_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019A38u)

/** Alias (User Manual Name) for CAN_MO81_AR.
* To use register names with standard convension, please use CAN_MO81_AR.
*/
#define	CAN_MOAR81	(CAN_MO81_AR)

/** \brief  1A3C, Message Object  Control Register */
#define CAN_MO81_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019A3Cu)

/** Alias (User Manual Name) for CAN_MO81_CTR.
* To use register names with standard convension, please use CAN_MO81_CTR.
*/
#define	CAN_MOCTR81	(CAN_MO81_CTR)

/** \brief  1A34, Message Object  Data Register High */
#define CAN_MO81_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019A34u)

/** Alias (User Manual Name) for CAN_MO81_DATAH.
* To use register names with standard convension, please use CAN_MO81_DATAH.
*/
#define	CAN_MODATAH81	(CAN_MO81_DATAH)

/** \brief  1A30, Message Object  Data Register Low */
#define CAN_MO81_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019A30u)

/** Alias (User Manual Name) for CAN_MO81_DATAL.
* To use register names with standard convension, please use CAN_MO81_DATAL.
*/
#define	CAN_MODATAL81	(CAN_MO81_DATAL)

/** \brief  1A20, Message Object  Function Control Register */
#define CAN_MO81_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019A20u)

/** Alias (User Manual Name) for CAN_MO81_EDATA0.
* To use register names with standard convension, please use CAN_MO81_EDATA0.
*/
#define	CAN_EMO81DATA0	(CAN_MO81_EDATA0)

/** \brief  1A24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO81_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019A24u)

/** Alias (User Manual Name) for CAN_MO81_EDATA1.
* To use register names with standard convension, please use CAN_MO81_EDATA1.
*/
#define	CAN_EMO81DATA1	(CAN_MO81_EDATA1)

/** \brief  1A28, Message Object  Interrupt Pointer Register */
#define CAN_MO81_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019A28u)

/** Alias (User Manual Name) for CAN_MO81_EDATA2.
* To use register names with standard convension, please use CAN_MO81_EDATA2.
*/
#define	CAN_EMO81DATA2	(CAN_MO81_EDATA2)

/** \brief  1A2C, Message Object  Acceptance Mask Register */
#define CAN_MO81_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019A2Cu)

/** Alias (User Manual Name) for CAN_MO81_EDATA3.
* To use register names with standard convension, please use CAN_MO81_EDATA3.
*/
#define	CAN_EMO81DATA3	(CAN_MO81_EDATA3)

/** \brief  1A30, Message Object  Data Register Low */
#define CAN_MO81_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019A30u)

/** Alias (User Manual Name) for CAN_MO81_EDATA4.
* To use register names with standard convension, please use CAN_MO81_EDATA4.
*/
#define	CAN_EMO81DATA4	(CAN_MO81_EDATA4)

/** \brief  1A34, Message Object  Data Register High */
#define CAN_MO81_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019A34u)

/** Alias (User Manual Name) for CAN_MO81_EDATA5.
* To use register names with standard convension, please use CAN_MO81_EDATA5.
*/
#define	CAN_EMO81DATA5	(CAN_MO81_EDATA5)

/** \brief  1A38, Message Object  Arbitration Register */
#define CAN_MO81_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019A38u)

/** Alias (User Manual Name) for CAN_MO81_EDATA6.
* To use register names with standard convension, please use CAN_MO81_EDATA6.
*/
#define	CAN_EMO81DATA6	(CAN_MO81_EDATA6)

/** \brief  1A20, Message Object  Function Control Register */
#define CAN_MO81_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019A20u)

/** Alias (User Manual Name) for CAN_MO81_FCR.
* To use register names with standard convension, please use CAN_MO81_FCR.
*/
#define	CAN_MOFCR81	(CAN_MO81_FCR)

