leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1A24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO81_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019A24u)

/** Alias (User Manual Name) for CAN_MO81_FGPR.
* To use register names with standard convension, please use CAN_MO81_FGPR.
*/
#define	CAN_MOFGPR81	(CAN_MO81_FGPR)

/** \brief  1A28, Message Object  Interrupt Pointer Register */
#define CAN_MO81_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019A28u)

/** Alias (User Manual Name) for CAN_MO81_IPR.
* To use register names with standard convension, please use CAN_MO81_IPR.
*/
#define	CAN_MOIPR81	(CAN_MO81_IPR)

/** \brief  1A3C, Message Object  Control Register */
#define CAN_MO81_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019A3Cu)

/** Alias (User Manual Name) for CAN_MO81_STAT.
* To use register names with standard convension, please use CAN_MO81_STAT.
*/
#define	CAN_MOSTAT81	(CAN_MO81_STAT)

/** \brief  1A4C, Message Object  Acceptance Mask Register */
#define CAN_MO82_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019A4Cu)

/** Alias (User Manual Name) for CAN_MO82_AMR.
* To use register names with standard convension, please use CAN_MO82_AMR.
*/
#define	CAN_MOAMR82	(CAN_MO82_AMR)

/** \brief  1A58, Message Object  Arbitration Register */
#define CAN_MO82_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019A58u)

/** Alias (User Manual Name) for CAN_MO82_AR.
* To use register names with standard convension, please use CAN_MO82_AR.
*/
#define	CAN_MOAR82	(CAN_MO82_AR)

/** \brief  1A5C, Message Object  Control Register */
#define CAN_MO82_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019A5Cu)

/** Alias (User Manual Name) for CAN_MO82_CTR.
* To use register names with standard convension, please use CAN_MO82_CTR.
*/
#define	CAN_MOCTR82	(CAN_MO82_CTR)

/** \brief  1A54, Message Object  Data Register High */
#define CAN_MO82_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019A54u)

/** Alias (User Manual Name) for CAN_MO82_DATAH.
* To use register names with standard convension, please use CAN_MO82_DATAH.
*/
#define	CAN_MODATAH82	(CAN_MO82_DATAH)

/** \brief  1A50, Message Object  Data Register Low */
#define CAN_MO82_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019A50u)

/** Alias (User Manual Name) for CAN_MO82_DATAL.
* To use register names with standard convension, please use CAN_MO82_DATAL.
*/
#define	CAN_MODATAL82	(CAN_MO82_DATAL)

/** \brief  1A40, Message Object  Function Control Register */
#define CAN_MO82_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019A40u)

/** Alias (User Manual Name) for CAN_MO82_EDATA0.
* To use register names with standard convension, please use CAN_MO82_EDATA0.
*/
#define	CAN_EMO82DATA0	(CAN_MO82_EDATA0)

/** \brief  1A44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO82_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019A44u)

/** Alias (User Manual Name) for CAN_MO82_EDATA1.
* To use register names with standard convension, please use CAN_MO82_EDATA1.
*/
#define	CAN_EMO82DATA1	(CAN_MO82_EDATA1)

/** \brief  1A48, Message Object  Interrupt Pointer Register */
#define CAN_MO82_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019A48u)

/** Alias (User Manual Name) for CAN_MO82_EDATA2.
* To use register names with standard convension, please use CAN_MO82_EDATA2.
*/
#define	CAN_EMO82DATA2	(CAN_MO82_EDATA2)

/** \brief  1A4C, Message Object  Acceptance Mask Register */
#define CAN_MO82_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019A4Cu)

/** Alias (User Manual Name) for CAN_MO82_EDATA3.
* To use register names with standard convension, please use CAN_MO82_EDATA3.
*/
#define	CAN_EMO82DATA3	(CAN_MO82_EDATA3)

/** \brief  1A50, Message Object  Data Register Low */
#define CAN_MO82_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019A50u)

/** Alias (User Manual Name) for CAN_MO82_EDATA4.
* To use register names with standard convension, please use CAN_MO82_EDATA4.
*/
#define	CAN_EMO82DATA4	(CAN_MO82_EDATA4)

/** \brief  1A54, Message Object  Data Register High */
#define CAN_MO82_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019A54u)

/** Alias (User Manual Name) for CAN_MO82_EDATA5.
* To use register names with standard convension, please use CAN_MO82_EDATA5.
*/
#define	CAN_EMO82DATA5	(CAN_MO82_EDATA5)

/** \brief  1A58, Message Object  Arbitration Register */
#define CAN_MO82_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019A58u)

/** Alias (User Manual Name) for CAN_MO82_EDATA6.
* To use register names with standard convension, please use CAN_MO82_EDATA6.
*/
#define	CAN_EMO82DATA6	(CAN_MO82_EDATA6)

/** \brief  1A40, Message Object  Function Control Register */
#define CAN_MO82_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019A40u)

/** Alias (User Manual Name) for CAN_MO82_FCR.
* To use register names with standard convension, please use CAN_MO82_FCR.
*/
#define	CAN_MOFCR82	(CAN_MO82_FCR)

/** \brief  1A44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO82_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019A44u)

/** Alias (User Manual Name) for CAN_MO82_FGPR.
* To use register names with standard convension, please use CAN_MO82_FGPR.
*/
#define	CAN_MOFGPR82	(CAN_MO82_FGPR)

/** \brief  1A48, Message Object  Interrupt Pointer Register */
#define CAN_MO82_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019A48u)

/** Alias (User Manual Name) for CAN_MO82_IPR.
* To use register names with standard convension, please use CAN_MO82_IPR.
*/
#define	CAN_MOIPR82	(CAN_MO82_IPR)

/** \brief  1A5C, Message Object  Control Register */
#define CAN_MO82_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019A5Cu)

/** Alias (User Manual Name) for CAN_MO82_STAT.
* To use register names with standard convension, please use CAN_MO82_STAT.
*/
#define	CAN_MOSTAT82	(CAN_MO82_STAT)

/** \brief  1A6C, Message Object  Acceptance Mask Register */
#define CAN_MO83_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019A6Cu)

/** Alias (User Manual Name) for CAN_MO83_AMR.
* To use register names with standard convension, please use CAN_MO83_AMR.
*/
#define	CAN_MOAMR83	(CAN_MO83_AMR)

/** \brief  1A78, Message Object  Arbitration Register */
#define CAN_MO83_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019A78u)

/** Alias (User Manual Name) for CAN_MO83_AR.
* To use register names with standard convension, please use CAN_MO83_AR.
*/
#define	CAN_MOAR83	(CAN_MO83_AR)

/** \brief  1A7C, Message Object  Control Register */
#define CAN_MO83_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019A7Cu)

/** Alias (User Manual Name) for CAN_MO83_CTR.
* To use register names with standard convension, please use CAN_MO83_CTR.
*/
#define	CAN_MOCTR83	(CAN_MO83_CTR)

