leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1A90, Message Object  Data Register Low */
#define CAN_MO84_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019A90u)

/** Alias (User Manual Name) for CAN_MO84_EDATA4.
* To use register names with standard convension, please use CAN_MO84_EDATA4.
*/
#define	CAN_EMO84DATA4	(CAN_MO84_EDATA4)

/** \brief  1A94, Message Object  Data Register High */
#define CAN_MO84_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019A94u)

/** Alias (User Manual Name) for CAN_MO84_EDATA5.
* To use register names with standard convension, please use CAN_MO84_EDATA5.
*/
#define	CAN_EMO84DATA5	(CAN_MO84_EDATA5)

/** \brief  1A98, Message Object  Arbitration Register */
#define CAN_MO84_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019A98u)

/** Alias (User Manual Name) for CAN_MO84_EDATA6.
* To use register names with standard convension, please use CAN_MO84_EDATA6.
*/
#define	CAN_EMO84DATA6	(CAN_MO84_EDATA6)

/** \brief  1A80, Message Object  Function Control Register */
#define CAN_MO84_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019A80u)

/** Alias (User Manual Name) for CAN_MO84_FCR.
* To use register names with standard convension, please use CAN_MO84_FCR.
*/
#define	CAN_MOFCR84	(CAN_MO84_FCR)

/** \brief  1A84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO84_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019A84u)

/** Alias (User Manual Name) for CAN_MO84_FGPR.
* To use register names with standard convension, please use CAN_MO84_FGPR.
*/
#define	CAN_MOFGPR84	(CAN_MO84_FGPR)

/** \brief  1A88, Message Object  Interrupt Pointer Register */
#define CAN_MO84_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019A88u)

/** Alias (User Manual Name) for CAN_MO84_IPR.
* To use register names with standard convension, please use CAN_MO84_IPR.
*/
#define	CAN_MOIPR84	(CAN_MO84_IPR)

/** \brief  1A9C, Message Object  Control Register */
#define CAN_MO84_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019A9Cu)

/** Alias (User Manual Name) for CAN_MO84_STAT.
* To use register names with standard convension, please use CAN_MO84_STAT.
*/
#define	CAN_MOSTAT84	(CAN_MO84_STAT)

/** \brief  1AAC, Message Object  Acceptance Mask Register */
#define CAN_MO85_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019AACu)

/** Alias (User Manual Name) for CAN_MO85_AMR.
* To use register names with standard convension, please use CAN_MO85_AMR.
*/
#define	CAN_MOAMR85	(CAN_MO85_AMR)

/** \brief  1AB8, Message Object  Arbitration Register */
#define CAN_MO85_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019AB8u)

/** Alias (User Manual Name) for CAN_MO85_AR.
* To use register names with standard convension, please use CAN_MO85_AR.
*/
#define	CAN_MOAR85	(CAN_MO85_AR)

/** \brief  1ABC, Message Object  Control Register */
#define CAN_MO85_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019ABCu)

/** Alias (User Manual Name) for CAN_MO85_CTR.
* To use register names with standard convension, please use CAN_MO85_CTR.
*/
#define	CAN_MOCTR85	(CAN_MO85_CTR)

/** \brief  1AB4, Message Object  Data Register High */
#define CAN_MO85_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019AB4u)

/** Alias (User Manual Name) for CAN_MO85_DATAH.
* To use register names with standard convension, please use CAN_MO85_DATAH.
*/
#define	CAN_MODATAH85	(CAN_MO85_DATAH)

/** \brief  1AB0, Message Object  Data Register Low */
#define CAN_MO85_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019AB0u)

/** Alias (User Manual Name) for CAN_MO85_DATAL.
* To use register names with standard convension, please use CAN_MO85_DATAL.
*/
#define	CAN_MODATAL85	(CAN_MO85_DATAL)

/** \brief  1AA0, Message Object  Function Control Register */
#define CAN_MO85_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019AA0u)

/** Alias (User Manual Name) for CAN_MO85_EDATA0.
* To use register names with standard convension, please use CAN_MO85_EDATA0.
*/
#define	CAN_EMO85DATA0	(CAN_MO85_EDATA0)

/** \brief  1AA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO85_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019AA4u)

/** Alias (User Manual Name) for CAN_MO85_EDATA1.
* To use register names with standard convension, please use CAN_MO85_EDATA1.
*/
#define	CAN_EMO85DATA1	(CAN_MO85_EDATA1)

/** \brief  1AA8, Message Object  Interrupt Pointer Register */
#define CAN_MO85_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019AA8u)

/** Alias (User Manual Name) for CAN_MO85_EDATA2.
* To use register names with standard convension, please use CAN_MO85_EDATA2.
*/
#define	CAN_EMO85DATA2	(CAN_MO85_EDATA2)

/** \brief  1AAC, Message Object  Acceptance Mask Register */
#define CAN_MO85_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019AACu)

/** Alias (User Manual Name) for CAN_MO85_EDATA3.
* To use register names with standard convension, please use CAN_MO85_EDATA3.
*/
#define	CAN_EMO85DATA3	(CAN_MO85_EDATA3)

/** \brief  1AB0, Message Object  Data Register Low */
#define CAN_MO85_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019AB0u)

/** Alias (User Manual Name) for CAN_MO85_EDATA4.
* To use register names with standard convension, please use CAN_MO85_EDATA4.
*/
#define	CAN_EMO85DATA4	(CAN_MO85_EDATA4)

/** \brief  1AB4, Message Object  Data Register High */
#define CAN_MO85_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019AB4u)

/** Alias (User Manual Name) for CAN_MO85_EDATA5.
* To use register names with standard convension, please use CAN_MO85_EDATA5.
*/
#define	CAN_EMO85DATA5	(CAN_MO85_EDATA5)

/** \brief  1AB8, Message Object  Arbitration Register */
#define CAN_MO85_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019AB8u)

/** Alias (User Manual Name) for CAN_MO85_EDATA6.
* To use register names with standard convension, please use CAN_MO85_EDATA6.
*/
#define	CAN_EMO85DATA6	(CAN_MO85_EDATA6)

/** \brief  1AA0, Message Object  Function Control Register */
#define CAN_MO85_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019AA0u)

/** Alias (User Manual Name) for CAN_MO85_FCR.
* To use register names with standard convension, please use CAN_MO85_FCR.
*/
#define	CAN_MOFCR85	(CAN_MO85_FCR)

