leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO88_EDATA0.
* To use register names with standard convension, please use CAN_MO88_EDATA0.
*/
#define	CAN_EMO88DATA0	(CAN_MO88_EDATA0)

/** \brief  1B04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO88_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019B04u)

/** Alias (User Manual Name) for CAN_MO88_EDATA1.
* To use register names with standard convension, please use CAN_MO88_EDATA1.
*/
#define	CAN_EMO88DATA1	(CAN_MO88_EDATA1)

/** \brief  1B08, Message Object  Interrupt Pointer Register */
#define CAN_MO88_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019B08u)

/** Alias (User Manual Name) for CAN_MO88_EDATA2.
* To use register names with standard convension, please use CAN_MO88_EDATA2.
*/
#define	CAN_EMO88DATA2	(CAN_MO88_EDATA2)

/** \brief  1B0C, Message Object  Acceptance Mask Register */
#define CAN_MO88_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019B0Cu)

/** Alias (User Manual Name) for CAN_MO88_EDATA3.
* To use register names with standard convension, please use CAN_MO88_EDATA3.
*/
#define	CAN_EMO88DATA3	(CAN_MO88_EDATA3)

/** \brief  1B10, Message Object  Data Register Low */
#define CAN_MO88_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019B10u)

/** Alias (User Manual Name) for CAN_MO88_EDATA4.
* To use register names with standard convension, please use CAN_MO88_EDATA4.
*/
#define	CAN_EMO88DATA4	(CAN_MO88_EDATA4)

/** \brief  1B14, Message Object  Data Register High */
#define CAN_MO88_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019B14u)

/** Alias (User Manual Name) for CAN_MO88_EDATA5.
* To use register names with standard convension, please use CAN_MO88_EDATA5.
*/
#define	CAN_EMO88DATA5	(CAN_MO88_EDATA5)

/** \brief  1B18, Message Object  Arbitration Register */
#define CAN_MO88_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019B18u)

/** Alias (User Manual Name) for CAN_MO88_EDATA6.
* To use register names with standard convension, please use CAN_MO88_EDATA6.
*/
#define	CAN_EMO88DATA6	(CAN_MO88_EDATA6)

/** \brief  1B00, Message Object  Function Control Register */
#define CAN_MO88_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019B00u)

/** Alias (User Manual Name) for CAN_MO88_FCR.
* To use register names with standard convension, please use CAN_MO88_FCR.
*/
#define	CAN_MOFCR88	(CAN_MO88_FCR)

/** \brief  1B04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO88_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019B04u)

/** Alias (User Manual Name) for CAN_MO88_FGPR.
* To use register names with standard convension, please use CAN_MO88_FGPR.
*/
#define	CAN_MOFGPR88	(CAN_MO88_FGPR)

/** \brief  1B08, Message Object  Interrupt Pointer Register */
#define CAN_MO88_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019B08u)

/** Alias (User Manual Name) for CAN_MO88_IPR.
* To use register names with standard convension, please use CAN_MO88_IPR.
*/
#define	CAN_MOIPR88	(CAN_MO88_IPR)

/** \brief  1B1C, Message Object  Control Register */
#define CAN_MO88_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019B1Cu)

/** Alias (User Manual Name) for CAN_MO88_STAT.
* To use register names with standard convension, please use CAN_MO88_STAT.
*/
#define	CAN_MOSTAT88	(CAN_MO88_STAT)

/** \brief  1B2C, Message Object  Acceptance Mask Register */
#define CAN_MO89_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019B2Cu)

/** Alias (User Manual Name) for CAN_MO89_AMR.
* To use register names with standard convension, please use CAN_MO89_AMR.
*/
#define	CAN_MOAMR89	(CAN_MO89_AMR)

/** \brief  1B38, Message Object  Arbitration Register */
#define CAN_MO89_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019B38u)

/** Alias (User Manual Name) for CAN_MO89_AR.
* To use register names with standard convension, please use CAN_MO89_AR.
*/
#define	CAN_MOAR89	(CAN_MO89_AR)

/** \brief  1B3C, Message Object  Control Register */
#define CAN_MO89_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019B3Cu)

/** Alias (User Manual Name) for CAN_MO89_CTR.
* To use register names with standard convension, please use CAN_MO89_CTR.
*/
#define	CAN_MOCTR89	(CAN_MO89_CTR)

/** \brief  1B34, Message Object  Data Register High */
#define CAN_MO89_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019B34u)

/** Alias (User Manual Name) for CAN_MO89_DATAH.
* To use register names with standard convension, please use CAN_MO89_DATAH.
*/
#define	CAN_MODATAH89	(CAN_MO89_DATAH)

/** \brief  1B30, Message Object  Data Register Low */
#define CAN_MO89_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019B30u)

/** Alias (User Manual Name) for CAN_MO89_DATAL.
* To use register names with standard convension, please use CAN_MO89_DATAL.
*/
#define	CAN_MODATAL89	(CAN_MO89_DATAL)

/** \brief  1B20, Message Object  Function Control Register */
#define CAN_MO89_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019B20u)

/** Alias (User Manual Name) for CAN_MO89_EDATA0.
* To use register names with standard convension, please use CAN_MO89_EDATA0.
*/
#define	CAN_EMO89DATA0	(CAN_MO89_EDATA0)

/** \brief  1B24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO89_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019B24u)

/** Alias (User Manual Name) for CAN_MO89_EDATA1.
* To use register names with standard convension, please use CAN_MO89_EDATA1.
*/
#define	CAN_EMO89DATA1	(CAN_MO89_EDATA1)

/** \brief  1B28, Message Object  Interrupt Pointer Register */
#define CAN_MO89_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019B28u)

/** Alias (User Manual Name) for CAN_MO89_EDATA2.
* To use register names with standard convension, please use CAN_MO89_EDATA2.
*/
#define	CAN_EMO89DATA2	(CAN_MO89_EDATA2)

/** \brief  1B2C, Message Object  Acceptance Mask Register */
#define CAN_MO89_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019B2Cu)

/** Alias (User Manual Name) for CAN_MO89_EDATA3.
* To use register names with standard convension, please use CAN_MO89_EDATA3.
*/
#define	CAN_EMO89DATA3	(CAN_MO89_EDATA3)

/** \brief  1B30, Message Object  Data Register Low */
#define CAN_MO89_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019B30u)

/** Alias (User Manual Name) for CAN_MO89_EDATA4.
* To use register names with standard convension, please use CAN_MO89_EDATA4.
*/
#define	CAN_EMO89DATA4	(CAN_MO89_EDATA4)

/** \brief  1B34, Message Object  Data Register High */
#define CAN_MO89_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019B34u)

/** Alias (User Manual Name) for CAN_MO89_EDATA5.
* To use register names with standard convension, please use CAN_MO89_EDATA5.
*/
#define	CAN_EMO89DATA5	(CAN_MO89_EDATA5)

/** \brief  1B38, Message Object  Arbitration Register */
#define CAN_MO89_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019B38u)

/** Alias (User Manual Name) for CAN_MO89_EDATA6.
* To use register names with standard convension, please use CAN_MO89_EDATA6.
*/
#define	CAN_EMO89DATA6	(CAN_MO89_EDATA6)

/** \brief  1B20, Message Object  Function Control Register */
#define CAN_MO89_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019B20u)

