leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO90_AR.
* To use register names with standard convension, please use CAN_MO90_AR.
*/
#define	CAN_MOAR90	(CAN_MO90_AR)

/** \brief  1B5C, Message Object  Control Register */
#define CAN_MO90_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019B5Cu)

/** Alias (User Manual Name) for CAN_MO90_CTR.
* To use register names with standard convension, please use CAN_MO90_CTR.
*/
#define	CAN_MOCTR90	(CAN_MO90_CTR)

/** \brief  1B54, Message Object  Data Register High */
#define CAN_MO90_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019B54u)

/** Alias (User Manual Name) for CAN_MO90_DATAH.
* To use register names with standard convension, please use CAN_MO90_DATAH.
*/
#define	CAN_MODATAH90	(CAN_MO90_DATAH)

/** \brief  1B50, Message Object  Data Register Low */
#define CAN_MO90_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019B50u)

/** Alias (User Manual Name) for CAN_MO90_DATAL.
* To use register names with standard convension, please use CAN_MO90_DATAL.
*/
#define	CAN_MODATAL90	(CAN_MO90_DATAL)

/** \brief  1B40, Message Object  Function Control Register */
#define CAN_MO90_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019B40u)

/** Alias (User Manual Name) for CAN_MO90_EDATA0.
* To use register names with standard convension, please use CAN_MO90_EDATA0.
*/
#define	CAN_EMO90DATA0	(CAN_MO90_EDATA0)

/** \brief  1B44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO90_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019B44u)

/** Alias (User Manual Name) for CAN_MO90_EDATA1.
* To use register names with standard convension, please use CAN_MO90_EDATA1.
*/
#define	CAN_EMO90DATA1	(CAN_MO90_EDATA1)

/** \brief  1B48, Message Object  Interrupt Pointer Register */
#define CAN_MO90_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019B48u)

/** Alias (User Manual Name) for CAN_MO90_EDATA2.
* To use register names with standard convension, please use CAN_MO90_EDATA2.
*/
#define	CAN_EMO90DATA2	(CAN_MO90_EDATA2)

/** \brief  1B4C, Message Object  Acceptance Mask Register */
#define CAN_MO90_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019B4Cu)

/** Alias (User Manual Name) for CAN_MO90_EDATA3.
* To use register names with standard convension, please use CAN_MO90_EDATA3.
*/
#define	CAN_EMO90DATA3	(CAN_MO90_EDATA3)

/** \brief  1B50, Message Object  Data Register Low */
#define CAN_MO90_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019B50u)

/** Alias (User Manual Name) for CAN_MO90_EDATA4.
* To use register names with standard convension, please use CAN_MO90_EDATA4.
*/
#define	CAN_EMO90DATA4	(CAN_MO90_EDATA4)

/** \brief  1B54, Message Object  Data Register High */
#define CAN_MO90_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019B54u)

/** Alias (User Manual Name) for CAN_MO90_EDATA5.
* To use register names with standard convension, please use CAN_MO90_EDATA5.
*/
#define	CAN_EMO90DATA5	(CAN_MO90_EDATA5)

/** \brief  1B58, Message Object  Arbitration Register */
#define CAN_MO90_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019B58u)

/** Alias (User Manual Name) for CAN_MO90_EDATA6.
* To use register names with standard convension, please use CAN_MO90_EDATA6.
*/
#define	CAN_EMO90DATA6	(CAN_MO90_EDATA6)

/** \brief  1B40, Message Object  Function Control Register */
#define CAN_MO90_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019B40u)

/** Alias (User Manual Name) for CAN_MO90_FCR.
* To use register names with standard convension, please use CAN_MO90_FCR.
*/
#define	CAN_MOFCR90	(CAN_MO90_FCR)

/** \brief  1B44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO90_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019B44u)

/** Alias (User Manual Name) for CAN_MO90_FGPR.
* To use register names with standard convension, please use CAN_MO90_FGPR.
*/
#define	CAN_MOFGPR90	(CAN_MO90_FGPR)

/** \brief  1B48, Message Object  Interrupt Pointer Register */
#define CAN_MO90_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019B48u)

/** Alias (User Manual Name) for CAN_MO90_IPR.
* To use register names with standard convension, please use CAN_MO90_IPR.
*/
#define	CAN_MOIPR90	(CAN_MO90_IPR)

/** \brief  1B5C, Message Object  Control Register */
#define CAN_MO90_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019B5Cu)

/** Alias (User Manual Name) for CAN_MO90_STAT.
* To use register names with standard convension, please use CAN_MO90_STAT.
*/
#define	CAN_MOSTAT90	(CAN_MO90_STAT)

/** \brief  1B6C, Message Object  Acceptance Mask Register */
#define CAN_MO91_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019B6Cu)

/** Alias (User Manual Name) for CAN_MO91_AMR.
* To use register names with standard convension, please use CAN_MO91_AMR.
*/
#define	CAN_MOAMR91	(CAN_MO91_AMR)

/** \brief  1B78, Message Object  Arbitration Register */
#define CAN_MO91_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019B78u)

/** Alias (User Manual Name) for CAN_MO91_AR.
* To use register names with standard convension, please use CAN_MO91_AR.
*/
#define	CAN_MOAR91	(CAN_MO91_AR)

/** \brief  1B7C, Message Object  Control Register */
#define CAN_MO91_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019B7Cu)

/** Alias (User Manual Name) for CAN_MO91_CTR.
* To use register names with standard convension, please use CAN_MO91_CTR.
*/
#define	CAN_MOCTR91	(CAN_MO91_CTR)

/** \brief  1B74, Message Object  Data Register High */
#define CAN_MO91_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019B74u)

/** Alias (User Manual Name) for CAN_MO91_DATAH.
* To use register names with standard convension, please use CAN_MO91_DATAH.
*/
#define	CAN_MODATAH91	(CAN_MO91_DATAH)

/** \brief  1B70, Message Object  Data Register Low */
#define CAN_MO91_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019B70u)

/** Alias (User Manual Name) for CAN_MO91_DATAL.
* To use register names with standard convension, please use CAN_MO91_DATAL.
*/
#define	CAN_MODATAL91	(CAN_MO91_DATAL)

/** \brief  1B60, Message Object  Function Control Register */
#define CAN_MO91_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019B60u)

/** Alias (User Manual Name) for CAN_MO91_EDATA0.
* To use register names with standard convension, please use CAN_MO91_EDATA0.
*/
#define	CAN_EMO91DATA0	(CAN_MO91_EDATA0)

/** \brief  1B64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO91_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019B64u)

