leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO91_EDATA1.
* To use register names with standard convension, please use CAN_MO91_EDATA1.
*/
#define	CAN_EMO91DATA1	(CAN_MO91_EDATA1)

/** \brief  1B68, Message Object  Interrupt Pointer Register */
#define CAN_MO91_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019B68u)

/** Alias (User Manual Name) for CAN_MO91_EDATA2.
* To use register names with standard convension, please use CAN_MO91_EDATA2.
*/
#define	CAN_EMO91DATA2	(CAN_MO91_EDATA2)

/** \brief  1B6C, Message Object  Acceptance Mask Register */
#define CAN_MO91_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019B6Cu)

/** Alias (User Manual Name) for CAN_MO91_EDATA3.
* To use register names with standard convension, please use CAN_MO91_EDATA3.
*/
#define	CAN_EMO91DATA3	(CAN_MO91_EDATA3)

/** \brief  1B70, Message Object  Data Register Low */
#define CAN_MO91_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019B70u)

/** Alias (User Manual Name) for CAN_MO91_EDATA4.
* To use register names with standard convension, please use CAN_MO91_EDATA4.
*/
#define	CAN_EMO91DATA4	(CAN_MO91_EDATA4)

/** \brief  1B74, Message Object  Data Register High */
#define CAN_MO91_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019B74u)

/** Alias (User Manual Name) for CAN_MO91_EDATA5.
* To use register names with standard convension, please use CAN_MO91_EDATA5.
*/
#define	CAN_EMO91DATA5	(CAN_MO91_EDATA5)

/** \brief  1B78, Message Object  Arbitration Register */
#define CAN_MO91_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019B78u)

/** Alias (User Manual Name) for CAN_MO91_EDATA6.
* To use register names with standard convension, please use CAN_MO91_EDATA6.
*/
#define	CAN_EMO91DATA6	(CAN_MO91_EDATA6)

/** \brief  1B60, Message Object  Function Control Register */
#define CAN_MO91_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019B60u)

/** Alias (User Manual Name) for CAN_MO91_FCR.
* To use register names with standard convension, please use CAN_MO91_FCR.
*/
#define	CAN_MOFCR91	(CAN_MO91_FCR)

/** \brief  1B64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO91_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019B64u)

/** Alias (User Manual Name) for CAN_MO91_FGPR.
* To use register names with standard convension, please use CAN_MO91_FGPR.
*/
#define	CAN_MOFGPR91	(CAN_MO91_FGPR)

/** \brief  1B68, Message Object  Interrupt Pointer Register */
#define CAN_MO91_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019B68u)

/** Alias (User Manual Name) for CAN_MO91_IPR.
* To use register names with standard convension, please use CAN_MO91_IPR.
*/
#define	CAN_MOIPR91	(CAN_MO91_IPR)

/** \brief  1B7C, Message Object  Control Register */
#define CAN_MO91_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019B7Cu)

/** Alias (User Manual Name) for CAN_MO91_STAT.
* To use register names with standard convension, please use CAN_MO91_STAT.
*/
#define	CAN_MOSTAT91	(CAN_MO91_STAT)

/** \brief  1B8C, Message Object  Acceptance Mask Register */
#define CAN_MO92_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019B8Cu)

/** Alias (User Manual Name) for CAN_MO92_AMR.
* To use register names with standard convension, please use CAN_MO92_AMR.
*/
#define	CAN_MOAMR92	(CAN_MO92_AMR)

/** \brief  1B98, Message Object  Arbitration Register */
#define CAN_MO92_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019B98u)

/** Alias (User Manual Name) for CAN_MO92_AR.
* To use register names with standard convension, please use CAN_MO92_AR.
*/
#define	CAN_MOAR92	(CAN_MO92_AR)

/** \brief  1B9C, Message Object  Control Register */
#define CAN_MO92_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019B9Cu)

/** Alias (User Manual Name) for CAN_MO92_CTR.
* To use register names with standard convension, please use CAN_MO92_CTR.
*/
#define	CAN_MOCTR92	(CAN_MO92_CTR)

/** \brief  1B94, Message Object  Data Register High */
#define CAN_MO92_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019B94u)

/** Alias (User Manual Name) for CAN_MO92_DATAH.
* To use register names with standard convension, please use CAN_MO92_DATAH.
*/
#define	CAN_MODATAH92	(CAN_MO92_DATAH)

/** \brief  1B90, Message Object  Data Register Low */
#define CAN_MO92_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019B90u)

/** Alias (User Manual Name) for CAN_MO92_DATAL.
* To use register names with standard convension, please use CAN_MO92_DATAL.
*/
#define	CAN_MODATAL92	(CAN_MO92_DATAL)

/** \brief  1B80, Message Object  Function Control Register */
#define CAN_MO92_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019B80u)

/** Alias (User Manual Name) for CAN_MO92_EDATA0.
* To use register names with standard convension, please use CAN_MO92_EDATA0.
*/
#define	CAN_EMO92DATA0	(CAN_MO92_EDATA0)

/** \brief  1B84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO92_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019B84u)

/** Alias (User Manual Name) for CAN_MO92_EDATA1.
* To use register names with standard convension, please use CAN_MO92_EDATA1.
*/
#define	CAN_EMO92DATA1	(CAN_MO92_EDATA1)

/** \brief  1B88, Message Object  Interrupt Pointer Register */
#define CAN_MO92_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019B88u)

/** Alias (User Manual Name) for CAN_MO92_EDATA2.
* To use register names with standard convension, please use CAN_MO92_EDATA2.
*/
#define	CAN_EMO92DATA2	(CAN_MO92_EDATA2)

/** \brief  1B8C, Message Object  Acceptance Mask Register */
#define CAN_MO92_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019B8Cu)

/** Alias (User Manual Name) for CAN_MO92_EDATA3.
* To use register names with standard convension, please use CAN_MO92_EDATA3.
*/
#define	CAN_EMO92DATA3	(CAN_MO92_EDATA3)

/** \brief  1B90, Message Object  Data Register Low */
#define CAN_MO92_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019B90u)

/** Alias (User Manual Name) for CAN_MO92_EDATA4.
* To use register names with standard convension, please use CAN_MO92_EDATA4.
*/
#define	CAN_EMO92DATA4	(CAN_MO92_EDATA4)

/** \brief  1B94, Message Object  Data Register High */
#define CAN_MO92_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019B94u)

/** Alias (User Manual Name) for CAN_MO92_EDATA5.
* To use register names with standard convension, please use CAN_MO92_EDATA5.
*/
#define	CAN_EMO92DATA5	(CAN_MO92_EDATA5)

/** \brief  1B98, Message Object  Arbitration Register */
#define CAN_MO92_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019B98u)

/** Alias (User Manual Name) for CAN_MO92_EDATA6.
* To use register names with standard convension, please use CAN_MO92_EDATA6.
*/
#define	CAN_EMO92DATA6	(CAN_MO92_EDATA6)

/** \brief  1B80, Message Object  Function Control Register */
#define CAN_MO92_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019B80u)

/** Alias (User Manual Name) for CAN_MO92_FCR.
* To use register names with standard convension, please use CAN_MO92_FCR.
*/
#define	CAN_MOFCR92	(CAN_MO92_FCR)

/** \brief  1B84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO92_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019B84u)

