leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO92_FGPR.
* To use register names with standard convension, please use CAN_MO92_FGPR.
*/
#define	CAN_MOFGPR92	(CAN_MO92_FGPR)

/** \brief  1B88, Message Object  Interrupt Pointer Register */
#define CAN_MO92_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019B88u)

/** Alias (User Manual Name) for CAN_MO92_IPR.
* To use register names with standard convension, please use CAN_MO92_IPR.
*/
#define	CAN_MOIPR92	(CAN_MO92_IPR)

/** \brief  1B9C, Message Object  Control Register */
#define CAN_MO92_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019B9Cu)

/** Alias (User Manual Name) for CAN_MO92_STAT.
* To use register names with standard convension, please use CAN_MO92_STAT.
*/
#define	CAN_MOSTAT92	(CAN_MO92_STAT)

/** \brief  1BAC, Message Object  Acceptance Mask Register */
#define CAN_MO93_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019BACu)

/** Alias (User Manual Name) for CAN_MO93_AMR.
* To use register names with standard convension, please use CAN_MO93_AMR.
*/
#define	CAN_MOAMR93	(CAN_MO93_AMR)

/** \brief  1BB8, Message Object  Arbitration Register */
#define CAN_MO93_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019BB8u)

/** Alias (User Manual Name) for CAN_MO93_AR.
* To use register names with standard convension, please use CAN_MO93_AR.
*/
#define	CAN_MOAR93	(CAN_MO93_AR)

/** \brief  1BBC, Message Object  Control Register */
#define CAN_MO93_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019BBCu)

/** Alias (User Manual Name) for CAN_MO93_CTR.
* To use register names with standard convension, please use CAN_MO93_CTR.
*/
#define	CAN_MOCTR93	(CAN_MO93_CTR)

/** \brief  1BB4, Message Object  Data Register High */
#define CAN_MO93_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019BB4u)

/** Alias (User Manual Name) for CAN_MO93_DATAH.
* To use register names with standard convension, please use CAN_MO93_DATAH.
*/
#define	CAN_MODATAH93	(CAN_MO93_DATAH)

/** \brief  1BB0, Message Object  Data Register Low */
#define CAN_MO93_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019BB0u)

/** Alias (User Manual Name) for CAN_MO93_DATAL.
* To use register names with standard convension, please use CAN_MO93_DATAL.
*/
#define	CAN_MODATAL93	(CAN_MO93_DATAL)

/** \brief  1BA0, Message Object  Function Control Register */
#define CAN_MO93_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019BA0u)

/** Alias (User Manual Name) for CAN_MO93_EDATA0.
* To use register names with standard convension, please use CAN_MO93_EDATA0.
*/
#define	CAN_EMO93DATA0	(CAN_MO93_EDATA0)

/** \brief  1BA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO93_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019BA4u)

/** Alias (User Manual Name) for CAN_MO93_EDATA1.
* To use register names with standard convension, please use CAN_MO93_EDATA1.
*/
#define	CAN_EMO93DATA1	(CAN_MO93_EDATA1)

/** \brief  1BA8, Message Object  Interrupt Pointer Register */
#define CAN_MO93_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019BA8u)

/** Alias (User Manual Name) for CAN_MO93_EDATA2.
* To use register names with standard convension, please use CAN_MO93_EDATA2.
*/
#define	CAN_EMO93DATA2	(CAN_MO93_EDATA2)

/** \brief  1BAC, Message Object  Acceptance Mask Register */
#define CAN_MO93_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019BACu)

/** Alias (User Manual Name) for CAN_MO93_EDATA3.
* To use register names with standard convension, please use CAN_MO93_EDATA3.
*/
#define	CAN_EMO93DATA3	(CAN_MO93_EDATA3)

/** \brief  1BB0, Message Object  Data Register Low */
#define CAN_MO93_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019BB0u)

/** Alias (User Manual Name) for CAN_MO93_EDATA4.
* To use register names with standard convension, please use CAN_MO93_EDATA4.
*/
#define	CAN_EMO93DATA4	(CAN_MO93_EDATA4)

/** \brief  1BB4, Message Object  Data Register High */
#define CAN_MO93_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019BB4u)

/** Alias (User Manual Name) for CAN_MO93_EDATA5.
* To use register names with standard convension, please use CAN_MO93_EDATA5.
*/
#define	CAN_EMO93DATA5	(CAN_MO93_EDATA5)

/** \brief  1BB8, Message Object  Arbitration Register */
#define CAN_MO93_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019BB8u)

/** Alias (User Manual Name) for CAN_MO93_EDATA6.
* To use register names with standard convension, please use CAN_MO93_EDATA6.
*/
#define	CAN_EMO93DATA6	(CAN_MO93_EDATA6)

/** \brief  1BA0, Message Object  Function Control Register */
#define CAN_MO93_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019BA0u)

/** Alias (User Manual Name) for CAN_MO93_FCR.
* To use register names with standard convension, please use CAN_MO93_FCR.
*/
#define	CAN_MOFCR93	(CAN_MO93_FCR)

/** \brief  1BA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO93_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019BA4u)

/** Alias (User Manual Name) for CAN_MO93_FGPR.
* To use register names with standard convension, please use CAN_MO93_FGPR.
*/
#define	CAN_MOFGPR93	(CAN_MO93_FGPR)

/** \brief  1BA8, Message Object  Interrupt Pointer Register */
#define CAN_MO93_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019BA8u)

/** Alias (User Manual Name) for CAN_MO93_IPR.
* To use register names with standard convension, please use CAN_MO93_IPR.
*/
#define	CAN_MOIPR93	(CAN_MO93_IPR)

/** \brief  1BBC, Message Object  Control Register */
#define CAN_MO93_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019BBCu)

/** Alias (User Manual Name) for CAN_MO93_STAT.
* To use register names with standard convension, please use CAN_MO93_STAT.
*/
#define	CAN_MOSTAT93	(CAN_MO93_STAT)

/** \brief  1BCC, Message Object  Acceptance Mask Register */
#define CAN_MO94_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019BCCu)

/** Alias (User Manual Name) for CAN_MO94_AMR.
* To use register names with standard convension, please use CAN_MO94_AMR.
*/
#define	CAN_MOAMR94	(CAN_MO94_AMR)

/** \brief  1BD8, Message Object  Arbitration Register */
#define CAN_MO94_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019BD8u)

