leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO95_EDATA1.
* To use register names with standard convension, please use CAN_MO95_EDATA1.
*/
#define	CAN_EMO95DATA1	(CAN_MO95_EDATA1)

/** \brief  1BE8, Message Object  Interrupt Pointer Register */
#define CAN_MO95_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019BE8u)

/** Alias (User Manual Name) for CAN_MO95_EDATA2.
* To use register names with standard convension, please use CAN_MO95_EDATA2.
*/
#define	CAN_EMO95DATA2	(CAN_MO95_EDATA2)

/** \brief  1BEC, Message Object  Acceptance Mask Register */
#define CAN_MO95_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019BECu)

/** Alias (User Manual Name) for CAN_MO95_EDATA3.
* To use register names with standard convension, please use CAN_MO95_EDATA3.
*/
#define	CAN_EMO95DATA3	(CAN_MO95_EDATA3)

/** \brief  1BF0, Message Object  Data Register Low */
#define CAN_MO95_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019BF0u)

/** Alias (User Manual Name) for CAN_MO95_EDATA4.
* To use register names with standard convension, please use CAN_MO95_EDATA4.
*/
#define	CAN_EMO95DATA4	(CAN_MO95_EDATA4)

/** \brief  1BF4, Message Object  Data Register High */
#define CAN_MO95_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019BF4u)

/** Alias (User Manual Name) for CAN_MO95_EDATA5.
* To use register names with standard convension, please use CAN_MO95_EDATA5.
*/
#define	CAN_EMO95DATA5	(CAN_MO95_EDATA5)

/** \brief  1BF8, Message Object  Arbitration Register */
#define CAN_MO95_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019BF8u)

/** Alias (User Manual Name) for CAN_MO95_EDATA6.
* To use register names with standard convension, please use CAN_MO95_EDATA6.
*/
#define	CAN_EMO95DATA6	(CAN_MO95_EDATA6)

/** \brief  1BE0, Message Object  Function Control Register */
#define CAN_MO95_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019BE0u)

/** Alias (User Manual Name) for CAN_MO95_FCR.
* To use register names with standard convension, please use CAN_MO95_FCR.
*/
#define	CAN_MOFCR95	(CAN_MO95_FCR)

/** \brief  1BE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO95_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019BE4u)

/** Alias (User Manual Name) for CAN_MO95_FGPR.
* To use register names with standard convension, please use CAN_MO95_FGPR.
*/
#define	CAN_MOFGPR95	(CAN_MO95_FGPR)

/** \brief  1BE8, Message Object  Interrupt Pointer Register */
#define CAN_MO95_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019BE8u)

/** Alias (User Manual Name) for CAN_MO95_IPR.
* To use register names with standard convension, please use CAN_MO95_IPR.
*/
#define	CAN_MOIPR95	(CAN_MO95_IPR)

/** \brief  1BFC, Message Object  Control Register */
#define CAN_MO95_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019BFCu)

/** Alias (User Manual Name) for CAN_MO95_STAT.
* To use register names with standard convension, please use CAN_MO95_STAT.
*/
#define	CAN_MOSTAT95	(CAN_MO95_STAT)

/** \brief  1C0C, Message Object  Acceptance Mask Register */
#define CAN_MO96_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019C0Cu)

/** Alias (User Manual Name) for CAN_MO96_AMR.
* To use register names with standard convension, please use CAN_MO96_AMR.
*/
#define	CAN_MOAMR96	(CAN_MO96_AMR)

/** \brief  1C18, Message Object  Arbitration Register */
#define CAN_MO96_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019C18u)

/** Alias (User Manual Name) for CAN_MO96_AR.
* To use register names with standard convension, please use CAN_MO96_AR.
*/
#define	CAN_MOAR96	(CAN_MO96_AR)

/** \brief  1C1C, Message Object  Control Register */
#define CAN_MO96_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019C1Cu)

/** Alias (User Manual Name) for CAN_MO96_CTR.
* To use register names with standard convension, please use CAN_MO96_CTR.
*/
#define	CAN_MOCTR96	(CAN_MO96_CTR)

/** \brief  1C14, Message Object  Data Register High */
#define CAN_MO96_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019C14u)

/** Alias (User Manual Name) for CAN_MO96_DATAH.
* To use register names with standard convension, please use CAN_MO96_DATAH.
*/
#define	CAN_MODATAH96	(CAN_MO96_DATAH)

/** \brief  1C10, Message Object  Data Register Low */
#define CAN_MO96_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019C10u)

/** Alias (User Manual Name) for CAN_MO96_DATAL.
* To use register names with standard convension, please use CAN_MO96_DATAL.
*/
#define	CAN_MODATAL96	(CAN_MO96_DATAL)

/** \brief  1C00, Message Object  Function Control Register */
#define CAN_MO96_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019C00u)

/** Alias (User Manual Name) for CAN_MO96_EDATA0.
* To use register names with standard convension, please use CAN_MO96_EDATA0.
*/
#define	CAN_EMO96DATA0	(CAN_MO96_EDATA0)

/** \brief  1C04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO96_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019C04u)

/** Alias (User Manual Name) for CAN_MO96_EDATA1.
* To use register names with standard convension, please use CAN_MO96_EDATA1.
*/
#define	CAN_EMO96DATA1	(CAN_MO96_EDATA1)

/** \brief  1C08, Message Object  Interrupt Pointer Register */
#define CAN_MO96_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019C08u)

/** Alias (User Manual Name) for CAN_MO96_EDATA2.
* To use register names with standard convension, please use CAN_MO96_EDATA2.
*/
#define	CAN_EMO96DATA2	(CAN_MO96_EDATA2)

/** \brief  1C0C, Message Object  Acceptance Mask Register */
#define CAN_MO96_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019C0Cu)

/** Alias (User Manual Name) for CAN_MO96_EDATA3.
* To use register names with standard convension, please use CAN_MO96_EDATA3.
*/
#define	CAN_EMO96DATA3	(CAN_MO96_EDATA3)

/** \brief  1C10, Message Object  Data Register Low */
#define CAN_MO96_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019C10u)

/** Alias (User Manual Name) for CAN_MO96_EDATA4.
* To use register names with standard convension, please use CAN_MO96_EDATA4.
*/
#define	CAN_EMO96DATA4	(CAN_MO96_EDATA4)

