leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1C68, Message Object  Interrupt Pointer Register */
#define CAN_MO99_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019C68u)

/** Alias (User Manual Name) for CAN_MO99_EDATA2.
* To use register names with standard convension, please use CAN_MO99_EDATA2.
*/
#define	CAN_EMO99DATA2	(CAN_MO99_EDATA2)

/** \brief  1C6C, Message Object  Acceptance Mask Register */
#define CAN_MO99_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019C6Cu)

/** Alias (User Manual Name) for CAN_MO99_EDATA3.
* To use register names with standard convension, please use CAN_MO99_EDATA3.
*/
#define	CAN_EMO99DATA3	(CAN_MO99_EDATA3)

/** \brief  1C70, Message Object  Data Register Low */
#define CAN_MO99_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019C70u)

/** Alias (User Manual Name) for CAN_MO99_EDATA4.
* To use register names with standard convension, please use CAN_MO99_EDATA4.
*/
#define	CAN_EMO99DATA4	(CAN_MO99_EDATA4)

/** \brief  1C74, Message Object  Data Register High */
#define CAN_MO99_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019C74u)

/** Alias (User Manual Name) for CAN_MO99_EDATA5.
* To use register names with standard convension, please use CAN_MO99_EDATA5.
*/
#define	CAN_EMO99DATA5	(CAN_MO99_EDATA5)

/** \brief  1C78, Message Object  Arbitration Register */
#define CAN_MO99_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019C78u)

/** Alias (User Manual Name) for CAN_MO99_EDATA6.
* To use register names with standard convension, please use CAN_MO99_EDATA6.
*/
#define	CAN_EMO99DATA6	(CAN_MO99_EDATA6)

/** \brief  1C60, Message Object  Function Control Register */
#define CAN_MO99_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019C60u)

/** Alias (User Manual Name) for CAN_MO99_FCR.
* To use register names with standard convension, please use CAN_MO99_FCR.
*/
#define	CAN_MOFCR99	(CAN_MO99_FCR)

/** \brief  1C64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO99_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019C64u)

/** Alias (User Manual Name) for CAN_MO99_FGPR.
* To use register names with standard convension, please use CAN_MO99_FGPR.
*/
#define	CAN_MOFGPR99	(CAN_MO99_FGPR)

/** \brief  1C68, Message Object  Interrupt Pointer Register */
#define CAN_MO99_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019C68u)

/** Alias (User Manual Name) for CAN_MO99_IPR.
* To use register names with standard convension, please use CAN_MO99_IPR.
*/
#define	CAN_MOIPR99	(CAN_MO99_IPR)

/** \brief  1C7C, Message Object  Control Register */
#define CAN_MO99_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019C7Cu)

/** Alias (User Manual Name) for CAN_MO99_STAT.
* To use register names with standard convension, please use CAN_MO99_STAT.
*/
#define	CAN_MOSTAT99	(CAN_MO99_STAT)

/** \brief  112C, Message Object  Acceptance Mask Register */
#define CAN_MO9_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001912Cu)

/** Alias (User Manual Name) for CAN_MO9_AMR.
* To use register names with standard convension, please use CAN_MO9_AMR.
*/
#define	CAN_MOAMR9	(CAN_MO9_AMR)

/** \brief  1138, Message Object  Arbitration Register */
#define CAN_MO9_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019138u)

/** Alias (User Manual Name) for CAN_MO9_AR.
* To use register names with standard convension, please use CAN_MO9_AR.
*/
#define	CAN_MOAR9	(CAN_MO9_AR)

/** \brief  113C, Message Object  Control Register */
#define CAN_MO9_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001913Cu)

/** Alias (User Manual Name) for CAN_MO9_CTR.
* To use register names with standard convension, please use CAN_MO9_CTR.
*/
#define	CAN_MOCTR9	(CAN_MO9_CTR)

/** \brief  1134, Message Object  Data Register High */
#define CAN_MO9_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019134u)

/** Alias (User Manual Name) for CAN_MO9_DATAH.
* To use register names with standard convension, please use CAN_MO9_DATAH.
*/
#define	CAN_MODATAH9	(CAN_MO9_DATAH)

/** \brief  1130, Message Object  Data Register Low */
#define CAN_MO9_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019130u)

/** Alias (User Manual Name) for CAN_MO9_DATAL.
* To use register names with standard convension, please use CAN_MO9_DATAL.
*/
#define	CAN_MODATAL9	(CAN_MO9_DATAL)

/** \brief  1120, Message Object  Function Control Register */
#define CAN_MO9_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019120u)

/** Alias (User Manual Name) for CAN_MO9_EDATA0.
* To use register names with standard convension, please use CAN_MO9_EDATA0.
*/
#define	CAN_EMO9DATA0	(CAN_MO9_EDATA0)

/** \brief  1124, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO9_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019124u)

/** Alias (User Manual Name) for CAN_MO9_EDATA1.
* To use register names with standard convension, please use CAN_MO9_EDATA1.
*/
#define	CAN_EMO9DATA1	(CAN_MO9_EDATA1)

/** \brief  1128, Message Object  Interrupt Pointer Register */
#define CAN_MO9_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019128u)

/** Alias (User Manual Name) for CAN_MO9_EDATA2.
* To use register names with standard convension, please use CAN_MO9_EDATA2.
*/
#define	CAN_EMO9DATA2	(CAN_MO9_EDATA2)

/** \brief  112C, Message Object  Acceptance Mask Register */
#define CAN_MO9_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001912Cu)

/** Alias (User Manual Name) for CAN_MO9_EDATA3.
* To use register names with standard convension, please use CAN_MO9_EDATA3.
*/
#define	CAN_EMO9DATA3	(CAN_MO9_EDATA3)

/** \brief  1130, Message Object  Data Register Low */
#define CAN_MO9_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019130u)

/** Alias (User Manual Name) for CAN_MO9_EDATA4.
* To use register names with standard convension, please use CAN_MO9_EDATA4.
*/
#define	CAN_EMO9DATA4	(CAN_MO9_EDATA4)

/** \brief  1134, Message Object  Data Register High */
#define CAN_MO9_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019134u)

/** Alias (User Manual Name) for CAN_MO9_EDATA5.
* To use register names with standard convension, please use CAN_MO9_EDATA5.
*/
#define	CAN_EMO9DATA5	(CAN_MO9_EDATA5)

/** \brief  1138, Message Object  Arbitration Register */
#define CAN_MO9_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019138u)

/** Alias (User Manual Name) for CAN_MO9_EDATA6.
* To use register names with standard convension, please use CAN_MO9_EDATA6.
*/
#define	CAN_EMO9DATA6	(CAN_MO9_EDATA6)

/** \brief  1120, Message Object  Function Control Register */
#define CAN_MO9_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019120u)

/** Alias (User Manual Name) for CAN_MO9_FCR.
* To use register names with standard convension, please use CAN_MO9_FCR.
*/
#define	CAN_MOFCR9	(CAN_MO9_FCR)

/** \brief  1124, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO9_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019124u)

