leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  114, List Register */
#define CAN1_LIST5 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028114u)

/** \brief  118, List Register */
#define CAN1_LIST6 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028118u)

/** \brief  11C, List Register */
#define CAN1_LIST7 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF002811Cu)

/** \brief  120, List Register */
#define CAN1_LIST8 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028120u)

/** \brief  124, List Register */
#define CAN1_LIST9 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028124u)

/** \brief  1C8, Module Control Register */
#define CAN1_MCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MCR*)0xF00281C8u)

/** \brief  1D0, Measurement Control Register */
#define CAN1_MECR /*lint --e(923)*/ (*(volatile Ifx_CAN_MECR*)0xF00281D0u)

/** \brief  1D4, Measurement Status Register */
#define CAN1_MESTAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MESTAT*)0xF00281D4u)

/** \brief  1CC, Module Interrupt Trigger Register */
#define CAN1_MITR /*lint --e(923)*/ (*(volatile Ifx_CAN_MITR*)0xF00281CCu)

/** \brief  100C, Message Object  Acceptance Mask Register */
#define CAN1_MO0_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002900Cu)

/** Alias (User Manual Name) for CAN1_MO0_AMR.
* To use register names with standard convension, please use CAN1_MO0_AMR.
*/
#define	CAN1_MOAMR0	(CAN1_MO0_AMR)

/** \brief  1018, Message Object  Arbitration Register */
#define CAN1_MO0_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029018u)

/** Alias (User Manual Name) for CAN1_MO0_AR.
* To use register names with standard convension, please use CAN1_MO0_AR.
*/
#define	CAN1_MOAR0	(CAN1_MO0_AR)

/** \brief  101C, Message Object  Control Register */
#define CAN1_MO0_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002901Cu)

/** Alias (User Manual Name) for CAN1_MO0_CTR.
* To use register names with standard convension, please use CAN1_MO0_CTR.
*/
#define	CAN1_MOCTR0	(CAN1_MO0_CTR)

/** \brief  1014, Message Object  Data Register High */
#define CAN1_MO0_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029014u)

/** Alias (User Manual Name) for CAN1_MO0_DATAH.
* To use register names with standard convension, please use CAN1_MO0_DATAH.
*/
#define	CAN1_MODATAH0	(CAN1_MO0_DATAH)

/** \brief  1010, Message Object  Data Register Low */
#define CAN1_MO0_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029010u)

/** Alias (User Manual Name) for CAN1_MO0_DATAL.
* To use register names with standard convension, please use CAN1_MO0_DATAL.
*/
#define	CAN1_MODATAL0	(CAN1_MO0_DATAL)

/** \brief  1000, Message Object  Function Control Register */
#define CAN1_MO0_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029000u)

/** Alias (User Manual Name) for CAN1_MO0_EDATA0.
* To use register names with standard convension, please use CAN1_MO0_EDATA0.
*/
#define	CAN1_EMO0DATA0	(CAN1_MO0_EDATA0)

/** \brief  1004, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO0_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029004u)

/** Alias (User Manual Name) for CAN1_MO0_EDATA1.
* To use register names with standard convension, please use CAN1_MO0_EDATA1.
*/
#define	CAN1_EMO0DATA1	(CAN1_MO0_EDATA1)

/** \brief  1008, Message Object  Interrupt Pointer Register */
#define CAN1_MO0_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029008u)

/** Alias (User Manual Name) for CAN1_MO0_EDATA2.
* To use register names with standard convension, please use CAN1_MO0_EDATA2.
*/
#define	CAN1_EMO0DATA2	(CAN1_MO0_EDATA2)

/** \brief  100C, Message Object  Acceptance Mask Register */
#define CAN1_MO0_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002900Cu)

/** Alias (User Manual Name) for CAN1_MO0_EDATA3.
* To use register names with standard convension, please use CAN1_MO0_EDATA3.
*/
#define	CAN1_EMO0DATA3	(CAN1_MO0_EDATA3)

/** \brief  1010, Message Object  Data Register Low */
#define CAN1_MO0_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029010u)

/** Alias (User Manual Name) for CAN1_MO0_EDATA4.
* To use register names with standard convension, please use CAN1_MO0_EDATA4.
*/
#define	CAN1_EMO0DATA4	(CAN1_MO0_EDATA4)

/** \brief  1014, Message Object  Data Register High */
#define CAN1_MO0_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029014u)

/** Alias (User Manual Name) for CAN1_MO0_EDATA5.
* To use register names with standard convension, please use CAN1_MO0_EDATA5.
*/
#define	CAN1_EMO0DATA5	(CAN1_MO0_EDATA5)

/** \brief  1018, Message Object  Arbitration Register */
#define CAN1_MO0_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029018u)

/** Alias (User Manual Name) for CAN1_MO0_EDATA6.
* To use register names with standard convension, please use CAN1_MO0_EDATA6.
*/
#define	CAN1_EMO0DATA6	(CAN1_MO0_EDATA6)

/** \brief  1000, Message Object  Function Control Register */
#define CAN1_MO0_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029000u)

/** Alias (User Manual Name) for CAN1_MO0_FCR.
* To use register names with standard convension, please use CAN1_MO0_FCR.
*/
#define	CAN1_MOFCR0	(CAN1_MO0_FCR)

/** \brief  1004, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO0_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029004u)

/** Alias (User Manual Name) for CAN1_MO0_FGPR.
* To use register names with standard convension, please use CAN1_MO0_FGPR.
*/
#define	CAN1_MOFGPR0	(CAN1_MO0_FGPR)

/** \brief  1008, Message Object  Interrupt Pointer Register */
#define CAN1_MO0_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029008u)

/** Alias (User Manual Name) for CAN1_MO0_IPR.
* To use register names with standard convension, please use CAN1_MO0_IPR.
*/
#define	CAN1_MOIPR0	(CAN1_MO0_IPR)

/** \brief  101C, Message Object  Control Register */
#define CAN1_MO0_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002901Cu)

/** Alias (User Manual Name) for CAN1_MO0_STAT.
* To use register names with standard convension, please use CAN1_MO0_STAT.
*/
#define	CAN1_MOSTAT0	(CAN1_MO0_STAT)

/** \brief  1C8C, Message Object  Acceptance Mask Register */
#define CAN1_MO100_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C8Cu)

/** Alias (User Manual Name) for CAN1_MO100_AMR.
* To use register names with standard convension, please use CAN1_MO100_AMR.
*/
#define	CAN1_MOAMR100	(CAN1_MO100_AMR)

/** \brief  1C98, Message Object  Arbitration Register */
#define CAN1_MO100_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C98u)

