leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO100_AR.
* To use register names with standard convension, please use CAN1_MO100_AR.
*/
#define	CAN1_MOAR100	(CAN1_MO100_AR)

/** \brief  1C9C, Message Object  Control Register */
#define CAN1_MO100_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029C9Cu)

/** Alias (User Manual Name) for CAN1_MO100_CTR.
* To use register names with standard convension, please use CAN1_MO100_CTR.
*/
#define	CAN1_MOCTR100	(CAN1_MO100_CTR)

/** \brief  1C94, Message Object  Data Register High */
#define CAN1_MO100_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C94u)

/** Alias (User Manual Name) for CAN1_MO100_DATAH.
* To use register names with standard convension, please use CAN1_MO100_DATAH.
*/
#define	CAN1_MODATAH100	(CAN1_MO100_DATAH)

/** \brief  1C90, Message Object  Data Register Low */
#define CAN1_MO100_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C90u)

/** Alias (User Manual Name) for CAN1_MO100_DATAL.
* To use register names with standard convension, please use CAN1_MO100_DATAL.
*/
#define	CAN1_MODATAL100	(CAN1_MO100_DATAL)

/** \brief  1C80, Message Object  Function Control Register */
#define CAN1_MO100_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029C80u)

/** Alias (User Manual Name) for CAN1_MO100_EDATA0.
* To use register names with standard convension, please use CAN1_MO100_EDATA0.
*/
#define	CAN1_EMO100DATA0	(CAN1_MO100_EDATA0)

/** \brief  1C84, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO100_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029C84u)

/** Alias (User Manual Name) for CAN1_MO100_EDATA1.
* To use register names with standard convension, please use CAN1_MO100_EDATA1.
*/
#define	CAN1_EMO100DATA1	(CAN1_MO100_EDATA1)

/** \brief  1C88, Message Object  Interrupt Pointer Register */
#define CAN1_MO100_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029C88u)

/** Alias (User Manual Name) for CAN1_MO100_EDATA2.
* To use register names with standard convension, please use CAN1_MO100_EDATA2.
*/
#define	CAN1_EMO100DATA2	(CAN1_MO100_EDATA2)

/** \brief  1C8C, Message Object  Acceptance Mask Register */
#define CAN1_MO100_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029C8Cu)

/** Alias (User Manual Name) for CAN1_MO100_EDATA3.
* To use register names with standard convension, please use CAN1_MO100_EDATA3.
*/
#define	CAN1_EMO100DATA3	(CAN1_MO100_EDATA3)

/** \brief  1C90, Message Object  Data Register Low */
#define CAN1_MO100_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029C90u)

/** Alias (User Manual Name) for CAN1_MO100_EDATA4.
* To use register names with standard convension, please use CAN1_MO100_EDATA4.
*/
#define	CAN1_EMO100DATA4	(CAN1_MO100_EDATA4)

/** \brief  1C94, Message Object  Data Register High */
#define CAN1_MO100_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029C94u)

/** Alias (User Manual Name) for CAN1_MO100_EDATA5.
* To use register names with standard convension, please use CAN1_MO100_EDATA5.
*/
#define	CAN1_EMO100DATA5	(CAN1_MO100_EDATA5)

/** \brief  1C98, Message Object  Arbitration Register */
#define CAN1_MO100_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029C98u)

/** Alias (User Manual Name) for CAN1_MO100_EDATA6.
* To use register names with standard convension, please use CAN1_MO100_EDATA6.
*/
#define	CAN1_EMO100DATA6	(CAN1_MO100_EDATA6)

/** \brief  1C80, Message Object  Function Control Register */
#define CAN1_MO100_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C80u)

/** Alias (User Manual Name) for CAN1_MO100_FCR.
* To use register names with standard convension, please use CAN1_MO100_FCR.
*/
#define	CAN1_MOFCR100	(CAN1_MO100_FCR)

/** \brief  1C84, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO100_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C84u)

/** Alias (User Manual Name) for CAN1_MO100_FGPR.
* To use register names with standard convension, please use CAN1_MO100_FGPR.
*/
#define	CAN1_MOFGPR100	(CAN1_MO100_FGPR)

/** \brief  1C88, Message Object  Interrupt Pointer Register */
#define CAN1_MO100_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C88u)

/** Alias (User Manual Name) for CAN1_MO100_IPR.
* To use register names with standard convension, please use CAN1_MO100_IPR.
*/
#define	CAN1_MOIPR100	(CAN1_MO100_IPR)

/** \brief  1C9C, Message Object  Control Register */
#define CAN1_MO100_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029C9Cu)

/** Alias (User Manual Name) for CAN1_MO100_STAT.
* To use register names with standard convension, please use CAN1_MO100_STAT.
*/
#define	CAN1_MOSTAT100	(CAN1_MO100_STAT)

/** \brief  1CAC, Message Object  Acceptance Mask Register */
#define CAN1_MO101_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029CACu)

/** Alias (User Manual Name) for CAN1_MO101_AMR.
* To use register names with standard convension, please use CAN1_MO101_AMR.
*/
#define	CAN1_MOAMR101	(CAN1_MO101_AMR)

/** \brief  1CB8, Message Object  Arbitration Register */
#define CAN1_MO101_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029CB8u)

/** Alias (User Manual Name) for CAN1_MO101_AR.
* To use register names with standard convension, please use CAN1_MO101_AR.
*/
#define	CAN1_MOAR101	(CAN1_MO101_AR)

/** \brief  1CBC, Message Object  Control Register */
#define CAN1_MO101_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029CBCu)

/** Alias (User Manual Name) for CAN1_MO101_CTR.
* To use register names with standard convension, please use CAN1_MO101_CTR.
*/
#define	CAN1_MOCTR101	(CAN1_MO101_CTR)

/** \brief  1CB4, Message Object  Data Register High */
#define CAN1_MO101_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029CB4u)

/** Alias (User Manual Name) for CAN1_MO101_DATAH.
* To use register names with standard convension, please use CAN1_MO101_DATAH.
*/
#define	CAN1_MODATAH101	(CAN1_MO101_DATAH)

/** \brief  1CB0, Message Object  Data Register Low */
#define CAN1_MO101_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029CB0u)

/** Alias (User Manual Name) for CAN1_MO101_DATAL.
* To use register names with standard convension, please use CAN1_MO101_DATAL.
*/
#define	CAN1_MODATAL101	(CAN1_MO101_DATAL)

/** \brief  1CA0, Message Object  Function Control Register */
#define CAN1_MO101_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029CA0u)

/** Alias (User Manual Name) for CAN1_MO101_EDATA0.
* To use register names with standard convension, please use CAN1_MO101_EDATA0.
*/
#define	CAN1_EMO101DATA0	(CAN1_MO101_EDATA0)

/** \brief  1CA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO101_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029CA4u)

/** Alias (User Manual Name) for CAN1_MO101_EDATA1.
* To use register names with standard convension, please use CAN1_MO101_EDATA1.
*/
#define	CAN1_EMO101DATA1	(CAN1_MO101_EDATA1)

/** \brief  1CA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO101_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029CA8u)

