leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO101_EDATA2.
* To use register names with standard convension, please use CAN1_MO101_EDATA2.
*/
#define	CAN1_EMO101DATA2	(CAN1_MO101_EDATA2)

/** \brief  1CAC, Message Object  Acceptance Mask Register */
#define CAN1_MO101_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029CACu)

/** Alias (User Manual Name) for CAN1_MO101_EDATA3.
* To use register names with standard convension, please use CAN1_MO101_EDATA3.
*/
#define	CAN1_EMO101DATA3	(CAN1_MO101_EDATA3)

/** \brief  1CB0, Message Object  Data Register Low */
#define CAN1_MO101_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029CB0u)

/** Alias (User Manual Name) for CAN1_MO101_EDATA4.
* To use register names with standard convension, please use CAN1_MO101_EDATA4.
*/
#define	CAN1_EMO101DATA4	(CAN1_MO101_EDATA4)

/** \brief  1CB4, Message Object  Data Register High */
#define CAN1_MO101_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029CB4u)

/** Alias (User Manual Name) for CAN1_MO101_EDATA5.
* To use register names with standard convension, please use CAN1_MO101_EDATA5.
*/
#define	CAN1_EMO101DATA5	(CAN1_MO101_EDATA5)

/** \brief  1CB8, Message Object  Arbitration Register */
#define CAN1_MO101_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029CB8u)

/** Alias (User Manual Name) for CAN1_MO101_EDATA6.
* To use register names with standard convension, please use CAN1_MO101_EDATA6.
*/
#define	CAN1_EMO101DATA6	(CAN1_MO101_EDATA6)

/** \brief  1CA0, Message Object  Function Control Register */
#define CAN1_MO101_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029CA0u)

/** Alias (User Manual Name) for CAN1_MO101_FCR.
* To use register names with standard convension, please use CAN1_MO101_FCR.
*/
#define	CAN1_MOFCR101	(CAN1_MO101_FCR)

/** \brief  1CA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO101_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029CA4u)

/** Alias (User Manual Name) for CAN1_MO101_FGPR.
* To use register names with standard convension, please use CAN1_MO101_FGPR.
*/
#define	CAN1_MOFGPR101	(CAN1_MO101_FGPR)

/** \brief  1CA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO101_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029CA8u)

/** Alias (User Manual Name) for CAN1_MO101_IPR.
* To use register names with standard convension, please use CAN1_MO101_IPR.
*/
#define	CAN1_MOIPR101	(CAN1_MO101_IPR)

/** \brief  1CBC, Message Object  Control Register */
#define CAN1_MO101_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029CBCu)

/** Alias (User Manual Name) for CAN1_MO101_STAT.
* To use register names with standard convension, please use CAN1_MO101_STAT.
*/
#define	CAN1_MOSTAT101	(CAN1_MO101_STAT)

/** \brief  1CCC, Message Object  Acceptance Mask Register */
#define CAN1_MO102_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029CCCu)

/** Alias (User Manual Name) for CAN1_MO102_AMR.
* To use register names with standard convension, please use CAN1_MO102_AMR.
*/
#define	CAN1_MOAMR102	(CAN1_MO102_AMR)

/** \brief  1CD8, Message Object  Arbitration Register */
#define CAN1_MO102_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029CD8u)

/** Alias (User Manual Name) for CAN1_MO102_AR.
* To use register names with standard convension, please use CAN1_MO102_AR.
*/
#define	CAN1_MOAR102	(CAN1_MO102_AR)

/** \brief  1CDC, Message Object  Control Register */
#define CAN1_MO102_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029CDCu)

/** Alias (User Manual Name) for CAN1_MO102_CTR.
* To use register names with standard convension, please use CAN1_MO102_CTR.
*/
#define	CAN1_MOCTR102	(CAN1_MO102_CTR)

/** \brief  1CD4, Message Object  Data Register High */
#define CAN1_MO102_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029CD4u)

/** Alias (User Manual Name) for CAN1_MO102_DATAH.
* To use register names with standard convension, please use CAN1_MO102_DATAH.
*/
#define	CAN1_MODATAH102	(CAN1_MO102_DATAH)

/** \brief  1CD0, Message Object  Data Register Low */
#define CAN1_MO102_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029CD0u)

/** Alias (User Manual Name) for CAN1_MO102_DATAL.
* To use register names with standard convension, please use CAN1_MO102_DATAL.
*/
#define	CAN1_MODATAL102	(CAN1_MO102_DATAL)

/** \brief  1CC0, Message Object  Function Control Register */
#define CAN1_MO102_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029CC0u)

/** Alias (User Manual Name) for CAN1_MO102_EDATA0.
* To use register names with standard convension, please use CAN1_MO102_EDATA0.
*/
#define	CAN1_EMO102DATA0	(CAN1_MO102_EDATA0)

/** \brief  1CC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO102_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029CC4u)

/** Alias (User Manual Name) for CAN1_MO102_EDATA1.
* To use register names with standard convension, please use CAN1_MO102_EDATA1.
*/
#define	CAN1_EMO102DATA1	(CAN1_MO102_EDATA1)

/** \brief  1CC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO102_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029CC8u)

/** Alias (User Manual Name) for CAN1_MO102_EDATA2.
* To use register names with standard convension, please use CAN1_MO102_EDATA2.
*/
#define	CAN1_EMO102DATA2	(CAN1_MO102_EDATA2)

/** \brief  1CCC, Message Object  Acceptance Mask Register */
#define CAN1_MO102_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029CCCu)

/** Alias (User Manual Name) for CAN1_MO102_EDATA3.
* To use register names with standard convension, please use CAN1_MO102_EDATA3.
*/
#define	CAN1_EMO102DATA3	(CAN1_MO102_EDATA3)

/** \brief  1CD0, Message Object  Data Register Low */
#define CAN1_MO102_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029CD0u)

/** Alias (User Manual Name) for CAN1_MO102_EDATA4.
* To use register names with standard convension, please use CAN1_MO102_EDATA4.
*/
#define	CAN1_EMO102DATA4	(CAN1_MO102_EDATA4)

/** \brief  1CD4, Message Object  Data Register High */
#define CAN1_MO102_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029CD4u)

/** Alias (User Manual Name) for CAN1_MO102_EDATA5.
* To use register names with standard convension, please use CAN1_MO102_EDATA5.
*/
#define	CAN1_EMO102DATA5	(CAN1_MO102_EDATA5)

