leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1CD8, Message Object  Arbitration Register */
#define CAN1_MO102_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029CD8u)

/** Alias (User Manual Name) for CAN1_MO102_EDATA6.
* To use register names with standard convension, please use CAN1_MO102_EDATA6.
*/
#define	CAN1_EMO102DATA6	(CAN1_MO102_EDATA6)

/** \brief  1CC0, Message Object  Function Control Register */
#define CAN1_MO102_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029CC0u)

/** Alias (User Manual Name) for CAN1_MO102_FCR.
* To use register names with standard convension, please use CAN1_MO102_FCR.
*/
#define	CAN1_MOFCR102	(CAN1_MO102_FCR)

/** \brief  1CC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO102_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029CC4u)

/** Alias (User Manual Name) for CAN1_MO102_FGPR.
* To use register names with standard convension, please use CAN1_MO102_FGPR.
*/
#define	CAN1_MOFGPR102	(CAN1_MO102_FGPR)

/** \brief  1CC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO102_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029CC8u)

/** Alias (User Manual Name) for CAN1_MO102_IPR.
* To use register names with standard convension, please use CAN1_MO102_IPR.
*/
#define	CAN1_MOIPR102	(CAN1_MO102_IPR)

/** \brief  1CDC, Message Object  Control Register */
#define CAN1_MO102_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029CDCu)

/** Alias (User Manual Name) for CAN1_MO102_STAT.
* To use register names with standard convension, please use CAN1_MO102_STAT.
*/
#define	CAN1_MOSTAT102	(CAN1_MO102_STAT)

/** \brief  1CEC, Message Object  Acceptance Mask Register */
#define CAN1_MO103_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029CECu)

/** Alias (User Manual Name) for CAN1_MO103_AMR.
* To use register names with standard convension, please use CAN1_MO103_AMR.
*/
#define	CAN1_MOAMR103	(CAN1_MO103_AMR)

/** \brief  1CF8, Message Object  Arbitration Register */
#define CAN1_MO103_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029CF8u)

/** Alias (User Manual Name) for CAN1_MO103_AR.
* To use register names with standard convension, please use CAN1_MO103_AR.
*/
#define	CAN1_MOAR103	(CAN1_MO103_AR)

/** \brief  1CFC, Message Object  Control Register */
#define CAN1_MO103_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029CFCu)

/** Alias (User Manual Name) for CAN1_MO103_CTR.
* To use register names with standard convension, please use CAN1_MO103_CTR.
*/
#define	CAN1_MOCTR103	(CAN1_MO103_CTR)

/** \brief  1CF4, Message Object  Data Register High */
#define CAN1_MO103_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029CF4u)

/** Alias (User Manual Name) for CAN1_MO103_DATAH.
* To use register names with standard convension, please use CAN1_MO103_DATAH.
*/
#define	CAN1_MODATAH103	(CAN1_MO103_DATAH)

/** \brief  1CF0, Message Object  Data Register Low */
#define CAN1_MO103_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029CF0u)

/** Alias (User Manual Name) for CAN1_MO103_DATAL.
* To use register names with standard convension, please use CAN1_MO103_DATAL.
*/
#define	CAN1_MODATAL103	(CAN1_MO103_DATAL)

/** \brief  1CE0, Message Object  Function Control Register */
#define CAN1_MO103_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029CE0u)

/** Alias (User Manual Name) for CAN1_MO103_EDATA0.
* To use register names with standard convension, please use CAN1_MO103_EDATA0.
*/
#define	CAN1_EMO103DATA0	(CAN1_MO103_EDATA0)

/** \brief  1CE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO103_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029CE4u)

/** Alias (User Manual Name) for CAN1_MO103_EDATA1.
* To use register names with standard convension, please use CAN1_MO103_EDATA1.
*/
#define	CAN1_EMO103DATA1	(CAN1_MO103_EDATA1)

/** \brief  1CE8, Message Object  Interrupt Pointer Register */
#define CAN1_MO103_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029CE8u)

/** Alias (User Manual Name) for CAN1_MO103_EDATA2.
* To use register names with standard convension, please use CAN1_MO103_EDATA2.
*/
#define	CAN1_EMO103DATA2	(CAN1_MO103_EDATA2)

/** \brief  1CEC, Message Object  Acceptance Mask Register */
#define CAN1_MO103_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029CECu)

/** Alias (User Manual Name) for CAN1_MO103_EDATA3.
* To use register names with standard convension, please use CAN1_MO103_EDATA3.
*/
#define	CAN1_EMO103DATA3	(CAN1_MO103_EDATA3)

/** \brief  1CF0, Message Object  Data Register Low */
#define CAN1_MO103_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029CF0u)

/** Alias (User Manual Name) for CAN1_MO103_EDATA4.
* To use register names with standard convension, please use CAN1_MO103_EDATA4.
*/
#define	CAN1_EMO103DATA4	(CAN1_MO103_EDATA4)

/** \brief  1CF4, Message Object  Data Register High */
#define CAN1_MO103_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029CF4u)

/** Alias (User Manual Name) for CAN1_MO103_EDATA5.
* To use register names with standard convension, please use CAN1_MO103_EDATA5.
*/
#define	CAN1_EMO103DATA5	(CAN1_MO103_EDATA5)

/** \brief  1CF8, Message Object  Arbitration Register */
#define CAN1_MO103_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029CF8u)

/** Alias (User Manual Name) for CAN1_MO103_EDATA6.
* To use register names with standard convension, please use CAN1_MO103_EDATA6.
*/
#define	CAN1_EMO103DATA6	(CAN1_MO103_EDATA6)

/** \brief  1CE0, Message Object  Function Control Register */
#define CAN1_MO103_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029CE0u)

/** Alias (User Manual Name) for CAN1_MO103_FCR.
* To use register names with standard convension, please use CAN1_MO103_FCR.
*/
#define	CAN1_MOFCR103	(CAN1_MO103_FCR)

/** \brief  1CE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO103_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029CE4u)

/** Alias (User Manual Name) for CAN1_MO103_FGPR.
* To use register names with standard convension, please use CAN1_MO103_FGPR.
*/
#define	CAN1_MOFGPR103	(CAN1_MO103_FGPR)

/** \brief  1CE8, Message Object  Interrupt Pointer Register */
#define CAN1_MO103_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029CE8u)

/** Alias (User Manual Name) for CAN1_MO103_IPR.
* To use register names with standard convension, please use CAN1_MO103_IPR.
*/
#define	CAN1_MOIPR103	(CAN1_MO103_IPR)

/** \brief  1CFC, Message Object  Control Register */
#define CAN1_MO103_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029CFCu)

/** Alias (User Manual Name) for CAN1_MO103_STAT.
* To use register names with standard convension, please use CAN1_MO103_STAT.
*/
#define	CAN1_MOSTAT103	(CAN1_MO103_STAT)

/** \brief  1D0C, Message Object  Acceptance Mask Register */
#define CAN1_MO104_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D0Cu)

/** Alias (User Manual Name) for CAN1_MO104_AMR.
* To use register names with standard convension, please use CAN1_MO104_AMR.
*/
#define	CAN1_MOAMR104	(CAN1_MO104_AMR)

