leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1D18, Message Object  Arbitration Register */
#define CAN1_MO104_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D18u)

/** Alias (User Manual Name) for CAN1_MO104_AR.
* To use register names with standard convension, please use CAN1_MO104_AR.
*/
#define	CAN1_MOAR104	(CAN1_MO104_AR)

/** \brief  1D1C, Message Object  Control Register */
#define CAN1_MO104_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029D1Cu)

/** Alias (User Manual Name) for CAN1_MO104_CTR.
* To use register names with standard convension, please use CAN1_MO104_CTR.
*/
#define	CAN1_MOCTR104	(CAN1_MO104_CTR)

/** \brief  1D14, Message Object  Data Register High */
#define CAN1_MO104_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D14u)

/** Alias (User Manual Name) for CAN1_MO104_DATAH.
* To use register names with standard convension, please use CAN1_MO104_DATAH.
*/
#define	CAN1_MODATAH104	(CAN1_MO104_DATAH)

/** \brief  1D10, Message Object  Data Register Low */
#define CAN1_MO104_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029D10u)

/** Alias (User Manual Name) for CAN1_MO104_DATAL.
* To use register names with standard convension, please use CAN1_MO104_DATAL.
*/
#define	CAN1_MODATAL104	(CAN1_MO104_DATAL)

/** \brief  1D00, Message Object  Function Control Register */
#define CAN1_MO104_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029D00u)

/** Alias (User Manual Name) for CAN1_MO104_EDATA0.
* To use register names with standard convension, please use CAN1_MO104_EDATA0.
*/
#define	CAN1_EMO104DATA0	(CAN1_MO104_EDATA0)

/** \brief  1D04, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO104_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029D04u)

/** Alias (User Manual Name) for CAN1_MO104_EDATA1.
* To use register names with standard convension, please use CAN1_MO104_EDATA1.
*/
#define	CAN1_EMO104DATA1	(CAN1_MO104_EDATA1)

/** \brief  1D08, Message Object  Interrupt Pointer Register */
#define CAN1_MO104_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029D08u)

/** Alias (User Manual Name) for CAN1_MO104_EDATA2.
* To use register names with standard convension, please use CAN1_MO104_EDATA2.
*/
#define	CAN1_EMO104DATA2	(CAN1_MO104_EDATA2)

/** \brief  1D0C, Message Object  Acceptance Mask Register */
#define CAN1_MO104_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029D0Cu)

/** Alias (User Manual Name) for CAN1_MO104_EDATA3.
* To use register names with standard convension, please use CAN1_MO104_EDATA3.
*/
#define	CAN1_EMO104DATA3	(CAN1_MO104_EDATA3)

/** \brief  1D10, Message Object  Data Register Low */
#define CAN1_MO104_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029D10u)

/** Alias (User Manual Name) for CAN1_MO104_EDATA4.
* To use register names with standard convension, please use CAN1_MO104_EDATA4.
*/
#define	CAN1_EMO104DATA4	(CAN1_MO104_EDATA4)

/** \brief  1D14, Message Object  Data Register High */
#define CAN1_MO104_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029D14u)

/** Alias (User Manual Name) for CAN1_MO104_EDATA5.
* To use register names with standard convension, please use CAN1_MO104_EDATA5.
*/
#define	CAN1_EMO104DATA5	(CAN1_MO104_EDATA5)

/** \brief  1D18, Message Object  Arbitration Register */
#define CAN1_MO104_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029D18u)

/** Alias (User Manual Name) for CAN1_MO104_EDATA6.
* To use register names with standard convension, please use CAN1_MO104_EDATA6.
*/
#define	CAN1_EMO104DATA6	(CAN1_MO104_EDATA6)

/** \brief  1D00, Message Object  Function Control Register */
#define CAN1_MO104_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029D00u)

/** Alias (User Manual Name) for CAN1_MO104_FCR.
* To use register names with standard convension, please use CAN1_MO104_FCR.
*/
#define	CAN1_MOFCR104	(CAN1_MO104_FCR)

/** \brief  1D04, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO104_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029D04u)

/** Alias (User Manual Name) for CAN1_MO104_FGPR.
* To use register names with standard convension, please use CAN1_MO104_FGPR.
*/
#define	CAN1_MOFGPR104	(CAN1_MO104_FGPR)

/** \brief  1D08, Message Object  Interrupt Pointer Register */
#define CAN1_MO104_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029D08u)

/** Alias (User Manual Name) for CAN1_MO104_IPR.
* To use register names with standard convension, please use CAN1_MO104_IPR.
*/
#define	CAN1_MOIPR104	(CAN1_MO104_IPR)

/** \brief  1D1C, Message Object  Control Register */
#define CAN1_MO104_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029D1Cu)

/** Alias (User Manual Name) for CAN1_MO104_STAT.
* To use register names with standard convension, please use CAN1_MO104_STAT.
*/
#define	CAN1_MOSTAT104	(CAN1_MO104_STAT)

/** \brief  1D2C, Message Object  Acceptance Mask Register */
#define CAN1_MO105_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D2Cu)

/** Alias (User Manual Name) for CAN1_MO105_AMR.
* To use register names with standard convension, please use CAN1_MO105_AMR.
*/
#define	CAN1_MOAMR105	(CAN1_MO105_AMR)

/** \brief  1D38, Message Object  Arbitration Register */
#define CAN1_MO105_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D38u)

/** Alias (User Manual Name) for CAN1_MO105_AR.
* To use register names with standard convension, please use CAN1_MO105_AR.
*/
#define	CAN1_MOAR105	(CAN1_MO105_AR)

/** \brief  1D3C, Message Object  Control Register */
#define CAN1_MO105_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029D3Cu)

/** Alias (User Manual Name) for CAN1_MO105_CTR.
* To use register names with standard convension, please use CAN1_MO105_CTR.
*/
#define	CAN1_MOCTR105	(CAN1_MO105_CTR)

/** \brief  1D34, Message Object  Data Register High */
#define CAN1_MO105_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D34u)

/** Alias (User Manual Name) for CAN1_MO105_DATAH.
* To use register names with standard convension, please use CAN1_MO105_DATAH.
*/
#define	CAN1_MODATAH105	(CAN1_MO105_DATAH)

/** \brief  1D30, Message Object  Data Register Low */
#define CAN1_MO105_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029D30u)

/** Alias (User Manual Name) for CAN1_MO105_DATAL.
* To use register names with standard convension, please use CAN1_MO105_DATAL.
*/
#define	CAN1_MODATAL105	(CAN1_MO105_DATAL)

/** \brief  1D20, Message Object  Function Control Register */
#define CAN1_MO105_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029D20u)

/** Alias (User Manual Name) for CAN1_MO105_EDATA0.
* To use register names with standard convension, please use CAN1_MO105_EDATA0.
*/
#define	CAN1_EMO105DATA0	(CAN1_MO105_EDATA0)

