leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1D24, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO105_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029D24u)

/** Alias (User Manual Name) for CAN1_MO105_EDATA1.
* To use register names with standard convension, please use CAN1_MO105_EDATA1.
*/
#define	CAN1_EMO105DATA1	(CAN1_MO105_EDATA1)

/** \brief  1D28, Message Object  Interrupt Pointer Register */
#define CAN1_MO105_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029D28u)

/** Alias (User Manual Name) for CAN1_MO105_EDATA2.
* To use register names with standard convension, please use CAN1_MO105_EDATA2.
*/
#define	CAN1_EMO105DATA2	(CAN1_MO105_EDATA2)

/** \brief  1D2C, Message Object  Acceptance Mask Register */
#define CAN1_MO105_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029D2Cu)

/** Alias (User Manual Name) for CAN1_MO105_EDATA3.
* To use register names with standard convension, please use CAN1_MO105_EDATA3.
*/
#define	CAN1_EMO105DATA3	(CAN1_MO105_EDATA3)

/** \brief  1D30, Message Object  Data Register Low */
#define CAN1_MO105_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029D30u)

/** Alias (User Manual Name) for CAN1_MO105_EDATA4.
* To use register names with standard convension, please use CAN1_MO105_EDATA4.
*/
#define	CAN1_EMO105DATA4	(CAN1_MO105_EDATA4)

/** \brief  1D34, Message Object  Data Register High */
#define CAN1_MO105_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029D34u)

/** Alias (User Manual Name) for CAN1_MO105_EDATA5.
* To use register names with standard convension, please use CAN1_MO105_EDATA5.
*/
#define	CAN1_EMO105DATA5	(CAN1_MO105_EDATA5)

/** \brief  1D38, Message Object  Arbitration Register */
#define CAN1_MO105_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029D38u)

/** Alias (User Manual Name) for CAN1_MO105_EDATA6.
* To use register names with standard convension, please use CAN1_MO105_EDATA6.
*/
#define	CAN1_EMO105DATA6	(CAN1_MO105_EDATA6)

/** \brief  1D20, Message Object  Function Control Register */
#define CAN1_MO105_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029D20u)

/** Alias (User Manual Name) for CAN1_MO105_FCR.
* To use register names with standard convension, please use CAN1_MO105_FCR.
*/
#define	CAN1_MOFCR105	(CAN1_MO105_FCR)

/** \brief  1D24, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO105_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029D24u)

/** Alias (User Manual Name) for CAN1_MO105_FGPR.
* To use register names with standard convension, please use CAN1_MO105_FGPR.
*/
#define	CAN1_MOFGPR105	(CAN1_MO105_FGPR)

/** \brief  1D28, Message Object  Interrupt Pointer Register */
#define CAN1_MO105_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029D28u)

/** Alias (User Manual Name) for CAN1_MO105_IPR.
* To use register names with standard convension, please use CAN1_MO105_IPR.
*/
#define	CAN1_MOIPR105	(CAN1_MO105_IPR)

/** \brief  1D3C, Message Object  Control Register */
#define CAN1_MO105_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029D3Cu)

/** Alias (User Manual Name) for CAN1_MO105_STAT.
* To use register names with standard convension, please use CAN1_MO105_STAT.
*/
#define	CAN1_MOSTAT105	(CAN1_MO105_STAT)

/** \brief  1D4C, Message Object  Acceptance Mask Register */
#define CAN1_MO106_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D4Cu)

/** Alias (User Manual Name) for CAN1_MO106_AMR.
* To use register names with standard convension, please use CAN1_MO106_AMR.
*/
#define	CAN1_MOAMR106	(CAN1_MO106_AMR)

/** \brief  1D58, Message Object  Arbitration Register */
#define CAN1_MO106_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D58u)

/** Alias (User Manual Name) for CAN1_MO106_AR.
* To use register names with standard convension, please use CAN1_MO106_AR.
*/
#define	CAN1_MOAR106	(CAN1_MO106_AR)

/** \brief  1D5C, Message Object  Control Register */
#define CAN1_MO106_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029D5Cu)

/** Alias (User Manual Name) for CAN1_MO106_CTR.
* To use register names with standard convension, please use CAN1_MO106_CTR.
*/
#define	CAN1_MOCTR106	(CAN1_MO106_CTR)

/** \brief  1D54, Message Object  Data Register High */
#define CAN1_MO106_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D54u)

/** Alias (User Manual Name) for CAN1_MO106_DATAH.
* To use register names with standard convension, please use CAN1_MO106_DATAH.
*/
#define	CAN1_MODATAH106	(CAN1_MO106_DATAH)

/** \brief  1D50, Message Object  Data Register Low */
#define CAN1_MO106_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029D50u)

/** Alias (User Manual Name) for CAN1_MO106_DATAL.
* To use register names with standard convension, please use CAN1_MO106_DATAL.
*/
#define	CAN1_MODATAL106	(CAN1_MO106_DATAL)

/** \brief  1D40, Message Object  Function Control Register */
#define CAN1_MO106_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029D40u)

/** Alias (User Manual Name) for CAN1_MO106_EDATA0.
* To use register names with standard convension, please use CAN1_MO106_EDATA0.
*/
#define	CAN1_EMO106DATA0	(CAN1_MO106_EDATA0)

/** \brief  1D44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO106_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029D44u)

/** Alias (User Manual Name) for CAN1_MO106_EDATA1.
* To use register names with standard convension, please use CAN1_MO106_EDATA1.
*/
#define	CAN1_EMO106DATA1	(CAN1_MO106_EDATA1)

/** \brief  1D48, Message Object  Interrupt Pointer Register */
#define CAN1_MO106_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029D48u)

/** Alias (User Manual Name) for CAN1_MO106_EDATA2.
* To use register names with standard convension, please use CAN1_MO106_EDATA2.
*/
#define	CAN1_EMO106DATA2	(CAN1_MO106_EDATA2)

/** \brief  1D4C, Message Object  Acceptance Mask Register */
#define CAN1_MO106_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029D4Cu)

/** Alias (User Manual Name) for CAN1_MO106_EDATA3.
* To use register names with standard convension, please use CAN1_MO106_EDATA3.
*/
#define	CAN1_EMO106DATA3	(CAN1_MO106_EDATA3)

/** \brief  1D50, Message Object  Data Register Low */
#define CAN1_MO106_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029D50u)

/** Alias (User Manual Name) for CAN1_MO106_EDATA4.
* To use register names with standard convension, please use CAN1_MO106_EDATA4.
*/
#define	CAN1_EMO106DATA4	(CAN1_MO106_EDATA4)

/** \brief  1D54, Message Object  Data Register High */
#define CAN1_MO106_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029D54u)

/** Alias (User Manual Name) for CAN1_MO106_EDATA5.
* To use register names with standard convension, please use CAN1_MO106_EDATA5.
*/
#define	CAN1_EMO106DATA5	(CAN1_MO106_EDATA5)

/** \brief  1D58, Message Object  Arbitration Register */
#define CAN1_MO106_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029D58u)

/** Alias (User Manual Name) for CAN1_MO106_EDATA6.
* To use register names with standard convension, please use CAN1_MO106_EDATA6.
*/
#define	CAN1_EMO106DATA6	(CAN1_MO106_EDATA6)

/** \brief  1D40, Message Object  Function Control Register */
#define CAN1_MO106_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029D40u)

/** Alias (User Manual Name) for CAN1_MO106_FCR.
* To use register names with standard convension, please use CAN1_MO106_FCR.
*/
#define	CAN1_MOFCR106	(CAN1_MO106_FCR)

/** \brief  1D44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO106_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029D44u)

