leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1DA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO109_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029DA4u)

/** Alias (User Manual Name) for CAN1_MO109_EDATA1.
* To use register names with standard convension, please use CAN1_MO109_EDATA1.
*/
#define	CAN1_EMO109DATA1	(CAN1_MO109_EDATA1)

/** \brief  1DA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO109_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029DA8u)

/** Alias (User Manual Name) for CAN1_MO109_EDATA2.
* To use register names with standard convension, please use CAN1_MO109_EDATA2.
*/
#define	CAN1_EMO109DATA2	(CAN1_MO109_EDATA2)

/** \brief  1DAC, Message Object  Acceptance Mask Register */
#define CAN1_MO109_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029DACu)

/** Alias (User Manual Name) for CAN1_MO109_EDATA3.
* To use register names with standard convension, please use CAN1_MO109_EDATA3.
*/
#define	CAN1_EMO109DATA3	(CAN1_MO109_EDATA3)

/** \brief  1DB0, Message Object  Data Register Low */
#define CAN1_MO109_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029DB0u)

/** Alias (User Manual Name) for CAN1_MO109_EDATA4.
* To use register names with standard convension, please use CAN1_MO109_EDATA4.
*/
#define	CAN1_EMO109DATA4	(CAN1_MO109_EDATA4)

/** \brief  1DB4, Message Object  Data Register High */
#define CAN1_MO109_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029DB4u)

/** Alias (User Manual Name) for CAN1_MO109_EDATA5.
* To use register names with standard convension, please use CAN1_MO109_EDATA5.
*/
#define	CAN1_EMO109DATA5	(CAN1_MO109_EDATA5)

/** \brief  1DB8, Message Object  Arbitration Register */
#define CAN1_MO109_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029DB8u)

/** Alias (User Manual Name) for CAN1_MO109_EDATA6.
* To use register names with standard convension, please use CAN1_MO109_EDATA6.
*/
#define	CAN1_EMO109DATA6	(CAN1_MO109_EDATA6)

/** \brief  1DA0, Message Object  Function Control Register */
#define CAN1_MO109_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029DA0u)

/** Alias (User Manual Name) for CAN1_MO109_FCR.
* To use register names with standard convension, please use CAN1_MO109_FCR.
*/
#define	CAN1_MOFCR109	(CAN1_MO109_FCR)

/** \brief  1DA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO109_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029DA4u)

/** Alias (User Manual Name) for CAN1_MO109_FGPR.
* To use register names with standard convension, please use CAN1_MO109_FGPR.
*/
#define	CAN1_MOFGPR109	(CAN1_MO109_FGPR)

/** \brief  1DA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO109_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029DA8u)

/** Alias (User Manual Name) for CAN1_MO109_IPR.
* To use register names with standard convension, please use CAN1_MO109_IPR.
*/
#define	CAN1_MOIPR109	(CAN1_MO109_IPR)

/** \brief  1DBC, Message Object  Control Register */
#define CAN1_MO109_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029DBCu)

/** Alias (User Manual Name) for CAN1_MO109_STAT.
* To use register names with standard convension, please use CAN1_MO109_STAT.
*/
#define	CAN1_MOSTAT109	(CAN1_MO109_STAT)

/** \brief  114C, Message Object  Acceptance Mask Register */
#define CAN1_MO10_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002914Cu)

/** Alias (User Manual Name) for CAN1_MO10_AMR.
* To use register names with standard convension, please use CAN1_MO10_AMR.
*/
#define	CAN1_MOAMR10	(CAN1_MO10_AMR)

/** \brief  1158, Message Object  Arbitration Register */
#define CAN1_MO10_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029158u)

/** Alias (User Manual Name) for CAN1_MO10_AR.
* To use register names with standard convension, please use CAN1_MO10_AR.
*/
#define	CAN1_MOAR10	(CAN1_MO10_AR)

/** \brief  115C, Message Object  Control Register */
#define CAN1_MO10_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002915Cu)

/** Alias (User Manual Name) for CAN1_MO10_CTR.
* To use register names with standard convension, please use CAN1_MO10_CTR.
*/
#define	CAN1_MOCTR10	(CAN1_MO10_CTR)

/** \brief  1154, Message Object  Data Register High */
#define CAN1_MO10_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029154u)

/** Alias (User Manual Name) for CAN1_MO10_DATAH.
* To use register names with standard convension, please use CAN1_MO10_DATAH.
*/
#define	CAN1_MODATAH10	(CAN1_MO10_DATAH)

/** \brief  1150, Message Object  Data Register Low */
#define CAN1_MO10_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029150u)

/** Alias (User Manual Name) for CAN1_MO10_DATAL.
* To use register names with standard convension, please use CAN1_MO10_DATAL.
*/
#define	CAN1_MODATAL10	(CAN1_MO10_DATAL)

/** \brief  1140, Message Object  Function Control Register */
#define CAN1_MO10_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029140u)

/** Alias (User Manual Name) for CAN1_MO10_EDATA0.
* To use register names with standard convension, please use CAN1_MO10_EDATA0.
*/
#define	CAN1_EMO10DATA0	(CAN1_MO10_EDATA0)

/** \brief  1144, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO10_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029144u)

/** Alias (User Manual Name) for CAN1_MO10_EDATA1.
* To use register names with standard convension, please use CAN1_MO10_EDATA1.
*/
#define	CAN1_EMO10DATA1	(CAN1_MO10_EDATA1)

/** \brief  1148, Message Object  Interrupt Pointer Register */
#define CAN1_MO10_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029148u)

/** Alias (User Manual Name) for CAN1_MO10_EDATA2.
* To use register names with standard convension, please use CAN1_MO10_EDATA2.
*/
#define	CAN1_EMO10DATA2	(CAN1_MO10_EDATA2)

/** \brief  114C, Message Object  Acceptance Mask Register */
#define CAN1_MO10_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002914Cu)

/** Alias (User Manual Name) for CAN1_MO10_EDATA3.
* To use register names with standard convension, please use CAN1_MO10_EDATA3.
*/
#define	CAN1_EMO10DATA3	(CAN1_MO10_EDATA3)

/** \brief  1150, Message Object  Data Register Low */
#define CAN1_MO10_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029150u)

/** Alias (User Manual Name) for CAN1_MO10_EDATA4.
* To use register names with standard convension, please use CAN1_MO10_EDATA4.
*/
#define	CAN1_EMO10DATA4	(CAN1_MO10_EDATA4)

/** \brief  1154, Message Object  Data Register High */
#define CAN1_MO10_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029154u)

/** Alias (User Manual Name) for CAN1_MO10_EDATA5.
* To use register names with standard convension, please use CAN1_MO10_EDATA5.
*/
#define	CAN1_EMO10DATA5	(CAN1_MO10_EDATA5)

/** \brief  1158, Message Object  Arbitration Register */
#define CAN1_MO10_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029158u)

