leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO10_EDATA6.
* To use register names with standard convension, please use CAN1_MO10_EDATA6.
*/
#define	CAN1_EMO10DATA6	(CAN1_MO10_EDATA6)

/** \brief  1140, Message Object  Function Control Register */
#define CAN1_MO10_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029140u)

/** Alias (User Manual Name) for CAN1_MO10_FCR.
* To use register names with standard convension, please use CAN1_MO10_FCR.
*/
#define	CAN1_MOFCR10	(CAN1_MO10_FCR)

/** \brief  1144, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO10_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029144u)

/** Alias (User Manual Name) for CAN1_MO10_FGPR.
* To use register names with standard convension, please use CAN1_MO10_FGPR.
*/
#define	CAN1_MOFGPR10	(CAN1_MO10_FGPR)

/** \brief  1148, Message Object  Interrupt Pointer Register */
#define CAN1_MO10_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029148u)

/** Alias (User Manual Name) for CAN1_MO10_IPR.
* To use register names with standard convension, please use CAN1_MO10_IPR.
*/
#define	CAN1_MOIPR10	(CAN1_MO10_IPR)

/** \brief  115C, Message Object  Control Register */
#define CAN1_MO10_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002915Cu)

/** Alias (User Manual Name) for CAN1_MO10_STAT.
* To use register names with standard convension, please use CAN1_MO10_STAT.
*/
#define	CAN1_MOSTAT10	(CAN1_MO10_STAT)

/** \brief  1DCC, Message Object  Acceptance Mask Register */
#define CAN1_MO110_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029DCCu)

/** Alias (User Manual Name) for CAN1_MO110_AMR.
* To use register names with standard convension, please use CAN1_MO110_AMR.
*/
#define	CAN1_MOAMR110	(CAN1_MO110_AMR)

/** \brief  1DD8, Message Object  Arbitration Register */
#define CAN1_MO110_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029DD8u)

/** Alias (User Manual Name) for CAN1_MO110_AR.
* To use register names with standard convension, please use CAN1_MO110_AR.
*/
#define	CAN1_MOAR110	(CAN1_MO110_AR)

/** \brief  1DDC, Message Object  Control Register */
#define CAN1_MO110_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029DDCu)

/** Alias (User Manual Name) for CAN1_MO110_CTR.
* To use register names with standard convension, please use CAN1_MO110_CTR.
*/
#define	CAN1_MOCTR110	(CAN1_MO110_CTR)

/** \brief  1DD4, Message Object  Data Register High */
#define CAN1_MO110_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029DD4u)

/** Alias (User Manual Name) for CAN1_MO110_DATAH.
* To use register names with standard convension, please use CAN1_MO110_DATAH.
*/
#define	CAN1_MODATAH110	(CAN1_MO110_DATAH)

/** \brief  1DD0, Message Object  Data Register Low */
#define CAN1_MO110_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029DD0u)

/** Alias (User Manual Name) for CAN1_MO110_DATAL.
* To use register names with standard convension, please use CAN1_MO110_DATAL.
*/
#define	CAN1_MODATAL110	(CAN1_MO110_DATAL)

/** \brief  1DC0, Message Object  Function Control Register */
#define CAN1_MO110_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029DC0u)

/** Alias (User Manual Name) for CAN1_MO110_EDATA0.
* To use register names with standard convension, please use CAN1_MO110_EDATA0.
*/
#define	CAN1_EMO110DATA0	(CAN1_MO110_EDATA0)

/** \brief  1DC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO110_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029DC4u)

/** Alias (User Manual Name) for CAN1_MO110_EDATA1.
* To use register names with standard convension, please use CAN1_MO110_EDATA1.
*/
#define	CAN1_EMO110DATA1	(CAN1_MO110_EDATA1)

/** \brief  1DC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO110_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029DC8u)

/** Alias (User Manual Name) for CAN1_MO110_EDATA2.
* To use register names with standard convension, please use CAN1_MO110_EDATA2.
*/
#define	CAN1_EMO110DATA2	(CAN1_MO110_EDATA2)

/** \brief  1DCC, Message Object  Acceptance Mask Register */
#define CAN1_MO110_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029DCCu)

/** Alias (User Manual Name) for CAN1_MO110_EDATA3.
* To use register names with standard convension, please use CAN1_MO110_EDATA3.
*/
#define	CAN1_EMO110DATA3	(CAN1_MO110_EDATA3)

/** \brief  1DD0, Message Object  Data Register Low */
#define CAN1_MO110_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029DD0u)

/** Alias (User Manual Name) for CAN1_MO110_EDATA4.
* To use register names with standard convension, please use CAN1_MO110_EDATA4.
*/
#define	CAN1_EMO110DATA4	(CAN1_MO110_EDATA4)

/** \brief  1DD4, Message Object  Data Register High */
#define CAN1_MO110_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029DD4u)

/** Alias (User Manual Name) for CAN1_MO110_EDATA5.
* To use register names with standard convension, please use CAN1_MO110_EDATA5.
*/
#define	CAN1_EMO110DATA5	(CAN1_MO110_EDATA5)

/** \brief  1DD8, Message Object  Arbitration Register */
#define CAN1_MO110_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029DD8u)

/** Alias (User Manual Name) for CAN1_MO110_EDATA6.
* To use register names with standard convension, please use CAN1_MO110_EDATA6.
*/
#define	CAN1_EMO110DATA6	(CAN1_MO110_EDATA6)

/** \brief  1DC0, Message Object  Function Control Register */
#define CAN1_MO110_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029DC0u)

/** Alias (User Manual Name) for CAN1_MO110_FCR.
* To use register names with standard convension, please use CAN1_MO110_FCR.
*/
#define	CAN1_MOFCR110	(CAN1_MO110_FCR)

/** \brief  1DC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO110_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029DC4u)

/** Alias (User Manual Name) for CAN1_MO110_FGPR.
* To use register names with standard convension, please use CAN1_MO110_FGPR.
*/
#define	CAN1_MOFGPR110	(CAN1_MO110_FGPR)

/** \brief  1DC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO110_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029DC8u)

/** Alias (User Manual Name) for CAN1_MO110_IPR.
* To use register names with standard convension, please use CAN1_MO110_IPR.
*/
#define	CAN1_MOIPR110	(CAN1_MO110_IPR)

/** \brief  1DDC, Message Object  Control Register */
#define CAN1_MO110_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029DDCu)

/** Alias (User Manual Name) for CAN1_MO110_STAT.
* To use register names with standard convension, please use CAN1_MO110_STAT.
*/
#define	CAN1_MOSTAT110	(CAN1_MO110_STAT)

