leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1E38, Message Object  Arbitration Register */
#define CAN1_MO113_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029E38u)

/** Alias (User Manual Name) for CAN1_MO113_EDATA6.
* To use register names with standard convension, please use CAN1_MO113_EDATA6.
*/
#define	CAN1_EMO113DATA6	(CAN1_MO113_EDATA6)

/** \brief  1E20, Message Object  Function Control Register */
#define CAN1_MO113_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E20u)

/** Alias (User Manual Name) for CAN1_MO113_FCR.
* To use register names with standard convension, please use CAN1_MO113_FCR.
*/
#define	CAN1_MOFCR113	(CAN1_MO113_FCR)

/** \brief  1E24, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO113_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E24u)

/** Alias (User Manual Name) for CAN1_MO113_FGPR.
* To use register names with standard convension, please use CAN1_MO113_FGPR.
*/
#define	CAN1_MOFGPR113	(CAN1_MO113_FGPR)

/** \brief  1E28, Message Object  Interrupt Pointer Register */
#define CAN1_MO113_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E28u)

/** Alias (User Manual Name) for CAN1_MO113_IPR.
* To use register names with standard convension, please use CAN1_MO113_IPR.
*/
#define	CAN1_MOIPR113	(CAN1_MO113_IPR)

/** \brief  1E3C, Message Object  Control Register */
#define CAN1_MO113_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E3Cu)

/** Alias (User Manual Name) for CAN1_MO113_STAT.
* To use register names with standard convension, please use CAN1_MO113_STAT.
*/
#define	CAN1_MOSTAT113	(CAN1_MO113_STAT)

/** \brief  1E4C, Message Object  Acceptance Mask Register */
#define CAN1_MO114_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E4Cu)

/** Alias (User Manual Name) for CAN1_MO114_AMR.
* To use register names with standard convension, please use CAN1_MO114_AMR.
*/
#define	CAN1_MOAMR114	(CAN1_MO114_AMR)

/** \brief  1E58, Message Object  Arbitration Register */
#define CAN1_MO114_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E58u)

/** Alias (User Manual Name) for CAN1_MO114_AR.
* To use register names with standard convension, please use CAN1_MO114_AR.
*/
#define	CAN1_MOAR114	(CAN1_MO114_AR)

/** \brief  1E5C, Message Object  Control Register */
#define CAN1_MO114_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029E5Cu)

/** Alias (User Manual Name) for CAN1_MO114_CTR.
* To use register names with standard convension, please use CAN1_MO114_CTR.
*/
#define	CAN1_MOCTR114	(CAN1_MO114_CTR)

/** \brief  1E54, Message Object  Data Register High */
#define CAN1_MO114_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E54u)

/** Alias (User Manual Name) for CAN1_MO114_DATAH.
* To use register names with standard convension, please use CAN1_MO114_DATAH.
*/
#define	CAN1_MODATAH114	(CAN1_MO114_DATAH)

/** \brief  1E50, Message Object  Data Register Low */
#define CAN1_MO114_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E50u)

/** Alias (User Manual Name) for CAN1_MO114_DATAL.
* To use register names with standard convension, please use CAN1_MO114_DATAL.
*/
#define	CAN1_MODATAL114	(CAN1_MO114_DATAL)

/** \brief  1E40, Message Object  Function Control Register */
#define CAN1_MO114_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029E40u)

/** Alias (User Manual Name) for CAN1_MO114_EDATA0.
* To use register names with standard convension, please use CAN1_MO114_EDATA0.
*/
#define	CAN1_EMO114DATA0	(CAN1_MO114_EDATA0)

/** \brief  1E44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO114_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029E44u)

/** Alias (User Manual Name) for CAN1_MO114_EDATA1.
* To use register names with standard convension, please use CAN1_MO114_EDATA1.
*/
#define	CAN1_EMO114DATA1	(CAN1_MO114_EDATA1)

/** \brief  1E48, Message Object  Interrupt Pointer Register */
#define CAN1_MO114_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029E48u)

/** Alias (User Manual Name) for CAN1_MO114_EDATA2.
* To use register names with standard convension, please use CAN1_MO114_EDATA2.
*/
#define	CAN1_EMO114DATA2	(CAN1_MO114_EDATA2)

/** \brief  1E4C, Message Object  Acceptance Mask Register */
#define CAN1_MO114_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029E4Cu)

/** Alias (User Manual Name) for CAN1_MO114_EDATA3.
* To use register names with standard convension, please use CAN1_MO114_EDATA3.
*/
#define	CAN1_EMO114DATA3	(CAN1_MO114_EDATA3)

/** \brief  1E50, Message Object  Data Register Low */
#define CAN1_MO114_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029E50u)

/** Alias (User Manual Name) for CAN1_MO114_EDATA4.
* To use register names with standard convension, please use CAN1_MO114_EDATA4.
*/
#define	CAN1_EMO114DATA4	(CAN1_MO114_EDATA4)

/** \brief  1E54, Message Object  Data Register High */
#define CAN1_MO114_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029E54u)

/** Alias (User Manual Name) for CAN1_MO114_EDATA5.
* To use register names with standard convension, please use CAN1_MO114_EDATA5.
*/
#define	CAN1_EMO114DATA5	(CAN1_MO114_EDATA5)

/** \brief  1E58, Message Object  Arbitration Register */
#define CAN1_MO114_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029E58u)

/** Alias (User Manual Name) for CAN1_MO114_EDATA6.
* To use register names with standard convension, please use CAN1_MO114_EDATA6.
*/
#define	CAN1_EMO114DATA6	(CAN1_MO114_EDATA6)

/** \brief  1E40, Message Object  Function Control Register */
#define CAN1_MO114_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E40u)

/** Alias (User Manual Name) for CAN1_MO114_FCR.
* To use register names with standard convension, please use CAN1_MO114_FCR.
*/
#define	CAN1_MOFCR114	(CAN1_MO114_FCR)

/** \brief  1E44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO114_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E44u)

/** Alias (User Manual Name) for CAN1_MO114_FGPR.
* To use register names with standard convension, please use CAN1_MO114_FGPR.
*/
#define	CAN1_MOFGPR114	(CAN1_MO114_FGPR)

/** \brief  1E48, Message Object  Interrupt Pointer Register */
#define CAN1_MO114_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E48u)

/** Alias (User Manual Name) for CAN1_MO114_IPR.
* To use register names with standard convension, please use CAN1_MO114_IPR.
*/
#define	CAN1_MOIPR114	(CAN1_MO114_IPR)

/** \brief  1E5C, Message Object  Control Register */
#define CAN1_MO114_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E5Cu)

/** Alias (User Manual Name) for CAN1_MO114_STAT.
* To use register names with standard convension, please use CAN1_MO114_STAT.
*/
#define	CAN1_MOSTAT114	(CAN1_MO114_STAT)

