leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1E6C, Message Object  Acceptance Mask Register */
#define CAN1_MO115_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E6Cu)

/** Alias (User Manual Name) for CAN1_MO115_AMR.
* To use register names with standard convension, please use CAN1_MO115_AMR.
*/
#define	CAN1_MOAMR115	(CAN1_MO115_AMR)

/** \brief  1E78, Message Object  Arbitration Register */
#define CAN1_MO115_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E78u)

/** Alias (User Manual Name) for CAN1_MO115_AR.
* To use register names with standard convension, please use CAN1_MO115_AR.
*/
#define	CAN1_MOAR115	(CAN1_MO115_AR)

/** \brief  1E7C, Message Object  Control Register */
#define CAN1_MO115_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029E7Cu)

/** Alias (User Manual Name) for CAN1_MO115_CTR.
* To use register names with standard convension, please use CAN1_MO115_CTR.
*/
#define	CAN1_MOCTR115	(CAN1_MO115_CTR)

/** \brief  1E74, Message Object  Data Register High */
#define CAN1_MO115_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E74u)

/** Alias (User Manual Name) for CAN1_MO115_DATAH.
* To use register names with standard convension, please use CAN1_MO115_DATAH.
*/
#define	CAN1_MODATAH115	(CAN1_MO115_DATAH)

/** \brief  1E70, Message Object  Data Register Low */
#define CAN1_MO115_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E70u)

/** Alias (User Manual Name) for CAN1_MO115_DATAL.
* To use register names with standard convension, please use CAN1_MO115_DATAL.
*/
#define	CAN1_MODATAL115	(CAN1_MO115_DATAL)

/** \brief  1E60, Message Object  Function Control Register */
#define CAN1_MO115_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029E60u)

/** Alias (User Manual Name) for CAN1_MO115_EDATA0.
* To use register names with standard convension, please use CAN1_MO115_EDATA0.
*/
#define	CAN1_EMO115DATA0	(CAN1_MO115_EDATA0)

/** \brief  1E64, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO115_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029E64u)

/** Alias (User Manual Name) for CAN1_MO115_EDATA1.
* To use register names with standard convension, please use CAN1_MO115_EDATA1.
*/
#define	CAN1_EMO115DATA1	(CAN1_MO115_EDATA1)

/** \brief  1E68, Message Object  Interrupt Pointer Register */
#define CAN1_MO115_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029E68u)

/** Alias (User Manual Name) for CAN1_MO115_EDATA2.
* To use register names with standard convension, please use CAN1_MO115_EDATA2.
*/
#define	CAN1_EMO115DATA2	(CAN1_MO115_EDATA2)

/** \brief  1E6C, Message Object  Acceptance Mask Register */
#define CAN1_MO115_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029E6Cu)

/** Alias (User Manual Name) for CAN1_MO115_EDATA3.
* To use register names with standard convension, please use CAN1_MO115_EDATA3.
*/
#define	CAN1_EMO115DATA3	(CAN1_MO115_EDATA3)

/** \brief  1E70, Message Object  Data Register Low */
#define CAN1_MO115_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029E70u)

/** Alias (User Manual Name) for CAN1_MO115_EDATA4.
* To use register names with standard convension, please use CAN1_MO115_EDATA4.
*/
#define	CAN1_EMO115DATA4	(CAN1_MO115_EDATA4)

/** \brief  1E74, Message Object  Data Register High */
#define CAN1_MO115_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029E74u)

/** Alias (User Manual Name) for CAN1_MO115_EDATA5.
* To use register names with standard convension, please use CAN1_MO115_EDATA5.
*/
#define	CAN1_EMO115DATA5	(CAN1_MO115_EDATA5)

/** \brief  1E78, Message Object  Arbitration Register */
#define CAN1_MO115_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029E78u)

/** Alias (User Manual Name) for CAN1_MO115_EDATA6.
* To use register names with standard convension, please use CAN1_MO115_EDATA6.
*/
#define	CAN1_EMO115DATA6	(CAN1_MO115_EDATA6)

/** \brief  1E60, Message Object  Function Control Register */
#define CAN1_MO115_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E60u)

/** Alias (User Manual Name) for CAN1_MO115_FCR.
* To use register names with standard convension, please use CAN1_MO115_FCR.
*/
#define	CAN1_MOFCR115	(CAN1_MO115_FCR)

/** \brief  1E64, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO115_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E64u)

/** Alias (User Manual Name) for CAN1_MO115_FGPR.
* To use register names with standard convension, please use CAN1_MO115_FGPR.
*/
#define	CAN1_MOFGPR115	(CAN1_MO115_FGPR)

/** \brief  1E68, Message Object  Interrupt Pointer Register */
#define CAN1_MO115_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E68u)

/** Alias (User Manual Name) for CAN1_MO115_IPR.
* To use register names with standard convension, please use CAN1_MO115_IPR.
*/
#define	CAN1_MOIPR115	(CAN1_MO115_IPR)

/** \brief  1E7C, Message Object  Control Register */
#define CAN1_MO115_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E7Cu)

/** Alias (User Manual Name) for CAN1_MO115_STAT.
* To use register names with standard convension, please use CAN1_MO115_STAT.
*/
#define	CAN1_MOSTAT115	(CAN1_MO115_STAT)

/** \brief  1E8C, Message Object  Acceptance Mask Register */
#define CAN1_MO116_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E8Cu)

/** Alias (User Manual Name) for CAN1_MO116_AMR.
* To use register names with standard convension, please use CAN1_MO116_AMR.
*/
#define	CAN1_MOAMR116	(CAN1_MO116_AMR)

/** \brief  1E98, Message Object  Arbitration Register */
#define CAN1_MO116_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E98u)

/** Alias (User Manual Name) for CAN1_MO116_AR.
* To use register names with standard convension, please use CAN1_MO116_AR.
*/
#define	CAN1_MOAR116	(CAN1_MO116_AR)

/** \brief  1E9C, Message Object  Control Register */
#define CAN1_MO116_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029E9Cu)

/** Alias (User Manual Name) for CAN1_MO116_CTR.
* To use register names with standard convension, please use CAN1_MO116_CTR.
*/
#define	CAN1_MOCTR116	(CAN1_MO116_CTR)

/** \brief  1E94, Message Object  Data Register High */
#define CAN1_MO116_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E94u)

/** Alias (User Manual Name) for CAN1_MO116_DATAH.
* To use register names with standard convension, please use CAN1_MO116_DATAH.
*/
#define	CAN1_MODATAH116	(CAN1_MO116_DATAH)

/** \brief  1E90, Message Object  Data Register Low */
#define CAN1_MO116_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E90u)

/** Alias (User Manual Name) for CAN1_MO116_DATAL.
* To use register names with standard convension, please use CAN1_MO116_DATAL.
*/
#define	CAN1_MODATAL116	(CAN1_MO116_DATAL)

