leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1E80, Message Object  Function Control Register */
#define CAN1_MO116_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029E80u)

/** Alias (User Manual Name) for CAN1_MO116_EDATA0.
* To use register names with standard convension, please use CAN1_MO116_EDATA0.
*/
#define	CAN1_EMO116DATA0	(CAN1_MO116_EDATA0)

/** \brief  1E84, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO116_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029E84u)

/** Alias (User Manual Name) for CAN1_MO116_EDATA1.
* To use register names with standard convension, please use CAN1_MO116_EDATA1.
*/
#define	CAN1_EMO116DATA1	(CAN1_MO116_EDATA1)

/** \brief  1E88, Message Object  Interrupt Pointer Register */
#define CAN1_MO116_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029E88u)

/** Alias (User Manual Name) for CAN1_MO116_EDATA2.
* To use register names with standard convension, please use CAN1_MO116_EDATA2.
*/
#define	CAN1_EMO116DATA2	(CAN1_MO116_EDATA2)

/** \brief  1E8C, Message Object  Acceptance Mask Register */
#define CAN1_MO116_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029E8Cu)

/** Alias (User Manual Name) for CAN1_MO116_EDATA3.
* To use register names with standard convension, please use CAN1_MO116_EDATA3.
*/
#define	CAN1_EMO116DATA3	(CAN1_MO116_EDATA3)

/** \brief  1E90, Message Object  Data Register Low */
#define CAN1_MO116_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029E90u)

/** Alias (User Manual Name) for CAN1_MO116_EDATA4.
* To use register names with standard convension, please use CAN1_MO116_EDATA4.
*/
#define	CAN1_EMO116DATA4	(CAN1_MO116_EDATA4)

/** \brief  1E94, Message Object  Data Register High */
#define CAN1_MO116_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029E94u)

/** Alias (User Manual Name) for CAN1_MO116_EDATA5.
* To use register names with standard convension, please use CAN1_MO116_EDATA5.
*/
#define	CAN1_EMO116DATA5	(CAN1_MO116_EDATA5)

/** \brief  1E98, Message Object  Arbitration Register */
#define CAN1_MO116_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029E98u)

/** Alias (User Manual Name) for CAN1_MO116_EDATA6.
* To use register names with standard convension, please use CAN1_MO116_EDATA6.
*/
#define	CAN1_EMO116DATA6	(CAN1_MO116_EDATA6)

/** \brief  1E80, Message Object  Function Control Register */
#define CAN1_MO116_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E80u)

/** Alias (User Manual Name) for CAN1_MO116_FCR.
* To use register names with standard convension, please use CAN1_MO116_FCR.
*/
#define	CAN1_MOFCR116	(CAN1_MO116_FCR)

/** \brief  1E84, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO116_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E84u)

/** Alias (User Manual Name) for CAN1_MO116_FGPR.
* To use register names with standard convension, please use CAN1_MO116_FGPR.
*/
#define	CAN1_MOFGPR116	(CAN1_MO116_FGPR)

/** \brief  1E88, Message Object  Interrupt Pointer Register */
#define CAN1_MO116_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E88u)

/** Alias (User Manual Name) for CAN1_MO116_IPR.
* To use register names with standard convension, please use CAN1_MO116_IPR.
*/
#define	CAN1_MOIPR116	(CAN1_MO116_IPR)

/** \brief  1E9C, Message Object  Control Register */
#define CAN1_MO116_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E9Cu)

/** Alias (User Manual Name) for CAN1_MO116_STAT.
* To use register names with standard convension, please use CAN1_MO116_STAT.
*/
#define	CAN1_MOSTAT116	(CAN1_MO116_STAT)

/** \brief  1EAC, Message Object  Acceptance Mask Register */
#define CAN1_MO117_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029EACu)

/** Alias (User Manual Name) for CAN1_MO117_AMR.
* To use register names with standard convension, please use CAN1_MO117_AMR.
*/
#define	CAN1_MOAMR117	(CAN1_MO117_AMR)

/** \brief  1EB8, Message Object  Arbitration Register */
#define CAN1_MO117_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029EB8u)

/** Alias (User Manual Name) for CAN1_MO117_AR.
* To use register names with standard convension, please use CAN1_MO117_AR.
*/
#define	CAN1_MOAR117	(CAN1_MO117_AR)

/** \brief  1EBC, Message Object  Control Register */
#define CAN1_MO117_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029EBCu)

/** Alias (User Manual Name) for CAN1_MO117_CTR.
* To use register names with standard convension, please use CAN1_MO117_CTR.
*/
#define	CAN1_MOCTR117	(CAN1_MO117_CTR)

/** \brief  1EB4, Message Object  Data Register High */
#define CAN1_MO117_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029EB4u)

/** Alias (User Manual Name) for CAN1_MO117_DATAH.
* To use register names with standard convension, please use CAN1_MO117_DATAH.
*/
#define	CAN1_MODATAH117	(CAN1_MO117_DATAH)

/** \brief  1EB0, Message Object  Data Register Low */
#define CAN1_MO117_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029EB0u)

/** Alias (User Manual Name) for CAN1_MO117_DATAL.
* To use register names with standard convension, please use CAN1_MO117_DATAL.
*/
#define	CAN1_MODATAL117	(CAN1_MO117_DATAL)

/** \brief  1EA0, Message Object  Function Control Register */
#define CAN1_MO117_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029EA0u)

/** Alias (User Manual Name) for CAN1_MO117_EDATA0.
* To use register names with standard convension, please use CAN1_MO117_EDATA0.
*/
#define	CAN1_EMO117DATA0	(CAN1_MO117_EDATA0)

/** \brief  1EA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO117_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029EA4u)

/** Alias (User Manual Name) for CAN1_MO117_EDATA1.
* To use register names with standard convension, please use CAN1_MO117_EDATA1.
*/
#define	CAN1_EMO117DATA1	(CAN1_MO117_EDATA1)

/** \brief  1EA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO117_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029EA8u)

/** Alias (User Manual Name) for CAN1_MO117_EDATA2.
* To use register names with standard convension, please use CAN1_MO117_EDATA2.
*/
#define	CAN1_EMO117DATA2	(CAN1_MO117_EDATA2)

/** \brief  1EAC, Message Object  Acceptance Mask Register */
#define CAN1_MO117_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029EACu)

/** Alias (User Manual Name) for CAN1_MO117_EDATA3.
* To use register names with standard convension, please use CAN1_MO117_EDATA3.
*/
#define	CAN1_EMO117DATA3	(CAN1_MO117_EDATA3)

