leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1EEC, Message Object  Acceptance Mask Register */
#define CAN1_MO119_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029EECu)

/** Alias (User Manual Name) for CAN1_MO119_AMR.
* To use register names with standard convension, please use CAN1_MO119_AMR.
*/
#define	CAN1_MOAMR119	(CAN1_MO119_AMR)

/** \brief  1EF8, Message Object  Arbitration Register */
#define CAN1_MO119_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029EF8u)

/** Alias (User Manual Name) for CAN1_MO119_AR.
* To use register names with standard convension, please use CAN1_MO119_AR.
*/
#define	CAN1_MOAR119	(CAN1_MO119_AR)

/** \brief  1EFC, Message Object  Control Register */
#define CAN1_MO119_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029EFCu)

/** Alias (User Manual Name) for CAN1_MO119_CTR.
* To use register names with standard convension, please use CAN1_MO119_CTR.
*/
#define	CAN1_MOCTR119	(CAN1_MO119_CTR)

/** \brief  1EF4, Message Object  Data Register High */
#define CAN1_MO119_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029EF4u)

/** Alias (User Manual Name) for CAN1_MO119_DATAH.
* To use register names with standard convension, please use CAN1_MO119_DATAH.
*/
#define	CAN1_MODATAH119	(CAN1_MO119_DATAH)

/** \brief  1EF0, Message Object  Data Register Low */
#define CAN1_MO119_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029EF0u)

/** Alias (User Manual Name) for CAN1_MO119_DATAL.
* To use register names with standard convension, please use CAN1_MO119_DATAL.
*/
#define	CAN1_MODATAL119	(CAN1_MO119_DATAL)

/** \brief  1EE0, Message Object  Function Control Register */
#define CAN1_MO119_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029EE0u)

/** Alias (User Manual Name) for CAN1_MO119_EDATA0.
* To use register names with standard convension, please use CAN1_MO119_EDATA0.
*/
#define	CAN1_EMO119DATA0	(CAN1_MO119_EDATA0)

/** \brief  1EE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO119_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029EE4u)

/** Alias (User Manual Name) for CAN1_MO119_EDATA1.
* To use register names with standard convension, please use CAN1_MO119_EDATA1.
*/
#define	CAN1_EMO119DATA1	(CAN1_MO119_EDATA1)

/** \brief  1EE8, Message Object  Interrupt Pointer Register */
#define CAN1_MO119_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029EE8u)

/** Alias (User Manual Name) for CAN1_MO119_EDATA2.
* To use register names with standard convension, please use CAN1_MO119_EDATA2.
*/
#define	CAN1_EMO119DATA2	(CAN1_MO119_EDATA2)

/** \brief  1EEC, Message Object  Acceptance Mask Register */
#define CAN1_MO119_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029EECu)

/** Alias (User Manual Name) for CAN1_MO119_EDATA3.
* To use register names with standard convension, please use CAN1_MO119_EDATA3.
*/
#define	CAN1_EMO119DATA3	(CAN1_MO119_EDATA3)

/** \brief  1EF0, Message Object  Data Register Low */
#define CAN1_MO119_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029EF0u)

/** Alias (User Manual Name) for CAN1_MO119_EDATA4.
* To use register names with standard convension, please use CAN1_MO119_EDATA4.
*/
#define	CAN1_EMO119DATA4	(CAN1_MO119_EDATA4)

/** \brief  1EF4, Message Object  Data Register High */
#define CAN1_MO119_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029EF4u)

/** Alias (User Manual Name) for CAN1_MO119_EDATA5.
* To use register names with standard convension, please use CAN1_MO119_EDATA5.
*/
#define	CAN1_EMO119DATA5	(CAN1_MO119_EDATA5)

/** \brief  1EF8, Message Object  Arbitration Register */
#define CAN1_MO119_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029EF8u)

/** Alias (User Manual Name) for CAN1_MO119_EDATA6.
* To use register names with standard convension, please use CAN1_MO119_EDATA6.
*/
#define	CAN1_EMO119DATA6	(CAN1_MO119_EDATA6)

/** \brief  1EE0, Message Object  Function Control Register */
#define CAN1_MO119_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029EE0u)

/** Alias (User Manual Name) for CAN1_MO119_FCR.
* To use register names with standard convension, please use CAN1_MO119_FCR.
*/
#define	CAN1_MOFCR119	(CAN1_MO119_FCR)

/** \brief  1EE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO119_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029EE4u)

/** Alias (User Manual Name) for CAN1_MO119_FGPR.
* To use register names with standard convension, please use CAN1_MO119_FGPR.
*/
#define	CAN1_MOFGPR119	(CAN1_MO119_FGPR)

/** \brief  1EE8, Message Object  Interrupt Pointer Register */
#define CAN1_MO119_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029EE8u)

/** Alias (User Manual Name) for CAN1_MO119_IPR.
* To use register names with standard convension, please use CAN1_MO119_IPR.
*/
#define	CAN1_MOIPR119	(CAN1_MO119_IPR)

/** \brief  1EFC, Message Object  Control Register */
#define CAN1_MO119_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029EFCu)

/** Alias (User Manual Name) for CAN1_MO119_STAT.
* To use register names with standard convension, please use CAN1_MO119_STAT.
*/
#define	CAN1_MOSTAT119	(CAN1_MO119_STAT)

/** \brief  116C, Message Object  Acceptance Mask Register */
#define CAN1_MO11_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002916Cu)

/** Alias (User Manual Name) for CAN1_MO11_AMR.
* To use register names with standard convension, please use CAN1_MO11_AMR.
*/
#define	CAN1_MOAMR11	(CAN1_MO11_AMR)

/** \brief  1178, Message Object  Arbitration Register */
#define CAN1_MO11_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029178u)

/** Alias (User Manual Name) for CAN1_MO11_AR.
* To use register names with standard convension, please use CAN1_MO11_AR.
*/
#define	CAN1_MOAR11	(CAN1_MO11_AR)

/** \brief  117C, Message Object  Control Register */
#define CAN1_MO11_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002917Cu)

/** Alias (User Manual Name) for CAN1_MO11_CTR.
* To use register names with standard convension, please use CAN1_MO11_CTR.
*/
#define	CAN1_MOCTR11	(CAN1_MO11_CTR)

/** \brief  1174, Message Object  Data Register High */
#define CAN1_MO11_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029174u)

/** Alias (User Manual Name) for CAN1_MO11_DATAH.
* To use register names with standard convension, please use CAN1_MO11_DATAH.
*/
#define	CAN1_MODATAH11	(CAN1_MO11_DATAH)

/** \brief  1170, Message Object  Data Register Low */
#define CAN1_MO11_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029170u)

/** Alias (User Manual Name) for CAN1_MO11_DATAL.
* To use register names with standard convension, please use CAN1_MO11_DATAL.
*/
#define	CAN1_MODATAL11	(CAN1_MO11_DATAL)

/** \brief  1160, Message Object  Function Control Register */
#define CAN1_MO11_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029160u)

/** Alias (User Manual Name) for CAN1_MO11_EDATA0.
* To use register names with standard convension, please use CAN1_MO11_EDATA0.
*/
#define	CAN1_EMO11DATA0	(CAN1_MO11_EDATA0)

/** \brief  1164, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO11_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029164u)

