leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO120_EDATA4.
* To use register names with standard convension, please use CAN1_MO120_EDATA4.
*/
#define	CAN1_EMO120DATA4	(CAN1_MO120_EDATA4)

/** \brief  1F14, Message Object  Data Register High */
#define CAN1_MO120_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029F14u)

/** Alias (User Manual Name) for CAN1_MO120_EDATA5.
* To use register names with standard convension, please use CAN1_MO120_EDATA5.
*/
#define	CAN1_EMO120DATA5	(CAN1_MO120_EDATA5)

/** \brief  1F18, Message Object  Arbitration Register */
#define CAN1_MO120_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029F18u)

/** Alias (User Manual Name) for CAN1_MO120_EDATA6.
* To use register names with standard convension, please use CAN1_MO120_EDATA6.
*/
#define	CAN1_EMO120DATA6	(CAN1_MO120_EDATA6)

/** \brief  1F00, Message Object  Function Control Register */
#define CAN1_MO120_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F00u)

/** Alias (User Manual Name) for CAN1_MO120_FCR.
* To use register names with standard convension, please use CAN1_MO120_FCR.
*/
#define	CAN1_MOFCR120	(CAN1_MO120_FCR)

/** \brief  1F04, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO120_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F04u)

/** Alias (User Manual Name) for CAN1_MO120_FGPR.
* To use register names with standard convension, please use CAN1_MO120_FGPR.
*/
#define	CAN1_MOFGPR120	(CAN1_MO120_FGPR)

/** \brief  1F08, Message Object  Interrupt Pointer Register */
#define CAN1_MO120_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F08u)

/** Alias (User Manual Name) for CAN1_MO120_IPR.
* To use register names with standard convension, please use CAN1_MO120_IPR.
*/
#define	CAN1_MOIPR120	(CAN1_MO120_IPR)

/** \brief  1F1C, Message Object  Control Register */
#define CAN1_MO120_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029F1Cu)

/** Alias (User Manual Name) for CAN1_MO120_STAT.
* To use register names with standard convension, please use CAN1_MO120_STAT.
*/
#define	CAN1_MOSTAT120	(CAN1_MO120_STAT)

/** \brief  1F2C, Message Object  Acceptance Mask Register */
#define CAN1_MO121_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F2Cu)

/** Alias (User Manual Name) for CAN1_MO121_AMR.
* To use register names with standard convension, please use CAN1_MO121_AMR.
*/
#define	CAN1_MOAMR121	(CAN1_MO121_AMR)

/** \brief  1F38, Message Object  Arbitration Register */
#define CAN1_MO121_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F38u)

/** Alias (User Manual Name) for CAN1_MO121_AR.
* To use register names with standard convension, please use CAN1_MO121_AR.
*/
#define	CAN1_MOAR121	(CAN1_MO121_AR)

/** \brief  1F3C, Message Object  Control Register */
#define CAN1_MO121_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029F3Cu)

/** Alias (User Manual Name) for CAN1_MO121_CTR.
* To use register names with standard convension, please use CAN1_MO121_CTR.
*/
#define	CAN1_MOCTR121	(CAN1_MO121_CTR)

/** \brief  1F34, Message Object  Data Register High */
#define CAN1_MO121_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F34u)

/** Alias (User Manual Name) for CAN1_MO121_DATAH.
* To use register names with standard convension, please use CAN1_MO121_DATAH.
*/
#define	CAN1_MODATAH121	(CAN1_MO121_DATAH)

/** \brief  1F30, Message Object  Data Register Low */
#define CAN1_MO121_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F30u)

/** Alias (User Manual Name) for CAN1_MO121_DATAL.
* To use register names with standard convension, please use CAN1_MO121_DATAL.
*/
#define	CAN1_MODATAL121	(CAN1_MO121_DATAL)

/** \brief  1F20, Message Object  Function Control Register */
#define CAN1_MO121_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029F20u)

/** Alias (User Manual Name) for CAN1_MO121_EDATA0.
* To use register names with standard convension, please use CAN1_MO121_EDATA0.
*/
#define	CAN1_EMO121DATA0	(CAN1_MO121_EDATA0)

/** \brief  1F24, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO121_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029F24u)

/** Alias (User Manual Name) for CAN1_MO121_EDATA1.
* To use register names with standard convension, please use CAN1_MO121_EDATA1.
*/
#define	CAN1_EMO121DATA1	(CAN1_MO121_EDATA1)

/** \brief  1F28, Message Object  Interrupt Pointer Register */
#define CAN1_MO121_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029F28u)

/** Alias (User Manual Name) for CAN1_MO121_EDATA2.
* To use register names with standard convension, please use CAN1_MO121_EDATA2.
*/
#define	CAN1_EMO121DATA2	(CAN1_MO121_EDATA2)

/** \brief  1F2C, Message Object  Acceptance Mask Register */
#define CAN1_MO121_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029F2Cu)

/** Alias (User Manual Name) for CAN1_MO121_EDATA3.
* To use register names with standard convension, please use CAN1_MO121_EDATA3.
*/
#define	CAN1_EMO121DATA3	(CAN1_MO121_EDATA3)

/** \brief  1F30, Message Object  Data Register Low */
#define CAN1_MO121_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029F30u)

/** Alias (User Manual Name) for CAN1_MO121_EDATA4.
* To use register names with standard convension, please use CAN1_MO121_EDATA4.
*/
#define	CAN1_EMO121DATA4	(CAN1_MO121_EDATA4)

/** \brief  1F34, Message Object  Data Register High */
#define CAN1_MO121_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029F34u)

/** Alias (User Manual Name) for CAN1_MO121_EDATA5.
* To use register names with standard convension, please use CAN1_MO121_EDATA5.
*/
#define	CAN1_EMO121DATA5	(CAN1_MO121_EDATA5)

/** \brief  1F38, Message Object  Arbitration Register */
#define CAN1_MO121_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029F38u)

/** Alias (User Manual Name) for CAN1_MO121_EDATA6.
* To use register names with standard convension, please use CAN1_MO121_EDATA6.
*/
#define	CAN1_EMO121DATA6	(CAN1_MO121_EDATA6)

/** \brief  1F20, Message Object  Function Control Register */
#define CAN1_MO121_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F20u)

