leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO121_FCR.
* To use register names with standard convension, please use CAN1_MO121_FCR.
*/
#define	CAN1_MOFCR121	(CAN1_MO121_FCR)

/** \brief  1F24, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO121_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F24u)

/** Alias (User Manual Name) for CAN1_MO121_FGPR.
* To use register names with standard convension, please use CAN1_MO121_FGPR.
*/
#define	CAN1_MOFGPR121	(CAN1_MO121_FGPR)

/** \brief  1F28, Message Object  Interrupt Pointer Register */
#define CAN1_MO121_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F28u)

/** Alias (User Manual Name) for CAN1_MO121_IPR.
* To use register names with standard convension, please use CAN1_MO121_IPR.
*/
#define	CAN1_MOIPR121	(CAN1_MO121_IPR)

/** \brief  1F3C, Message Object  Control Register */
#define CAN1_MO121_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029F3Cu)

/** Alias (User Manual Name) for CAN1_MO121_STAT.
* To use register names with standard convension, please use CAN1_MO121_STAT.
*/
#define	CAN1_MOSTAT121	(CAN1_MO121_STAT)

/** \brief  1F4C, Message Object  Acceptance Mask Register */
#define CAN1_MO122_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F4Cu)

/** Alias (User Manual Name) for CAN1_MO122_AMR.
* To use register names with standard convension, please use CAN1_MO122_AMR.
*/
#define	CAN1_MOAMR122	(CAN1_MO122_AMR)

/** \brief  1F58, Message Object  Arbitration Register */
#define CAN1_MO122_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F58u)

/** Alias (User Manual Name) for CAN1_MO122_AR.
* To use register names with standard convension, please use CAN1_MO122_AR.
*/
#define	CAN1_MOAR122	(CAN1_MO122_AR)

/** \brief  1F5C, Message Object  Control Register */
#define CAN1_MO122_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029F5Cu)

/** Alias (User Manual Name) for CAN1_MO122_CTR.
* To use register names with standard convension, please use CAN1_MO122_CTR.
*/
#define	CAN1_MOCTR122	(CAN1_MO122_CTR)

/** \brief  1F54, Message Object  Data Register High */
#define CAN1_MO122_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F54u)

/** Alias (User Manual Name) for CAN1_MO122_DATAH.
* To use register names with standard convension, please use CAN1_MO122_DATAH.
*/
#define	CAN1_MODATAH122	(CAN1_MO122_DATAH)

/** \brief  1F50, Message Object  Data Register Low */
#define CAN1_MO122_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F50u)

/** Alias (User Manual Name) for CAN1_MO122_DATAL.
* To use register names with standard convension, please use CAN1_MO122_DATAL.
*/
#define	CAN1_MODATAL122	(CAN1_MO122_DATAL)

/** \brief  1F40, Message Object  Function Control Register */
#define CAN1_MO122_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029F40u)

/** Alias (User Manual Name) for CAN1_MO122_EDATA0.
* To use register names with standard convension, please use CAN1_MO122_EDATA0.
*/
#define	CAN1_EMO122DATA0	(CAN1_MO122_EDATA0)

/** \brief  1F44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO122_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029F44u)

/** Alias (User Manual Name) for CAN1_MO122_EDATA1.
* To use register names with standard convension, please use CAN1_MO122_EDATA1.
*/
#define	CAN1_EMO122DATA1	(CAN1_MO122_EDATA1)

/** \brief  1F48, Message Object  Interrupt Pointer Register */
#define CAN1_MO122_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029F48u)

/** Alias (User Manual Name) for CAN1_MO122_EDATA2.
* To use register names with standard convension, please use CAN1_MO122_EDATA2.
*/
#define	CAN1_EMO122DATA2	(CAN1_MO122_EDATA2)

/** \brief  1F4C, Message Object  Acceptance Mask Register */
#define CAN1_MO122_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029F4Cu)

/** Alias (User Manual Name) for CAN1_MO122_EDATA3.
* To use register names with standard convension, please use CAN1_MO122_EDATA3.
*/
#define	CAN1_EMO122DATA3	(CAN1_MO122_EDATA3)

/** \brief  1F50, Message Object  Data Register Low */
#define CAN1_MO122_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029F50u)

/** Alias (User Manual Name) for CAN1_MO122_EDATA4.
* To use register names with standard convension, please use CAN1_MO122_EDATA4.
*/
#define	CAN1_EMO122DATA4	(CAN1_MO122_EDATA4)

/** \brief  1F54, Message Object  Data Register High */
#define CAN1_MO122_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029F54u)

/** Alias (User Manual Name) for CAN1_MO122_EDATA5.
* To use register names with standard convension, please use CAN1_MO122_EDATA5.
*/
#define	CAN1_EMO122DATA5	(CAN1_MO122_EDATA5)

/** \brief  1F58, Message Object  Arbitration Register */
#define CAN1_MO122_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029F58u)

/** Alias (User Manual Name) for CAN1_MO122_EDATA6.
* To use register names with standard convension, please use CAN1_MO122_EDATA6.
*/
#define	CAN1_EMO122DATA6	(CAN1_MO122_EDATA6)

/** \brief  1F40, Message Object  Function Control Register */
#define CAN1_MO122_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F40u)

/** Alias (User Manual Name) for CAN1_MO122_FCR.
* To use register names with standard convension, please use CAN1_MO122_FCR.
*/
#define	CAN1_MOFCR122	(CAN1_MO122_FCR)

/** \brief  1F44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO122_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F44u)

/** Alias (User Manual Name) for CAN1_MO122_FGPR.
* To use register names with standard convension, please use CAN1_MO122_FGPR.
*/
#define	CAN1_MOFGPR122	(CAN1_MO122_FGPR)

/** \brief  1F48, Message Object  Interrupt Pointer Register */
#define CAN1_MO122_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F48u)

/** Alias (User Manual Name) for CAN1_MO122_IPR.
* To use register names with standard convension, please use CAN1_MO122_IPR.
*/
#define	CAN1_MOIPR122	(CAN1_MO122_IPR)

/** \brief  1F5C, Message Object  Control Register */
#define CAN1_MO122_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029F5Cu)

