leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO122_STAT.
* To use register names with standard convension, please use CAN1_MO122_STAT.
*/
#define	CAN1_MOSTAT122	(CAN1_MO122_STAT)

/** \brief  1F6C, Message Object  Acceptance Mask Register */
#define CAN1_MO123_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F6Cu)

/** Alias (User Manual Name) for CAN1_MO123_AMR.
* To use register names with standard convension, please use CAN1_MO123_AMR.
*/
#define	CAN1_MOAMR123	(CAN1_MO123_AMR)

/** \brief  1F78, Message Object  Arbitration Register */
#define CAN1_MO123_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F78u)

/** Alias (User Manual Name) for CAN1_MO123_AR.
* To use register names with standard convension, please use CAN1_MO123_AR.
*/
#define	CAN1_MOAR123	(CAN1_MO123_AR)

/** \brief  1F7C, Message Object  Control Register */
#define CAN1_MO123_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029F7Cu)

/** Alias (User Manual Name) for CAN1_MO123_CTR.
* To use register names with standard convension, please use CAN1_MO123_CTR.
*/
#define	CAN1_MOCTR123	(CAN1_MO123_CTR)

/** \brief  1F74, Message Object  Data Register High */
#define CAN1_MO123_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F74u)

/** Alias (User Manual Name) for CAN1_MO123_DATAH.
* To use register names with standard convension, please use CAN1_MO123_DATAH.
*/
#define	CAN1_MODATAH123	(CAN1_MO123_DATAH)

/** \brief  1F70, Message Object  Data Register Low */
#define CAN1_MO123_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F70u)

/** Alias (User Manual Name) for CAN1_MO123_DATAL.
* To use register names with standard convension, please use CAN1_MO123_DATAL.
*/
#define	CAN1_MODATAL123	(CAN1_MO123_DATAL)

/** \brief  1F60, Message Object  Function Control Register */
#define CAN1_MO123_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029F60u)

/** Alias (User Manual Name) for CAN1_MO123_EDATA0.
* To use register names with standard convension, please use CAN1_MO123_EDATA0.
*/
#define	CAN1_EMO123DATA0	(CAN1_MO123_EDATA0)

/** \brief  1F64, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO123_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029F64u)

/** Alias (User Manual Name) for CAN1_MO123_EDATA1.
* To use register names with standard convension, please use CAN1_MO123_EDATA1.
*/
#define	CAN1_EMO123DATA1	(CAN1_MO123_EDATA1)

/** \brief  1F68, Message Object  Interrupt Pointer Register */
#define CAN1_MO123_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029F68u)

/** Alias (User Manual Name) for CAN1_MO123_EDATA2.
* To use register names with standard convension, please use CAN1_MO123_EDATA2.
*/
#define	CAN1_EMO123DATA2	(CAN1_MO123_EDATA2)

/** \brief  1F6C, Message Object  Acceptance Mask Register */
#define CAN1_MO123_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029F6Cu)

/** Alias (User Manual Name) for CAN1_MO123_EDATA3.
* To use register names with standard convension, please use CAN1_MO123_EDATA3.
*/
#define	CAN1_EMO123DATA3	(CAN1_MO123_EDATA3)

/** \brief  1F70, Message Object  Data Register Low */
#define CAN1_MO123_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029F70u)

/** Alias (User Manual Name) for CAN1_MO123_EDATA4.
* To use register names with standard convension, please use CAN1_MO123_EDATA4.
*/
#define	CAN1_EMO123DATA4	(CAN1_MO123_EDATA4)

/** \brief  1F74, Message Object  Data Register High */
#define CAN1_MO123_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029F74u)

/** Alias (User Manual Name) for CAN1_MO123_EDATA5.
* To use register names with standard convension, please use CAN1_MO123_EDATA5.
*/
#define	CAN1_EMO123DATA5	(CAN1_MO123_EDATA5)

/** \brief  1F78, Message Object  Arbitration Register */
#define CAN1_MO123_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029F78u)

/** Alias (User Manual Name) for CAN1_MO123_EDATA6.
* To use register names with standard convension, please use CAN1_MO123_EDATA6.
*/
#define	CAN1_EMO123DATA6	(CAN1_MO123_EDATA6)

/** \brief  1F60, Message Object  Function Control Register */
#define CAN1_MO123_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F60u)

/** Alias (User Manual Name) for CAN1_MO123_FCR.
* To use register names with standard convension, please use CAN1_MO123_FCR.
*/
#define	CAN1_MOFCR123	(CAN1_MO123_FCR)

/** \brief  1F64, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO123_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F64u)

/** Alias (User Manual Name) for CAN1_MO123_FGPR.
* To use register names with standard convension, please use CAN1_MO123_FGPR.
*/
#define	CAN1_MOFGPR123	(CAN1_MO123_FGPR)

/** \brief  1F68, Message Object  Interrupt Pointer Register */
#define CAN1_MO123_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F68u)

/** Alias (User Manual Name) for CAN1_MO123_IPR.
* To use register names with standard convension, please use CAN1_MO123_IPR.
*/
#define	CAN1_MOIPR123	(CAN1_MO123_IPR)

/** \brief  1F7C, Message Object  Control Register */
#define CAN1_MO123_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029F7Cu)

/** Alias (User Manual Name) for CAN1_MO123_STAT.
* To use register names with standard convension, please use CAN1_MO123_STAT.
*/
#define	CAN1_MOSTAT123	(CAN1_MO123_STAT)

/** \brief  1F8C, Message Object  Acceptance Mask Register */
#define CAN1_MO124_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F8Cu)

/** Alias (User Manual Name) for CAN1_MO124_AMR.
* To use register names with standard convension, please use CAN1_MO124_AMR.
*/
#define	CAN1_MOAMR124	(CAN1_MO124_AMR)

/** \brief  1F98, Message Object  Arbitration Register */
#define CAN1_MO124_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F98u)

/** Alias (User Manual Name) for CAN1_MO124_AR.
* To use register names with standard convension, please use CAN1_MO124_AR.
*/
#define	CAN1_MOAR124	(CAN1_MO124_AR)

/** \brief  1F9C, Message Object  Control Register */
#define CAN1_MO124_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029F9Cu)

