leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO124_CTR.
* To use register names with standard convension, please use CAN1_MO124_CTR.
*/
#define	CAN1_MOCTR124	(CAN1_MO124_CTR)

/** \brief  1F94, Message Object  Data Register High */
#define CAN1_MO124_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F94u)

/** Alias (User Manual Name) for CAN1_MO124_DATAH.
* To use register names with standard convension, please use CAN1_MO124_DATAH.
*/
#define	CAN1_MODATAH124	(CAN1_MO124_DATAH)

/** \brief  1F90, Message Object  Data Register Low */
#define CAN1_MO124_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F90u)

/** Alias (User Manual Name) for CAN1_MO124_DATAL.
* To use register names with standard convension, please use CAN1_MO124_DATAL.
*/
#define	CAN1_MODATAL124	(CAN1_MO124_DATAL)

/** \brief  1F80, Message Object  Function Control Register */
#define CAN1_MO124_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029F80u)

/** Alias (User Manual Name) for CAN1_MO124_EDATA0.
* To use register names with standard convension, please use CAN1_MO124_EDATA0.
*/
#define	CAN1_EMO124DATA0	(CAN1_MO124_EDATA0)

/** \brief  1F84, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO124_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029F84u)

/** Alias (User Manual Name) for CAN1_MO124_EDATA1.
* To use register names with standard convension, please use CAN1_MO124_EDATA1.
*/
#define	CAN1_EMO124DATA1	(CAN1_MO124_EDATA1)

/** \brief  1F88, Message Object  Interrupt Pointer Register */
#define CAN1_MO124_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029F88u)

/** Alias (User Manual Name) for CAN1_MO124_EDATA2.
* To use register names with standard convension, please use CAN1_MO124_EDATA2.
*/
#define	CAN1_EMO124DATA2	(CAN1_MO124_EDATA2)

/** \brief  1F8C, Message Object  Acceptance Mask Register */
#define CAN1_MO124_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029F8Cu)

/** Alias (User Manual Name) for CAN1_MO124_EDATA3.
* To use register names with standard convension, please use CAN1_MO124_EDATA3.
*/
#define	CAN1_EMO124DATA3	(CAN1_MO124_EDATA3)

/** \brief  1F90, Message Object  Data Register Low */
#define CAN1_MO124_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029F90u)

/** Alias (User Manual Name) for CAN1_MO124_EDATA4.
* To use register names with standard convension, please use CAN1_MO124_EDATA4.
*/
#define	CAN1_EMO124DATA4	(CAN1_MO124_EDATA4)

/** \brief  1F94, Message Object  Data Register High */
#define CAN1_MO124_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029F94u)

/** Alias (User Manual Name) for CAN1_MO124_EDATA5.
* To use register names with standard convension, please use CAN1_MO124_EDATA5.
*/
#define	CAN1_EMO124DATA5	(CAN1_MO124_EDATA5)

/** \brief  1F98, Message Object  Arbitration Register */
#define CAN1_MO124_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029F98u)

/** Alias (User Manual Name) for CAN1_MO124_EDATA6.
* To use register names with standard convension, please use CAN1_MO124_EDATA6.
*/
#define	CAN1_EMO124DATA6	(CAN1_MO124_EDATA6)

/** \brief  1F80, Message Object  Function Control Register */
#define CAN1_MO124_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F80u)

/** Alias (User Manual Name) for CAN1_MO124_FCR.
* To use register names with standard convension, please use CAN1_MO124_FCR.
*/
#define	CAN1_MOFCR124	(CAN1_MO124_FCR)

/** \brief  1F84, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO124_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F84u)

/** Alias (User Manual Name) for CAN1_MO124_FGPR.
* To use register names with standard convension, please use CAN1_MO124_FGPR.
*/
#define	CAN1_MOFGPR124	(CAN1_MO124_FGPR)

/** \brief  1F88, Message Object  Interrupt Pointer Register */
#define CAN1_MO124_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F88u)

/** Alias (User Manual Name) for CAN1_MO124_IPR.
* To use register names with standard convension, please use CAN1_MO124_IPR.
*/
#define	CAN1_MOIPR124	(CAN1_MO124_IPR)

/** \brief  1F9C, Message Object  Control Register */
#define CAN1_MO124_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029F9Cu)

/** Alias (User Manual Name) for CAN1_MO124_STAT.
* To use register names with standard convension, please use CAN1_MO124_STAT.
*/
#define	CAN1_MOSTAT124	(CAN1_MO124_STAT)

/** \brief  1FAC, Message Object  Acceptance Mask Register */
#define CAN1_MO125_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029FACu)

/** Alias (User Manual Name) for CAN1_MO125_AMR.
* To use register names with standard convension, please use CAN1_MO125_AMR.
*/
#define	CAN1_MOAMR125	(CAN1_MO125_AMR)

/** \brief  1FB8, Message Object  Arbitration Register */
#define CAN1_MO125_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029FB8u)

/** Alias (User Manual Name) for CAN1_MO125_AR.
* To use register names with standard convension, please use CAN1_MO125_AR.
*/
#define	CAN1_MOAR125	(CAN1_MO125_AR)

/** \brief  1FBC, Message Object  Control Register */
#define CAN1_MO125_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029FBCu)

/** Alias (User Manual Name) for CAN1_MO125_CTR.
* To use register names with standard convension, please use CAN1_MO125_CTR.
*/
#define	CAN1_MOCTR125	(CAN1_MO125_CTR)

/** \brief  1FB4, Message Object  Data Register High */
#define CAN1_MO125_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029FB4u)

/** Alias (User Manual Name) for CAN1_MO125_DATAH.
* To use register names with standard convension, please use CAN1_MO125_DATAH.
*/
#define	CAN1_MODATAH125	(CAN1_MO125_DATAH)

/** \brief  1FB0, Message Object  Data Register Low */
#define CAN1_MO125_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029FB0u)

/** Alias (User Manual Name) for CAN1_MO125_DATAL.
* To use register names with standard convension, please use CAN1_MO125_DATAL.
*/
#define	CAN1_MODATAL125	(CAN1_MO125_DATAL)

/** \brief  1FA0, Message Object  Function Control Register */
#define CAN1_MO125_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029FA0u)

/** Alias (User Manual Name) for CAN1_MO125_EDATA0.
* To use register names with standard convension, please use CAN1_MO125_EDATA0.
*/
#define	CAN1_EMO125DATA0	(CAN1_MO125_EDATA0)

/** \brief  1FA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO125_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029FA4u)

/** Alias (User Manual Name) for CAN1_MO125_EDATA1.
* To use register names with standard convension, please use CAN1_MO125_EDATA1.
*/
#define	CAN1_EMO125DATA1	(CAN1_MO125_EDATA1)

