leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1FA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO125_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029FA8u)

/** Alias (User Manual Name) for CAN1_MO125_EDATA2.
* To use register names with standard convension, please use CAN1_MO125_EDATA2.
*/
#define	CAN1_EMO125DATA2	(CAN1_MO125_EDATA2)

/** \brief  1FAC, Message Object  Acceptance Mask Register */
#define CAN1_MO125_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029FACu)

/** Alias (User Manual Name) for CAN1_MO125_EDATA3.
* To use register names with standard convension, please use CAN1_MO125_EDATA3.
*/
#define	CAN1_EMO125DATA3	(CAN1_MO125_EDATA3)

/** \brief  1FB0, Message Object  Data Register Low */
#define CAN1_MO125_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029FB0u)

/** Alias (User Manual Name) for CAN1_MO125_EDATA4.
* To use register names with standard convension, please use CAN1_MO125_EDATA4.
*/
#define	CAN1_EMO125DATA4	(CAN1_MO125_EDATA4)

/** \brief  1FB4, Message Object  Data Register High */
#define CAN1_MO125_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029FB4u)

/** Alias (User Manual Name) for CAN1_MO125_EDATA5.
* To use register names with standard convension, please use CAN1_MO125_EDATA5.
*/
#define	CAN1_EMO125DATA5	(CAN1_MO125_EDATA5)

/** \brief  1FB8, Message Object  Arbitration Register */
#define CAN1_MO125_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029FB8u)

/** Alias (User Manual Name) for CAN1_MO125_EDATA6.
* To use register names with standard convension, please use CAN1_MO125_EDATA6.
*/
#define	CAN1_EMO125DATA6	(CAN1_MO125_EDATA6)

/** \brief  1FA0, Message Object  Function Control Register */
#define CAN1_MO125_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029FA0u)

/** Alias (User Manual Name) for CAN1_MO125_FCR.
* To use register names with standard convension, please use CAN1_MO125_FCR.
*/
#define	CAN1_MOFCR125	(CAN1_MO125_FCR)

/** \brief  1FA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO125_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029FA4u)

/** Alias (User Manual Name) for CAN1_MO125_FGPR.
* To use register names with standard convension, please use CAN1_MO125_FGPR.
*/
#define	CAN1_MOFGPR125	(CAN1_MO125_FGPR)

/** \brief  1FA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO125_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029FA8u)

/** Alias (User Manual Name) for CAN1_MO125_IPR.
* To use register names with standard convension, please use CAN1_MO125_IPR.
*/
#define	CAN1_MOIPR125	(CAN1_MO125_IPR)

/** \brief  1FBC, Message Object  Control Register */
#define CAN1_MO125_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029FBCu)

/** Alias (User Manual Name) for CAN1_MO125_STAT.
* To use register names with standard convension, please use CAN1_MO125_STAT.
*/
#define	CAN1_MOSTAT125	(CAN1_MO125_STAT)

/** \brief  1FCC, Message Object  Acceptance Mask Register */
#define CAN1_MO126_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029FCCu)

/** Alias (User Manual Name) for CAN1_MO126_AMR.
* To use register names with standard convension, please use CAN1_MO126_AMR.
*/
#define	CAN1_MOAMR126	(CAN1_MO126_AMR)

/** \brief  1FD8, Message Object  Arbitration Register */
#define CAN1_MO126_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029FD8u)

/** Alias (User Manual Name) for CAN1_MO126_AR.
* To use register names with standard convension, please use CAN1_MO126_AR.
*/
#define	CAN1_MOAR126	(CAN1_MO126_AR)

/** \brief  1FDC, Message Object  Control Register */
#define CAN1_MO126_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029FDCu)

/** Alias (User Manual Name) for CAN1_MO126_CTR.
* To use register names with standard convension, please use CAN1_MO126_CTR.
*/
#define	CAN1_MOCTR126	(CAN1_MO126_CTR)

/** \brief  1FD4, Message Object  Data Register High */
#define CAN1_MO126_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029FD4u)

/** Alias (User Manual Name) for CAN1_MO126_DATAH.
* To use register names with standard convension, please use CAN1_MO126_DATAH.
*/
#define	CAN1_MODATAH126	(CAN1_MO126_DATAH)

/** \brief  1FD0, Message Object  Data Register Low */
#define CAN1_MO126_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029FD0u)

/** Alias (User Manual Name) for CAN1_MO126_DATAL.
* To use register names with standard convension, please use CAN1_MO126_DATAL.
*/
#define	CAN1_MODATAL126	(CAN1_MO126_DATAL)

/** \brief  1FC0, Message Object  Function Control Register */
#define CAN1_MO126_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029FC0u)

/** Alias (User Manual Name) for CAN1_MO126_EDATA0.
* To use register names with standard convension, please use CAN1_MO126_EDATA0.
*/
#define	CAN1_EMO126DATA0	(CAN1_MO126_EDATA0)

/** \brief  1FC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO126_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029FC4u)

/** Alias (User Manual Name) for CAN1_MO126_EDATA1.
* To use register names with standard convension, please use CAN1_MO126_EDATA1.
*/
#define	CAN1_EMO126DATA1	(CAN1_MO126_EDATA1)

/** \brief  1FC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO126_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029FC8u)

/** Alias (User Manual Name) for CAN1_MO126_EDATA2.
* To use register names with standard convension, please use CAN1_MO126_EDATA2.
*/
#define	CAN1_EMO126DATA2	(CAN1_MO126_EDATA2)

/** \brief  1FCC, Message Object  Acceptance Mask Register */
#define CAN1_MO126_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029FCCu)

/** Alias (User Manual Name) for CAN1_MO126_EDATA3.
* To use register names with standard convension, please use CAN1_MO126_EDATA3.
*/
#define	CAN1_EMO126DATA3	(CAN1_MO126_EDATA3)

/** \brief  1FD0, Message Object  Data Register Low */
#define CAN1_MO126_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029FD0u)

/** Alias (User Manual Name) for CAN1_MO126_EDATA4.
* To use register names with standard convension, please use CAN1_MO126_EDATA4.
*/
#define	CAN1_EMO126DATA4	(CAN1_MO126_EDATA4)

/** \brief  1FD4, Message Object  Data Register High */
#define CAN1_MO126_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029FD4u)

/** Alias (User Manual Name) for CAN1_MO126_EDATA5.
* To use register names with standard convension, please use CAN1_MO126_EDATA5.
*/
#define	CAN1_EMO126DATA5	(CAN1_MO126_EDATA5)

/** \brief  1FD8, Message Object  Arbitration Register */
#define CAN1_MO126_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029FD8u)

