leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO126_EDATA6.
* To use register names with standard convension, please use CAN1_MO126_EDATA6.
*/
#define	CAN1_EMO126DATA6	(CAN1_MO126_EDATA6)

/** \brief  1FC0, Message Object  Function Control Register */
#define CAN1_MO126_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029FC0u)

/** Alias (User Manual Name) for CAN1_MO126_FCR.
* To use register names with standard convension, please use CAN1_MO126_FCR.
*/
#define	CAN1_MOFCR126	(CAN1_MO126_FCR)

/** \brief  1FC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO126_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029FC4u)

/** Alias (User Manual Name) for CAN1_MO126_FGPR.
* To use register names with standard convension, please use CAN1_MO126_FGPR.
*/
#define	CAN1_MOFGPR126	(CAN1_MO126_FGPR)

/** \brief  1FC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO126_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029FC8u)

/** Alias (User Manual Name) for CAN1_MO126_IPR.
* To use register names with standard convension, please use CAN1_MO126_IPR.
*/
#define	CAN1_MOIPR126	(CAN1_MO126_IPR)

/** \brief  1FDC, Message Object  Control Register */
#define CAN1_MO126_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029FDCu)

/** Alias (User Manual Name) for CAN1_MO126_STAT.
* To use register names with standard convension, please use CAN1_MO126_STAT.
*/
#define	CAN1_MOSTAT126	(CAN1_MO126_STAT)

/** \brief  1FEC, Message Object  Acceptance Mask Register */
#define CAN1_MO127_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029FECu)

/** Alias (User Manual Name) for CAN1_MO127_AMR.
* To use register names with standard convension, please use CAN1_MO127_AMR.
*/
#define	CAN1_MOAMR127	(CAN1_MO127_AMR)

/** \brief  1FF8, Message Object  Arbitration Register */
#define CAN1_MO127_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029FF8u)

/** Alias (User Manual Name) for CAN1_MO127_AR.
* To use register names with standard convension, please use CAN1_MO127_AR.
*/
#define	CAN1_MOAR127	(CAN1_MO127_AR)

/** \brief  1FFC, Message Object  Control Register */
#define CAN1_MO127_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029FFCu)

/** Alias (User Manual Name) for CAN1_MO127_CTR.
* To use register names with standard convension, please use CAN1_MO127_CTR.
*/
#define	CAN1_MOCTR127	(CAN1_MO127_CTR)

/** \brief  1FF4, Message Object  Data Register High */
#define CAN1_MO127_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029FF4u)

/** Alias (User Manual Name) for CAN1_MO127_DATAH.
* To use register names with standard convension, please use CAN1_MO127_DATAH.
*/
#define	CAN1_MODATAH127	(CAN1_MO127_DATAH)

/** \brief  1FF0, Message Object  Data Register Low */
#define CAN1_MO127_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029FF0u)

/** Alias (User Manual Name) for CAN1_MO127_DATAL.
* To use register names with standard convension, please use CAN1_MO127_DATAL.
*/
#define	CAN1_MODATAL127	(CAN1_MO127_DATAL)

/** \brief  1FE0, Message Object  Function Control Register */
#define CAN1_MO127_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029FE0u)

/** Alias (User Manual Name) for CAN1_MO127_EDATA0.
* To use register names with standard convension, please use CAN1_MO127_EDATA0.
*/
#define	CAN1_EMO127DATA0	(CAN1_MO127_EDATA0)

/** \brief  1FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO127_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029FE4u)

/** Alias (User Manual Name) for CAN1_MO127_EDATA1.
* To use register names with standard convension, please use CAN1_MO127_EDATA1.
*/
#define	CAN1_EMO127DATA1	(CAN1_MO127_EDATA1)

/** \brief  1FE8, Message Object  Interrupt Pointer Register */
#define CAN1_MO127_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029FE8u)

/** Alias (User Manual Name) for CAN1_MO127_EDATA2.
* To use register names with standard convension, please use CAN1_MO127_EDATA2.
*/
#define	CAN1_EMO127DATA2	(CAN1_MO127_EDATA2)

/** \brief  1FEC, Message Object  Acceptance Mask Register */
#define CAN1_MO127_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029FECu)

/** Alias (User Manual Name) for CAN1_MO127_EDATA3.
* To use register names with standard convension, please use CAN1_MO127_EDATA3.
*/
#define	CAN1_EMO127DATA3	(CAN1_MO127_EDATA3)

/** \brief  1FF0, Message Object  Data Register Low */
#define CAN1_MO127_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029FF0u)

/** Alias (User Manual Name) for CAN1_MO127_EDATA4.
* To use register names with standard convension, please use CAN1_MO127_EDATA4.
*/
#define	CAN1_EMO127DATA4	(CAN1_MO127_EDATA4)

/** \brief  1FF4, Message Object  Data Register High */
#define CAN1_MO127_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029FF4u)

/** Alias (User Manual Name) for CAN1_MO127_EDATA5.
* To use register names with standard convension, please use CAN1_MO127_EDATA5.
*/
#define	CAN1_EMO127DATA5	(CAN1_MO127_EDATA5)

/** \brief  1FF8, Message Object  Arbitration Register */
#define CAN1_MO127_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029FF8u)

/** Alias (User Manual Name) for CAN1_MO127_EDATA6.
* To use register names with standard convension, please use CAN1_MO127_EDATA6.
*/
#define	CAN1_EMO127DATA6	(CAN1_MO127_EDATA6)

/** \brief  1FE0, Message Object  Function Control Register */
#define CAN1_MO127_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029FE0u)

/** Alias (User Manual Name) for CAN1_MO127_FCR.
* To use register names with standard convension, please use CAN1_MO127_FCR.
*/
#define	CAN1_MOFCR127	(CAN1_MO127_FCR)

/** \brief  1FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO127_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029FE4u)

/** Alias (User Manual Name) for CAN1_MO127_FGPR.
* To use register names with standard convension, please use CAN1_MO127_FGPR.
*/
#define	CAN1_MOFGPR127	(CAN1_MO127_FGPR)

/** \brief  1FE8, Message Object  Interrupt Pointer Register */
#define CAN1_MO127_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029FE8u)

/** Alias (User Manual Name) for CAN1_MO127_IPR.
* To use register names with standard convension, please use CAN1_MO127_IPR.
*/
#define	CAN1_MOIPR127	(CAN1_MO127_IPR)

/** \brief  1FFC, Message Object  Control Register */
#define CAN1_MO127_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029FFCu)

/** Alias (User Manual Name) for CAN1_MO127_STAT.
* To use register names with standard convension, please use CAN1_MO127_STAT.
*/
#define	CAN1_MOSTAT127	(CAN1_MO127_STAT)

/** \brief  118C, Message Object  Acceptance Mask Register */
#define CAN1_MO12_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002918Cu)

/** Alias (User Manual Name) for CAN1_MO12_AMR.
* To use register names with standard convension, please use CAN1_MO12_AMR.
*/
#define	CAN1_MOAMR12	(CAN1_MO12_AMR)

/** \brief  1198, Message Object  Arbitration Register */
#define CAN1_MO12_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029198u)

/** Alias (User Manual Name) for CAN1_MO12_AR.
* To use register names with standard convension, please use CAN1_MO12_AR.
*/
#define	CAN1_MOAR12	(CAN1_MO12_AR)

/** \brief  119C, Message Object  Control Register */
#define CAN1_MO12_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002919Cu)

/** Alias (User Manual Name) for CAN1_MO12_CTR.
* To use register names with standard convension, please use CAN1_MO12_CTR.
*/
#define	CAN1_MOCTR12	(CAN1_MO12_CTR)

/** \brief  1194, Message Object  Data Register High */
#define CAN1_MO12_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029194u)

/** Alias (User Manual Name) for CAN1_MO12_DATAH.
* To use register names with standard convension, please use CAN1_MO12_DATAH.
*/
#define	CAN1_MODATAH12	(CAN1_MO12_DATAH)

/** \brief  1190, Message Object  Data Register Low */
#define CAN1_MO12_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029190u)

/** Alias (User Manual Name) for CAN1_MO12_DATAL.
* To use register names with standard convension, please use CAN1_MO12_DATAL.
*/
#define	CAN1_MODATAL12	(CAN1_MO12_DATAL)

/** \brief  1180, Message Object  Function Control Register */
#define CAN1_MO12_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029180u)

