leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO12_EDATA0.
* To use register names with standard convension, please use CAN1_MO12_EDATA0.
*/
#define	CAN1_EMO12DATA0	(CAN1_MO12_EDATA0)

/** \brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO12_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029184u)

/** Alias (User Manual Name) for CAN1_MO12_EDATA1.
* To use register names with standard convension, please use CAN1_MO12_EDATA1.
*/
#define	CAN1_EMO12DATA1	(CAN1_MO12_EDATA1)

/** \brief  1188, Message Object  Interrupt Pointer Register */
#define CAN1_MO12_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029188u)

/** Alias (User Manual Name) for CAN1_MO12_EDATA2.
* To use register names with standard convension, please use CAN1_MO12_EDATA2.
*/
#define	CAN1_EMO12DATA2	(CAN1_MO12_EDATA2)

/** \brief  118C, Message Object  Acceptance Mask Register */
#define CAN1_MO12_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002918Cu)

/** Alias (User Manual Name) for CAN1_MO12_EDATA3.
* To use register names with standard convension, please use CAN1_MO12_EDATA3.
*/
#define	CAN1_EMO12DATA3	(CAN1_MO12_EDATA3)

/** \brief  1190, Message Object  Data Register Low */
#define CAN1_MO12_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029190u)

/** Alias (User Manual Name) for CAN1_MO12_EDATA4.
* To use register names with standard convension, please use CAN1_MO12_EDATA4.
*/
#define	CAN1_EMO12DATA4	(CAN1_MO12_EDATA4)

/** \brief  1194, Message Object  Data Register High */
#define CAN1_MO12_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029194u)

/** Alias (User Manual Name) for CAN1_MO12_EDATA5.
* To use register names with standard convension, please use CAN1_MO12_EDATA5.
*/
#define	CAN1_EMO12DATA5	(CAN1_MO12_EDATA5)

/** \brief  1198, Message Object  Arbitration Register */
#define CAN1_MO12_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029198u)

/** Alias (User Manual Name) for CAN1_MO12_EDATA6.
* To use register names with standard convension, please use CAN1_MO12_EDATA6.
*/
#define	CAN1_EMO12DATA6	(CAN1_MO12_EDATA6)

/** \brief  1180, Message Object  Function Control Register */
#define CAN1_MO12_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029180u)

/** Alias (User Manual Name) for CAN1_MO12_FCR.
* To use register names with standard convension, please use CAN1_MO12_FCR.
*/
#define	CAN1_MOFCR12	(CAN1_MO12_FCR)

/** \brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO12_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029184u)

/** Alias (User Manual Name) for CAN1_MO12_FGPR.
* To use register names with standard convension, please use CAN1_MO12_FGPR.
*/
#define	CAN1_MOFGPR12	(CAN1_MO12_FGPR)

/** \brief  1188, Message Object  Interrupt Pointer Register */
#define CAN1_MO12_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029188u)

/** Alias (User Manual Name) for CAN1_MO12_IPR.
* To use register names with standard convension, please use CAN1_MO12_IPR.
*/
#define	CAN1_MOIPR12	(CAN1_MO12_IPR)

/** \brief  119C, Message Object  Control Register */
#define CAN1_MO12_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002919Cu)

/** Alias (User Manual Name) for CAN1_MO12_STAT.
* To use register names with standard convension, please use CAN1_MO12_STAT.
*/
#define	CAN1_MOSTAT12	(CAN1_MO12_STAT)

/** \brief  11AC, Message Object  Acceptance Mask Register */
#define CAN1_MO13_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291ACu)

/** Alias (User Manual Name) for CAN1_MO13_AMR.
* To use register names with standard convension, please use CAN1_MO13_AMR.
*/
#define	CAN1_MOAMR13	(CAN1_MO13_AMR)

/** \brief  11B8, Message Object  Arbitration Register */
#define CAN1_MO13_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291B8u)

/** Alias (User Manual Name) for CAN1_MO13_AR.
* To use register names with standard convension, please use CAN1_MO13_AR.
*/
#define	CAN1_MOAR13	(CAN1_MO13_AR)

/** \brief  11BC, Message Object  Control Register */
#define CAN1_MO13_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00291BCu)

/** Alias (User Manual Name) for CAN1_MO13_CTR.
* To use register names with standard convension, please use CAN1_MO13_CTR.
*/
#define	CAN1_MOCTR13	(CAN1_MO13_CTR)

/** \brief  11B4, Message Object  Data Register High */
#define CAN1_MO13_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291B4u)

/** Alias (User Manual Name) for CAN1_MO13_DATAH.
* To use register names with standard convension, please use CAN1_MO13_DATAH.
*/
#define	CAN1_MODATAH13	(CAN1_MO13_DATAH)

/** \brief  11B0, Message Object  Data Register Low */
#define CAN1_MO13_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291B0u)

/** Alias (User Manual Name) for CAN1_MO13_DATAL.
* To use register names with standard convension, please use CAN1_MO13_DATAL.
*/
#define	CAN1_MODATAL13	(CAN1_MO13_DATAL)

/** \brief  11A0, Message Object  Function Control Register */
#define CAN1_MO13_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00291A0u)

/** Alias (User Manual Name) for CAN1_MO13_EDATA0.
* To use register names with standard convension, please use CAN1_MO13_EDATA0.
*/
#define	CAN1_EMO13DATA0	(CAN1_MO13_EDATA0)

/** \brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO13_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00291A4u)

/** Alias (User Manual Name) for CAN1_MO13_EDATA1.
* To use register names with standard convension, please use CAN1_MO13_EDATA1.
*/
#define	CAN1_EMO13DATA1	(CAN1_MO13_EDATA1)

/** \brief  11A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO13_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00291A8u)

/** Alias (User Manual Name) for CAN1_MO13_EDATA2.
* To use register names with standard convension, please use CAN1_MO13_EDATA2.
*/
#define	CAN1_EMO13DATA2	(CAN1_MO13_EDATA2)

/** \brief  11AC, Message Object  Acceptance Mask Register */
#define CAN1_MO13_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00291ACu)

