leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO13_EDATA3.
* To use register names with standard convension, please use CAN1_MO13_EDATA3.
*/
#define	CAN1_EMO13DATA3	(CAN1_MO13_EDATA3)

/** \brief  11B0, Message Object  Data Register Low */
#define CAN1_MO13_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00291B0u)

/** Alias (User Manual Name) for CAN1_MO13_EDATA4.
* To use register names with standard convension, please use CAN1_MO13_EDATA4.
*/
#define	CAN1_EMO13DATA4	(CAN1_MO13_EDATA4)

/** \brief  11B4, Message Object  Data Register High */
#define CAN1_MO13_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00291B4u)

/** Alias (User Manual Name) for CAN1_MO13_EDATA5.
* To use register names with standard convension, please use CAN1_MO13_EDATA5.
*/
#define	CAN1_EMO13DATA5	(CAN1_MO13_EDATA5)

/** \brief  11B8, Message Object  Arbitration Register */
#define CAN1_MO13_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00291B8u)

/** Alias (User Manual Name) for CAN1_MO13_EDATA6.
* To use register names with standard convension, please use CAN1_MO13_EDATA6.
*/
#define	CAN1_EMO13DATA6	(CAN1_MO13_EDATA6)

/** \brief  11A0, Message Object  Function Control Register */
#define CAN1_MO13_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291A0u)

/** Alias (User Manual Name) for CAN1_MO13_FCR.
* To use register names with standard convension, please use CAN1_MO13_FCR.
*/
#define	CAN1_MOFCR13	(CAN1_MO13_FCR)

/** \brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO13_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291A4u)

/** Alias (User Manual Name) for CAN1_MO13_FGPR.
* To use register names with standard convension, please use CAN1_MO13_FGPR.
*/
#define	CAN1_MOFGPR13	(CAN1_MO13_FGPR)

/** \brief  11A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO13_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291A8u)

/** Alias (User Manual Name) for CAN1_MO13_IPR.
* To use register names with standard convension, please use CAN1_MO13_IPR.
*/
#define	CAN1_MOIPR13	(CAN1_MO13_IPR)

/** \brief  11BC, Message Object  Control Register */
#define CAN1_MO13_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00291BCu)

/** Alias (User Manual Name) for CAN1_MO13_STAT.
* To use register names with standard convension, please use CAN1_MO13_STAT.
*/
#define	CAN1_MOSTAT13	(CAN1_MO13_STAT)

/** \brief  11CC, Message Object  Acceptance Mask Register */
#define CAN1_MO14_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291CCu)

/** Alias (User Manual Name) for CAN1_MO14_AMR.
* To use register names with standard convension, please use CAN1_MO14_AMR.
*/
#define	CAN1_MOAMR14	(CAN1_MO14_AMR)

/** \brief  11D8, Message Object  Arbitration Register */
#define CAN1_MO14_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291D8u)

/** Alias (User Manual Name) for CAN1_MO14_AR.
* To use register names with standard convension, please use CAN1_MO14_AR.
*/
#define	CAN1_MOAR14	(CAN1_MO14_AR)

/** \brief  11DC, Message Object  Control Register */
#define CAN1_MO14_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00291DCu)

/** Alias (User Manual Name) for CAN1_MO14_CTR.
* To use register names with standard convension, please use CAN1_MO14_CTR.
*/
#define	CAN1_MOCTR14	(CAN1_MO14_CTR)

/** \brief  11D4, Message Object  Data Register High */
#define CAN1_MO14_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291D4u)

/** Alias (User Manual Name) for CAN1_MO14_DATAH.
* To use register names with standard convension, please use CAN1_MO14_DATAH.
*/
#define	CAN1_MODATAH14	(CAN1_MO14_DATAH)

/** \brief  11D0, Message Object  Data Register Low */
#define CAN1_MO14_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291D0u)

/** Alias (User Manual Name) for CAN1_MO14_DATAL.
* To use register names with standard convension, please use CAN1_MO14_DATAL.
*/
#define	CAN1_MODATAL14	(CAN1_MO14_DATAL)

/** \brief  11C0, Message Object  Function Control Register */
#define CAN1_MO14_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00291C0u)

/** Alias (User Manual Name) for CAN1_MO14_EDATA0.
* To use register names with standard convension, please use CAN1_MO14_EDATA0.
*/
#define	CAN1_EMO14DATA0	(CAN1_MO14_EDATA0)

/** \brief  11C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO14_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00291C4u)

/** Alias (User Manual Name) for CAN1_MO14_EDATA1.
* To use register names with standard convension, please use CAN1_MO14_EDATA1.
*/
#define	CAN1_EMO14DATA1	(CAN1_MO14_EDATA1)

/** \brief  11C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO14_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00291C8u)

/** Alias (User Manual Name) for CAN1_MO14_EDATA2.
* To use register names with standard convension, please use CAN1_MO14_EDATA2.
*/
#define	CAN1_EMO14DATA2	(CAN1_MO14_EDATA2)

/** \brief  11CC, Message Object  Acceptance Mask Register */
#define CAN1_MO14_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00291CCu)

/** Alias (User Manual Name) for CAN1_MO14_EDATA3.
* To use register names with standard convension, please use CAN1_MO14_EDATA3.
*/
#define	CAN1_EMO14DATA3	(CAN1_MO14_EDATA3)

/** \brief  11D0, Message Object  Data Register Low */
#define CAN1_MO14_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00291D0u)

/** Alias (User Manual Name) for CAN1_MO14_EDATA4.
* To use register names with standard convension, please use CAN1_MO14_EDATA4.
*/
#define	CAN1_EMO14DATA4	(CAN1_MO14_EDATA4)

/** \brief  11D4, Message Object  Data Register High */
#define CAN1_MO14_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00291D4u)

/** Alias (User Manual Name) for CAN1_MO14_EDATA5.
* To use register names with standard convension, please use CAN1_MO14_EDATA5.
*/
#define	CAN1_EMO14DATA5	(CAN1_MO14_EDATA5)

/** \brief  11D8, Message Object  Arbitration Register */
#define CAN1_MO14_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00291D8u)

