leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO14_EDATA6.
* To use register names with standard convension, please use CAN1_MO14_EDATA6.
*/
#define	CAN1_EMO14DATA6	(CAN1_MO14_EDATA6)

/** \brief  11C0, Message Object  Function Control Register */
#define CAN1_MO14_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291C0u)

/** Alias (User Manual Name) for CAN1_MO14_FCR.
* To use register names with standard convension, please use CAN1_MO14_FCR.
*/
#define	CAN1_MOFCR14	(CAN1_MO14_FCR)

/** \brief  11C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO14_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291C4u)

/** Alias (User Manual Name) for CAN1_MO14_FGPR.
* To use register names with standard convension, please use CAN1_MO14_FGPR.
*/
#define	CAN1_MOFGPR14	(CAN1_MO14_FGPR)

/** \brief  11C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO14_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291C8u)

/** Alias (User Manual Name) for CAN1_MO14_IPR.
* To use register names with standard convension, please use CAN1_MO14_IPR.
*/
#define	CAN1_MOIPR14	(CAN1_MO14_IPR)

/** \brief  11DC, Message Object  Control Register */
#define CAN1_MO14_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00291DCu)

/** Alias (User Manual Name) for CAN1_MO14_STAT.
* To use register names with standard convension, please use CAN1_MO14_STAT.
*/
#define	CAN1_MOSTAT14	(CAN1_MO14_STAT)

/** \brief  11EC, Message Object  Acceptance Mask Register */
#define CAN1_MO15_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291ECu)

/** Alias (User Manual Name) for CAN1_MO15_AMR.
* To use register names with standard convension, please use CAN1_MO15_AMR.
*/
#define	CAN1_MOAMR15	(CAN1_MO15_AMR)

/** \brief  11F8, Message Object  Arbitration Register */
#define CAN1_MO15_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291F8u)

/** Alias (User Manual Name) for CAN1_MO15_AR.
* To use register names with standard convension, please use CAN1_MO15_AR.
*/
#define	CAN1_MOAR15	(CAN1_MO15_AR)

/** \brief  11FC, Message Object  Control Register */
#define CAN1_MO15_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00291FCu)

/** Alias (User Manual Name) for CAN1_MO15_CTR.
* To use register names with standard convension, please use CAN1_MO15_CTR.
*/
#define	CAN1_MOCTR15	(CAN1_MO15_CTR)

/** \brief  11F4, Message Object  Data Register High */
#define CAN1_MO15_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291F4u)

/** Alias (User Manual Name) for CAN1_MO15_DATAH.
* To use register names with standard convension, please use CAN1_MO15_DATAH.
*/
#define	CAN1_MODATAH15	(CAN1_MO15_DATAH)

/** \brief  11F0, Message Object  Data Register Low */
#define CAN1_MO15_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291F0u)

/** Alias (User Manual Name) for CAN1_MO15_DATAL.
* To use register names with standard convension, please use CAN1_MO15_DATAL.
*/
#define	CAN1_MODATAL15	(CAN1_MO15_DATAL)

/** \brief  11E0, Message Object  Function Control Register */
#define CAN1_MO15_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00291E0u)

/** Alias (User Manual Name) for CAN1_MO15_EDATA0.
* To use register names with standard convension, please use CAN1_MO15_EDATA0.
*/
#define	CAN1_EMO15DATA0	(CAN1_MO15_EDATA0)

/** \brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO15_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00291E4u)

/** Alias (User Manual Name) for CAN1_MO15_EDATA1.
* To use register names with standard convension, please use CAN1_MO15_EDATA1.
*/
#define	CAN1_EMO15DATA1	(CAN1_MO15_EDATA1)

/** \brief  11E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO15_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00291E8u)

/** Alias (User Manual Name) for CAN1_MO15_EDATA2.
* To use register names with standard convension, please use CAN1_MO15_EDATA2.
*/
#define	CAN1_EMO15DATA2	(CAN1_MO15_EDATA2)

/** \brief  11EC, Message Object  Acceptance Mask Register */
#define CAN1_MO15_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00291ECu)

/** Alias (User Manual Name) for CAN1_MO15_EDATA3.
* To use register names with standard convension, please use CAN1_MO15_EDATA3.
*/
#define	CAN1_EMO15DATA3	(CAN1_MO15_EDATA3)

/** \brief  11F0, Message Object  Data Register Low */
#define CAN1_MO15_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00291F0u)

/** Alias (User Manual Name) for CAN1_MO15_EDATA4.
* To use register names with standard convension, please use CAN1_MO15_EDATA4.
*/
#define	CAN1_EMO15DATA4	(CAN1_MO15_EDATA4)

/** \brief  11F4, Message Object  Data Register High */
#define CAN1_MO15_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00291F4u)

/** Alias (User Manual Name) for CAN1_MO15_EDATA5.
* To use register names with standard convension, please use CAN1_MO15_EDATA5.
*/
#define	CAN1_EMO15DATA5	(CAN1_MO15_EDATA5)

/** \brief  11F8, Message Object  Arbitration Register */
#define CAN1_MO15_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00291F8u)

/** Alias (User Manual Name) for CAN1_MO15_EDATA6.
* To use register names with standard convension, please use CAN1_MO15_EDATA6.
*/
#define	CAN1_EMO15DATA6	(CAN1_MO15_EDATA6)

/** \brief  11E0, Message Object  Function Control Register */
#define CAN1_MO15_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291E0u)

/** Alias (User Manual Name) for CAN1_MO15_FCR.
* To use register names with standard convension, please use CAN1_MO15_FCR.
*/
#define	CAN1_MOFCR15	(CAN1_MO15_FCR)

/** \brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO15_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291E4u)

/** Alias (User Manual Name) for CAN1_MO15_FGPR.
* To use register names with standard convension, please use CAN1_MO15_FGPR.
*/
#define	CAN1_MOFGPR15	(CAN1_MO15_FGPR)

/** \brief  11E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO15_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291E8u)

/** Alias (User Manual Name) for CAN1_MO15_IPR.
* To use register names with standard convension, please use CAN1_MO15_IPR.
*/
#define	CAN1_MOIPR15	(CAN1_MO15_IPR)

/** \brief  11FC, Message Object  Control Register */
#define CAN1_MO15_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00291FCu)

/** Alias (User Manual Name) for CAN1_MO15_STAT.
* To use register names with standard convension, please use CAN1_MO15_STAT.
*/
#define	CAN1_MOSTAT15	(CAN1_MO15_STAT)

