leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  120C, Message Object  Acceptance Mask Register */
#define CAN1_MO16_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002920Cu)

/** Alias (User Manual Name) for CAN1_MO16_AMR.
* To use register names with standard convension, please use CAN1_MO16_AMR.
*/
#define	CAN1_MOAMR16	(CAN1_MO16_AMR)

/** \brief  1218, Message Object  Arbitration Register */
#define CAN1_MO16_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029218u)

/** Alias (User Manual Name) for CAN1_MO16_AR.
* To use register names with standard convension, please use CAN1_MO16_AR.
*/
#define	CAN1_MOAR16	(CAN1_MO16_AR)

/** \brief  121C, Message Object  Control Register */
#define CAN1_MO16_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002921Cu)

/** Alias (User Manual Name) for CAN1_MO16_CTR.
* To use register names with standard convension, please use CAN1_MO16_CTR.
*/
#define	CAN1_MOCTR16	(CAN1_MO16_CTR)

/** \brief  1214, Message Object  Data Register High */
#define CAN1_MO16_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029214u)

/** Alias (User Manual Name) for CAN1_MO16_DATAH.
* To use register names with standard convension, please use CAN1_MO16_DATAH.
*/
#define	CAN1_MODATAH16	(CAN1_MO16_DATAH)

/** \brief  1210, Message Object  Data Register Low */
#define CAN1_MO16_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029210u)

/** Alias (User Manual Name) for CAN1_MO16_DATAL.
* To use register names with standard convension, please use CAN1_MO16_DATAL.
*/
#define	CAN1_MODATAL16	(CAN1_MO16_DATAL)

/** \brief  1200, Message Object  Function Control Register */
#define CAN1_MO16_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029200u)

/** Alias (User Manual Name) for CAN1_MO16_EDATA0.
* To use register names with standard convension, please use CAN1_MO16_EDATA0.
*/
#define	CAN1_EMO16DATA0	(CAN1_MO16_EDATA0)

/** \brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO16_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029204u)

/** Alias (User Manual Name) for CAN1_MO16_EDATA1.
* To use register names with standard convension, please use CAN1_MO16_EDATA1.
*/
#define	CAN1_EMO16DATA1	(CAN1_MO16_EDATA1)

/** \brief  1208, Message Object  Interrupt Pointer Register */
#define CAN1_MO16_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029208u)

/** Alias (User Manual Name) for CAN1_MO16_EDATA2.
* To use register names with standard convension, please use CAN1_MO16_EDATA2.
*/
#define	CAN1_EMO16DATA2	(CAN1_MO16_EDATA2)

/** \brief  120C, Message Object  Acceptance Mask Register */
#define CAN1_MO16_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002920Cu)

/** Alias (User Manual Name) for CAN1_MO16_EDATA3.
* To use register names with standard convension, please use CAN1_MO16_EDATA3.
*/
#define	CAN1_EMO16DATA3	(CAN1_MO16_EDATA3)

/** \brief  1210, Message Object  Data Register Low */
#define CAN1_MO16_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029210u)

/** Alias (User Manual Name) for CAN1_MO16_EDATA4.
* To use register names with standard convension, please use CAN1_MO16_EDATA4.
*/
#define	CAN1_EMO16DATA4	(CAN1_MO16_EDATA4)

/** \brief  1214, Message Object  Data Register High */
#define CAN1_MO16_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029214u)

/** Alias (User Manual Name) for CAN1_MO16_EDATA5.
* To use register names with standard convension, please use CAN1_MO16_EDATA5.
*/
#define	CAN1_EMO16DATA5	(CAN1_MO16_EDATA5)

/** \brief  1218, Message Object  Arbitration Register */
#define CAN1_MO16_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029218u)

/** Alias (User Manual Name) for CAN1_MO16_EDATA6.
* To use register names with standard convension, please use CAN1_MO16_EDATA6.
*/
#define	CAN1_EMO16DATA6	(CAN1_MO16_EDATA6)

/** \brief  1200, Message Object  Function Control Register */
#define CAN1_MO16_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029200u)

/** Alias (User Manual Name) for CAN1_MO16_FCR.
* To use register names with standard convension, please use CAN1_MO16_FCR.
*/
#define	CAN1_MOFCR16	(CAN1_MO16_FCR)

/** \brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO16_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029204u)

/** Alias (User Manual Name) for CAN1_MO16_FGPR.
* To use register names with standard convension, please use CAN1_MO16_FGPR.
*/
#define	CAN1_MOFGPR16	(CAN1_MO16_FGPR)

/** \brief  1208, Message Object  Interrupt Pointer Register */
#define CAN1_MO16_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029208u)

/** Alias (User Manual Name) for CAN1_MO16_IPR.
* To use register names with standard convension, please use CAN1_MO16_IPR.
*/
#define	CAN1_MOIPR16	(CAN1_MO16_IPR)

/** \brief  121C, Message Object  Control Register */
#define CAN1_MO16_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002921Cu)

/** Alias (User Manual Name) for CAN1_MO16_STAT.
* To use register names with standard convension, please use CAN1_MO16_STAT.
*/
#define	CAN1_MOSTAT16	(CAN1_MO16_STAT)

/** \brief  122C, Message Object  Acceptance Mask Register */
#define CAN1_MO17_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002922Cu)

/** Alias (User Manual Name) for CAN1_MO17_AMR.
* To use register names with standard convension, please use CAN1_MO17_AMR.
*/
#define	CAN1_MOAMR17	(CAN1_MO17_AMR)

/** \brief  1238, Message Object  Arbitration Register */
#define CAN1_MO17_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029238u)

/** Alias (User Manual Name) for CAN1_MO17_AR.
* To use register names with standard convension, please use CAN1_MO17_AR.
*/
#define	CAN1_MOAR17	(CAN1_MO17_AR)

/** \brief  123C, Message Object  Control Register */
#define CAN1_MO17_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002923Cu)

/** Alias (User Manual Name) for CAN1_MO17_CTR.
* To use register names with standard convension, please use CAN1_MO17_CTR.
*/
#define	CAN1_MOCTR17	(CAN1_MO17_CTR)

/** \brief  1234, Message Object  Data Register High */
#define CAN1_MO17_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029234u)

/** Alias (User Manual Name) for CAN1_MO17_DATAH.
* To use register names with standard convension, please use CAN1_MO17_DATAH.
*/
#define	CAN1_MODATAH17	(CAN1_MO17_DATAH)

/** \brief  1230, Message Object  Data Register Low */
#define CAN1_MO17_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029230u)

/** Alias (User Manual Name) for CAN1_MO17_DATAL.
* To use register names with standard convension, please use CAN1_MO17_DATAL.
*/
#define	CAN1_MODATAL17	(CAN1_MO17_DATAL)

/** \brief  1220, Message Object  Function Control Register */
#define CAN1_MO17_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029220u)

/** Alias (User Manual Name) for CAN1_MO17_EDATA0.
* To use register names with standard convension, please use CAN1_MO17_EDATA0.
*/
#define	CAN1_EMO17DATA0	(CAN1_MO17_EDATA0)

/** \brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO17_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029224u)

/** Alias (User Manual Name) for CAN1_MO17_EDATA1.
* To use register names with standard convension, please use CAN1_MO17_EDATA1.
*/
#define	CAN1_EMO17DATA1	(CAN1_MO17_EDATA1)

/** \brief  1228, Message Object  Interrupt Pointer Register */
#define CAN1_MO17_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029228u)

/** Alias (User Manual Name) for CAN1_MO17_EDATA2.
* To use register names with standard convension, please use CAN1_MO17_EDATA2.
*/
#define	CAN1_EMO17DATA2	(CAN1_MO17_EDATA2)

/** \brief  122C, Message Object  Acceptance Mask Register */
#define CAN1_MO17_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002922Cu)

