leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO17_EDATA3.
* To use register names with standard convension, please use CAN1_MO17_EDATA3.
*/
#define	CAN1_EMO17DATA3	(CAN1_MO17_EDATA3)

/** \brief  1230, Message Object  Data Register Low */
#define CAN1_MO17_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029230u)

/** Alias (User Manual Name) for CAN1_MO17_EDATA4.
* To use register names with standard convension, please use CAN1_MO17_EDATA4.
*/
#define	CAN1_EMO17DATA4	(CAN1_MO17_EDATA4)

/** \brief  1234, Message Object  Data Register High */
#define CAN1_MO17_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029234u)

/** Alias (User Manual Name) for CAN1_MO17_EDATA5.
* To use register names with standard convension, please use CAN1_MO17_EDATA5.
*/
#define	CAN1_EMO17DATA5	(CAN1_MO17_EDATA5)

/** \brief  1238, Message Object  Arbitration Register */
#define CAN1_MO17_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029238u)

/** Alias (User Manual Name) for CAN1_MO17_EDATA6.
* To use register names with standard convension, please use CAN1_MO17_EDATA6.
*/
#define	CAN1_EMO17DATA6	(CAN1_MO17_EDATA6)

/** \brief  1220, Message Object  Function Control Register */
#define CAN1_MO17_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029220u)

/** Alias (User Manual Name) for CAN1_MO17_FCR.
* To use register names with standard convension, please use CAN1_MO17_FCR.
*/
#define	CAN1_MOFCR17	(CAN1_MO17_FCR)

/** \brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO17_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029224u)

/** Alias (User Manual Name) for CAN1_MO17_FGPR.
* To use register names with standard convension, please use CAN1_MO17_FGPR.
*/
#define	CAN1_MOFGPR17	(CAN1_MO17_FGPR)

/** \brief  1228, Message Object  Interrupt Pointer Register */
#define CAN1_MO17_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029228u)

/** Alias (User Manual Name) for CAN1_MO17_IPR.
* To use register names with standard convension, please use CAN1_MO17_IPR.
*/
#define	CAN1_MOIPR17	(CAN1_MO17_IPR)

/** \brief  123C, Message Object  Control Register */
#define CAN1_MO17_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002923Cu)

/** Alias (User Manual Name) for CAN1_MO17_STAT.
* To use register names with standard convension, please use CAN1_MO17_STAT.
*/
#define	CAN1_MOSTAT17	(CAN1_MO17_STAT)

/** \brief  124C, Message Object  Acceptance Mask Register */
#define CAN1_MO18_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002924Cu)

/** Alias (User Manual Name) for CAN1_MO18_AMR.
* To use register names with standard convension, please use CAN1_MO18_AMR.
*/
#define	CAN1_MOAMR18	(CAN1_MO18_AMR)

/** \brief  1258, Message Object  Arbitration Register */
#define CAN1_MO18_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029258u)

/** Alias (User Manual Name) for CAN1_MO18_AR.
* To use register names with standard convension, please use CAN1_MO18_AR.
*/
#define	CAN1_MOAR18	(CAN1_MO18_AR)

/** \brief  125C, Message Object  Control Register */
#define CAN1_MO18_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002925Cu)

/** Alias (User Manual Name) for CAN1_MO18_CTR.
* To use register names with standard convension, please use CAN1_MO18_CTR.
*/
#define	CAN1_MOCTR18	(CAN1_MO18_CTR)

/** \brief  1254, Message Object  Data Register High */
#define CAN1_MO18_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029254u)

/** Alias (User Manual Name) for CAN1_MO18_DATAH.
* To use register names with standard convension, please use CAN1_MO18_DATAH.
*/
#define	CAN1_MODATAH18	(CAN1_MO18_DATAH)

/** \brief  1250, Message Object  Data Register Low */
#define CAN1_MO18_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029250u)

/** Alias (User Manual Name) for CAN1_MO18_DATAL.
* To use register names with standard convension, please use CAN1_MO18_DATAL.
*/
#define	CAN1_MODATAL18	(CAN1_MO18_DATAL)

/** \brief  1240, Message Object  Function Control Register */
#define CAN1_MO18_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029240u)

/** Alias (User Manual Name) for CAN1_MO18_EDATA0.
* To use register names with standard convension, please use CAN1_MO18_EDATA0.
*/
#define	CAN1_EMO18DATA0	(CAN1_MO18_EDATA0)

/** \brief  1244, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO18_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029244u)

/** Alias (User Manual Name) for CAN1_MO18_EDATA1.
* To use register names with standard convension, please use CAN1_MO18_EDATA1.
*/
#define	CAN1_EMO18DATA1	(CAN1_MO18_EDATA1)

/** \brief  1248, Message Object  Interrupt Pointer Register */
#define CAN1_MO18_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029248u)

/** Alias (User Manual Name) for CAN1_MO18_EDATA2.
* To use register names with standard convension, please use CAN1_MO18_EDATA2.
*/
#define	CAN1_EMO18DATA2	(CAN1_MO18_EDATA2)

/** \brief  124C, Message Object  Acceptance Mask Register */
#define CAN1_MO18_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002924Cu)

/** Alias (User Manual Name) for CAN1_MO18_EDATA3.
* To use register names with standard convension, please use CAN1_MO18_EDATA3.
*/
#define	CAN1_EMO18DATA3	(CAN1_MO18_EDATA3)

/** \brief  1250, Message Object  Data Register Low */
#define CAN1_MO18_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029250u)

/** Alias (User Manual Name) for CAN1_MO18_EDATA4.
* To use register names with standard convension, please use CAN1_MO18_EDATA4.
*/
#define	CAN1_EMO18DATA4	(CAN1_MO18_EDATA4)

/** \brief  1254, Message Object  Data Register High */
#define CAN1_MO18_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029254u)

/** Alias (User Manual Name) for CAN1_MO18_EDATA5.
* To use register names with standard convension, please use CAN1_MO18_EDATA5.
*/
#define	CAN1_EMO18DATA5	(CAN1_MO18_EDATA5)

/** \brief  1258, Message Object  Arbitration Register */
#define CAN1_MO18_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029258u)

