leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO18_EDATA6.
* To use register names with standard convension, please use CAN1_MO18_EDATA6.
*/
#define	CAN1_EMO18DATA6	(CAN1_MO18_EDATA6)

/** \brief  1240, Message Object  Function Control Register */
#define CAN1_MO18_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029240u)

/** Alias (User Manual Name) for CAN1_MO18_FCR.
* To use register names with standard convension, please use CAN1_MO18_FCR.
*/
#define	CAN1_MOFCR18	(CAN1_MO18_FCR)

/** \brief  1244, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO18_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029244u)

/** Alias (User Manual Name) for CAN1_MO18_FGPR.
* To use register names with standard convension, please use CAN1_MO18_FGPR.
*/
#define	CAN1_MOFGPR18	(CAN1_MO18_FGPR)

/** \brief  1248, Message Object  Interrupt Pointer Register */
#define CAN1_MO18_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029248u)

/** Alias (User Manual Name) for CAN1_MO18_IPR.
* To use register names with standard convension, please use CAN1_MO18_IPR.
*/
#define	CAN1_MOIPR18	(CAN1_MO18_IPR)

/** \brief  125C, Message Object  Control Register */
#define CAN1_MO18_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002925Cu)

/** Alias (User Manual Name) for CAN1_MO18_STAT.
* To use register names with standard convension, please use CAN1_MO18_STAT.
*/
#define	CAN1_MOSTAT18	(CAN1_MO18_STAT)

/** \brief  126C, Message Object  Acceptance Mask Register */
#define CAN1_MO19_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002926Cu)

/** Alias (User Manual Name) for CAN1_MO19_AMR.
* To use register names with standard convension, please use CAN1_MO19_AMR.
*/
#define	CAN1_MOAMR19	(CAN1_MO19_AMR)

/** \brief  1278, Message Object  Arbitration Register */
#define CAN1_MO19_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029278u)

/** Alias (User Manual Name) for CAN1_MO19_AR.
* To use register names with standard convension, please use CAN1_MO19_AR.
*/
#define	CAN1_MOAR19	(CAN1_MO19_AR)

/** \brief  127C, Message Object  Control Register */
#define CAN1_MO19_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002927Cu)

/** Alias (User Manual Name) for CAN1_MO19_CTR.
* To use register names with standard convension, please use CAN1_MO19_CTR.
*/
#define	CAN1_MOCTR19	(CAN1_MO19_CTR)

/** \brief  1274, Message Object  Data Register High */
#define CAN1_MO19_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029274u)

/** Alias (User Manual Name) for CAN1_MO19_DATAH.
* To use register names with standard convension, please use CAN1_MO19_DATAH.
*/
#define	CAN1_MODATAH19	(CAN1_MO19_DATAH)

/** \brief  1270, Message Object  Data Register Low */
#define CAN1_MO19_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029270u)

/** Alias (User Manual Name) for CAN1_MO19_DATAL.
* To use register names with standard convension, please use CAN1_MO19_DATAL.
*/
#define	CAN1_MODATAL19	(CAN1_MO19_DATAL)

/** \brief  1260, Message Object  Function Control Register */
#define CAN1_MO19_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029260u)

/** Alias (User Manual Name) for CAN1_MO19_EDATA0.
* To use register names with standard convension, please use CAN1_MO19_EDATA0.
*/
#define	CAN1_EMO19DATA0	(CAN1_MO19_EDATA0)

/** \brief  1264, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO19_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029264u)

/** Alias (User Manual Name) for CAN1_MO19_EDATA1.
* To use register names with standard convension, please use CAN1_MO19_EDATA1.
*/
#define	CAN1_EMO19DATA1	(CAN1_MO19_EDATA1)

/** \brief  1268, Message Object  Interrupt Pointer Register */
#define CAN1_MO19_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029268u)

/** Alias (User Manual Name) for CAN1_MO19_EDATA2.
* To use register names with standard convension, please use CAN1_MO19_EDATA2.
*/
#define	CAN1_EMO19DATA2	(CAN1_MO19_EDATA2)

/** \brief  126C, Message Object  Acceptance Mask Register */
#define CAN1_MO19_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002926Cu)

/** Alias (User Manual Name) for CAN1_MO19_EDATA3.
* To use register names with standard convension, please use CAN1_MO19_EDATA3.
*/
#define	CAN1_EMO19DATA3	(CAN1_MO19_EDATA3)

/** \brief  1270, Message Object  Data Register Low */
#define CAN1_MO19_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029270u)

/** Alias (User Manual Name) for CAN1_MO19_EDATA4.
* To use register names with standard convension, please use CAN1_MO19_EDATA4.
*/
#define	CAN1_EMO19DATA4	(CAN1_MO19_EDATA4)

/** \brief  1274, Message Object  Data Register High */
#define CAN1_MO19_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029274u)

/** Alias (User Manual Name) for CAN1_MO19_EDATA5.
* To use register names with standard convension, please use CAN1_MO19_EDATA5.
*/
#define	CAN1_EMO19DATA5	(CAN1_MO19_EDATA5)

/** \brief  1278, Message Object  Arbitration Register */
#define CAN1_MO19_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029278u)

/** Alias (User Manual Name) for CAN1_MO19_EDATA6.
* To use register names with standard convension, please use CAN1_MO19_EDATA6.
*/
#define	CAN1_EMO19DATA6	(CAN1_MO19_EDATA6)

/** \brief  1260, Message Object  Function Control Register */
#define CAN1_MO19_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029260u)

/** Alias (User Manual Name) for CAN1_MO19_FCR.
* To use register names with standard convension, please use CAN1_MO19_FCR.
*/
#define	CAN1_MOFCR19	(CAN1_MO19_FCR)

/** \brief  1264, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO19_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029264u)

/** Alias (User Manual Name) for CAN1_MO19_FGPR.
* To use register names with standard convension, please use CAN1_MO19_FGPR.
*/
#define	CAN1_MOFGPR19	(CAN1_MO19_FGPR)

/** \brief  1268, Message Object  Interrupt Pointer Register */
#define CAN1_MO19_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029268u)

