leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO19_IPR.
* To use register names with standard convension, please use CAN1_MO19_IPR.
*/
#define	CAN1_MOIPR19	(CAN1_MO19_IPR)

/** \brief  127C, Message Object  Control Register */
#define CAN1_MO19_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002927Cu)

/** Alias (User Manual Name) for CAN1_MO19_STAT.
* To use register names with standard convension, please use CAN1_MO19_STAT.
*/
#define	CAN1_MOSTAT19	(CAN1_MO19_STAT)

/** \brief  102C, Message Object  Acceptance Mask Register */
#define CAN1_MO1_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002902Cu)

/** Alias (User Manual Name) for CAN1_MO1_AMR.
* To use register names with standard convension, please use CAN1_MO1_AMR.
*/
#define	CAN1_MOAMR1	(CAN1_MO1_AMR)

/** \brief  1038, Message Object  Arbitration Register */
#define CAN1_MO1_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029038u)

/** Alias (User Manual Name) for CAN1_MO1_AR.
* To use register names with standard convension, please use CAN1_MO1_AR.
*/
#define	CAN1_MOAR1	(CAN1_MO1_AR)

/** \brief  103C, Message Object  Control Register */
#define CAN1_MO1_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002903Cu)

/** Alias (User Manual Name) for CAN1_MO1_CTR.
* To use register names with standard convension, please use CAN1_MO1_CTR.
*/
#define	CAN1_MOCTR1	(CAN1_MO1_CTR)

/** \brief  1034, Message Object  Data Register High */
#define CAN1_MO1_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029034u)

/** Alias (User Manual Name) for CAN1_MO1_DATAH.
* To use register names with standard convension, please use CAN1_MO1_DATAH.
*/
#define	CAN1_MODATAH1	(CAN1_MO1_DATAH)

/** \brief  1030, Message Object  Data Register Low */
#define CAN1_MO1_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029030u)

/** Alias (User Manual Name) for CAN1_MO1_DATAL.
* To use register names with standard convension, please use CAN1_MO1_DATAL.
*/
#define	CAN1_MODATAL1	(CAN1_MO1_DATAL)

/** \brief  1020, Message Object  Function Control Register */
#define CAN1_MO1_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029020u)

/** Alias (User Manual Name) for CAN1_MO1_EDATA0.
* To use register names with standard convension, please use CAN1_MO1_EDATA0.
*/
#define	CAN1_EMO1DATA0	(CAN1_MO1_EDATA0)

/** \brief  1024, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO1_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029024u)

/** Alias (User Manual Name) for CAN1_MO1_EDATA1.
* To use register names with standard convension, please use CAN1_MO1_EDATA1.
*/
#define	CAN1_EMO1DATA1	(CAN1_MO1_EDATA1)

/** \brief  1028, Message Object  Interrupt Pointer Register */
#define CAN1_MO1_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029028u)

/** Alias (User Manual Name) for CAN1_MO1_EDATA2.
* To use register names with standard convension, please use CAN1_MO1_EDATA2.
*/
#define	CAN1_EMO1DATA2	(CAN1_MO1_EDATA2)

/** \brief  102C, Message Object  Acceptance Mask Register */
#define CAN1_MO1_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002902Cu)

/** Alias (User Manual Name) for CAN1_MO1_EDATA3.
* To use register names with standard convension, please use CAN1_MO1_EDATA3.
*/
#define	CAN1_EMO1DATA3	(CAN1_MO1_EDATA3)

/** \brief  1030, Message Object  Data Register Low */
#define CAN1_MO1_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029030u)

/** Alias (User Manual Name) for CAN1_MO1_EDATA4.
* To use register names with standard convension, please use CAN1_MO1_EDATA4.
*/
#define	CAN1_EMO1DATA4	(CAN1_MO1_EDATA4)

/** \brief  1034, Message Object  Data Register High */
#define CAN1_MO1_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029034u)

/** Alias (User Manual Name) for CAN1_MO1_EDATA5.
* To use register names with standard convension, please use CAN1_MO1_EDATA5.
*/
#define	CAN1_EMO1DATA5	(CAN1_MO1_EDATA5)

/** \brief  1038, Message Object  Arbitration Register */
#define CAN1_MO1_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029038u)

/** Alias (User Manual Name) for CAN1_MO1_EDATA6.
* To use register names with standard convension, please use CAN1_MO1_EDATA6.
*/
#define	CAN1_EMO1DATA6	(CAN1_MO1_EDATA6)

/** \brief  1020, Message Object  Function Control Register */
#define CAN1_MO1_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029020u)

/** Alias (User Manual Name) for CAN1_MO1_FCR.
* To use register names with standard convension, please use CAN1_MO1_FCR.
*/
#define	CAN1_MOFCR1	(CAN1_MO1_FCR)

/** \brief  1024, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO1_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029024u)

/** Alias (User Manual Name) for CAN1_MO1_FGPR.
* To use register names with standard convension, please use CAN1_MO1_FGPR.
*/
#define	CAN1_MOFGPR1	(CAN1_MO1_FGPR)

/** \brief  1028, Message Object  Interrupt Pointer Register */
#define CAN1_MO1_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029028u)

/** Alias (User Manual Name) for CAN1_MO1_IPR.
* To use register names with standard convension, please use CAN1_MO1_IPR.
*/
#define	CAN1_MOIPR1	(CAN1_MO1_IPR)

/** \brief  103C, Message Object  Control Register */
#define CAN1_MO1_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002903Cu)

/** Alias (User Manual Name) for CAN1_MO1_STAT.
* To use register names with standard convension, please use CAN1_MO1_STAT.
*/
#define	CAN1_MOSTAT1	(CAN1_MO1_STAT)

/** \brief  128C, Message Object  Acceptance Mask Register */
#define CAN1_MO20_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002928Cu)

/** Alias (User Manual Name) for CAN1_MO20_AMR.
* To use register names with standard convension, please use CAN1_MO20_AMR.
*/
#define	CAN1_MOAMR20	(CAN1_MO20_AMR)

/** \brief  1298, Message Object  Arbitration Register */
#define CAN1_MO20_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029298u)

/** Alias (User Manual Name) for CAN1_MO20_AR.
* To use register names with standard convension, please use CAN1_MO20_AR.
*/
#define	CAN1_MOAR20	(CAN1_MO20_AR)

/** \brief  129C, Message Object  Control Register */
#define CAN1_MO20_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002929Cu)

/** Alias (User Manual Name) for CAN1_MO20_CTR.
* To use register names with standard convension, please use CAN1_MO20_CTR.
*/
#define	CAN1_MOCTR20	(CAN1_MO20_CTR)

