leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1294, Message Object  Data Register High */
#define CAN1_MO20_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029294u)

/** Alias (User Manual Name) for CAN1_MO20_DATAH.
* To use register names with standard convension, please use CAN1_MO20_DATAH.
*/
#define	CAN1_MODATAH20	(CAN1_MO20_DATAH)

/** \brief  1290, Message Object  Data Register Low */
#define CAN1_MO20_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029290u)

/** Alias (User Manual Name) for CAN1_MO20_DATAL.
* To use register names with standard convension, please use CAN1_MO20_DATAL.
*/
#define	CAN1_MODATAL20	(CAN1_MO20_DATAL)

/** \brief  1280, Message Object  Function Control Register */
#define CAN1_MO20_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029280u)

/** Alias (User Manual Name) for CAN1_MO20_EDATA0.
* To use register names with standard convension, please use CAN1_MO20_EDATA0.
*/
#define	CAN1_EMO20DATA0	(CAN1_MO20_EDATA0)

/** \brief  1284, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO20_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029284u)

/** Alias (User Manual Name) for CAN1_MO20_EDATA1.
* To use register names with standard convension, please use CAN1_MO20_EDATA1.
*/
#define	CAN1_EMO20DATA1	(CAN1_MO20_EDATA1)

/** \brief  1288, Message Object  Interrupt Pointer Register */
#define CAN1_MO20_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029288u)

/** Alias (User Manual Name) for CAN1_MO20_EDATA2.
* To use register names with standard convension, please use CAN1_MO20_EDATA2.
*/
#define	CAN1_EMO20DATA2	(CAN1_MO20_EDATA2)

/** \brief  128C, Message Object  Acceptance Mask Register */
#define CAN1_MO20_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002928Cu)

/** Alias (User Manual Name) for CAN1_MO20_EDATA3.
* To use register names with standard convension, please use CAN1_MO20_EDATA3.
*/
#define	CAN1_EMO20DATA3	(CAN1_MO20_EDATA3)

/** \brief  1290, Message Object  Data Register Low */
#define CAN1_MO20_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029290u)

/** Alias (User Manual Name) for CAN1_MO20_EDATA4.
* To use register names with standard convension, please use CAN1_MO20_EDATA4.
*/
#define	CAN1_EMO20DATA4	(CAN1_MO20_EDATA4)

/** \brief  1294, Message Object  Data Register High */
#define CAN1_MO20_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029294u)

/** Alias (User Manual Name) for CAN1_MO20_EDATA5.
* To use register names with standard convension, please use CAN1_MO20_EDATA5.
*/
#define	CAN1_EMO20DATA5	(CAN1_MO20_EDATA5)

/** \brief  1298, Message Object  Arbitration Register */
#define CAN1_MO20_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029298u)

/** Alias (User Manual Name) for CAN1_MO20_EDATA6.
* To use register names with standard convension, please use CAN1_MO20_EDATA6.
*/
#define	CAN1_EMO20DATA6	(CAN1_MO20_EDATA6)

/** \brief  1280, Message Object  Function Control Register */
#define CAN1_MO20_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029280u)

/** Alias (User Manual Name) for CAN1_MO20_FCR.
* To use register names with standard convension, please use CAN1_MO20_FCR.
*/
#define	CAN1_MOFCR20	(CAN1_MO20_FCR)

/** \brief  1284, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO20_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029284u)

/** Alias (User Manual Name) for CAN1_MO20_FGPR.
* To use register names with standard convension, please use CAN1_MO20_FGPR.
*/
#define	CAN1_MOFGPR20	(CAN1_MO20_FGPR)

/** \brief  1288, Message Object  Interrupt Pointer Register */
#define CAN1_MO20_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029288u)

/** Alias (User Manual Name) for CAN1_MO20_IPR.
* To use register names with standard convension, please use CAN1_MO20_IPR.
*/
#define	CAN1_MOIPR20	(CAN1_MO20_IPR)

/** \brief  129C, Message Object  Control Register */
#define CAN1_MO20_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002929Cu)

/** Alias (User Manual Name) for CAN1_MO20_STAT.
* To use register names with standard convension, please use CAN1_MO20_STAT.
*/
#define	CAN1_MOSTAT20	(CAN1_MO20_STAT)

/** \brief  12AC, Message Object  Acceptance Mask Register */
#define CAN1_MO21_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292ACu)

/** Alias (User Manual Name) for CAN1_MO21_AMR.
* To use register names with standard convension, please use CAN1_MO21_AMR.
*/
#define	CAN1_MOAMR21	(CAN1_MO21_AMR)

/** \brief  12B8, Message Object  Arbitration Register */
#define CAN1_MO21_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292B8u)

/** Alias (User Manual Name) for CAN1_MO21_AR.
* To use register names with standard convension, please use CAN1_MO21_AR.
*/
#define	CAN1_MOAR21	(CAN1_MO21_AR)

/** \brief  12BC, Message Object  Control Register */
#define CAN1_MO21_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00292BCu)

/** Alias (User Manual Name) for CAN1_MO21_CTR.
* To use register names with standard convension, please use CAN1_MO21_CTR.
*/
#define	CAN1_MOCTR21	(CAN1_MO21_CTR)

/** \brief  12B4, Message Object  Data Register High */
#define CAN1_MO21_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292B4u)

/** Alias (User Manual Name) for CAN1_MO21_DATAH.
* To use register names with standard convension, please use CAN1_MO21_DATAH.
*/
#define	CAN1_MODATAH21	(CAN1_MO21_DATAH)

/** \brief  12B0, Message Object  Data Register Low */
#define CAN1_MO21_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292B0u)

/** Alias (User Manual Name) for CAN1_MO21_DATAL.
* To use register names with standard convension, please use CAN1_MO21_DATAL.
*/
#define	CAN1_MODATAL21	(CAN1_MO21_DATAL)

/** \brief  12A0, Message Object  Function Control Register */
#define CAN1_MO21_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00292A0u)

/** Alias (User Manual Name) for CAN1_MO21_EDATA0.
* To use register names with standard convension, please use CAN1_MO21_EDATA0.
*/
#define	CAN1_EMO21DATA0	(CAN1_MO21_EDATA0)

/** \brief  12A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO21_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00292A4u)

/** Alias (User Manual Name) for CAN1_MO21_EDATA1.
* To use register names with standard convension, please use CAN1_MO21_EDATA1.
*/
#define	CAN1_EMO21DATA1	(CAN1_MO21_EDATA1)

