leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  12A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO21_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00292A8u)

/** Alias (User Manual Name) for CAN1_MO21_EDATA2.
* To use register names with standard convension, please use CAN1_MO21_EDATA2.
*/
#define	CAN1_EMO21DATA2	(CAN1_MO21_EDATA2)

/** \brief  12AC, Message Object  Acceptance Mask Register */
#define CAN1_MO21_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00292ACu)

/** Alias (User Manual Name) for CAN1_MO21_EDATA3.
* To use register names with standard convension, please use CAN1_MO21_EDATA3.
*/
#define	CAN1_EMO21DATA3	(CAN1_MO21_EDATA3)

/** \brief  12B0, Message Object  Data Register Low */
#define CAN1_MO21_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00292B0u)

/** Alias (User Manual Name) for CAN1_MO21_EDATA4.
* To use register names with standard convension, please use CAN1_MO21_EDATA4.
*/
#define	CAN1_EMO21DATA4	(CAN1_MO21_EDATA4)

/** \brief  12B4, Message Object  Data Register High */
#define CAN1_MO21_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00292B4u)

/** Alias (User Manual Name) for CAN1_MO21_EDATA5.
* To use register names with standard convension, please use CAN1_MO21_EDATA5.
*/
#define	CAN1_EMO21DATA5	(CAN1_MO21_EDATA5)

/** \brief  12B8, Message Object  Arbitration Register */
#define CAN1_MO21_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00292B8u)

/** Alias (User Manual Name) for CAN1_MO21_EDATA6.
* To use register names with standard convension, please use CAN1_MO21_EDATA6.
*/
#define	CAN1_EMO21DATA6	(CAN1_MO21_EDATA6)

/** \brief  12A0, Message Object  Function Control Register */
#define CAN1_MO21_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292A0u)

/** Alias (User Manual Name) for CAN1_MO21_FCR.
* To use register names with standard convension, please use CAN1_MO21_FCR.
*/
#define	CAN1_MOFCR21	(CAN1_MO21_FCR)

/** \brief  12A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO21_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292A4u)

/** Alias (User Manual Name) for CAN1_MO21_FGPR.
* To use register names with standard convension, please use CAN1_MO21_FGPR.
*/
#define	CAN1_MOFGPR21	(CAN1_MO21_FGPR)

/** \brief  12A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO21_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292A8u)

/** Alias (User Manual Name) for CAN1_MO21_IPR.
* To use register names with standard convension, please use CAN1_MO21_IPR.
*/
#define	CAN1_MOIPR21	(CAN1_MO21_IPR)

/** \brief  12BC, Message Object  Control Register */
#define CAN1_MO21_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00292BCu)

/** Alias (User Manual Name) for CAN1_MO21_STAT.
* To use register names with standard convension, please use CAN1_MO21_STAT.
*/
#define	CAN1_MOSTAT21	(CAN1_MO21_STAT)

/** \brief  12CC, Message Object  Acceptance Mask Register */
#define CAN1_MO22_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292CCu)

/** Alias (User Manual Name) for CAN1_MO22_AMR.
* To use register names with standard convension, please use CAN1_MO22_AMR.
*/
#define	CAN1_MOAMR22	(CAN1_MO22_AMR)

/** \brief  12D8, Message Object  Arbitration Register */
#define CAN1_MO22_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292D8u)

/** Alias (User Manual Name) for CAN1_MO22_AR.
* To use register names with standard convension, please use CAN1_MO22_AR.
*/
#define	CAN1_MOAR22	(CAN1_MO22_AR)

/** \brief  12DC, Message Object  Control Register */
#define CAN1_MO22_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00292DCu)

/** Alias (User Manual Name) for CAN1_MO22_CTR.
* To use register names with standard convension, please use CAN1_MO22_CTR.
*/
#define	CAN1_MOCTR22	(CAN1_MO22_CTR)

/** \brief  12D4, Message Object  Data Register High */
#define CAN1_MO22_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292D4u)

/** Alias (User Manual Name) for CAN1_MO22_DATAH.
* To use register names with standard convension, please use CAN1_MO22_DATAH.
*/
#define	CAN1_MODATAH22	(CAN1_MO22_DATAH)

/** \brief  12D0, Message Object  Data Register Low */
#define CAN1_MO22_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292D0u)

/** Alias (User Manual Name) for CAN1_MO22_DATAL.
* To use register names with standard convension, please use CAN1_MO22_DATAL.
*/
#define	CAN1_MODATAL22	(CAN1_MO22_DATAL)

/** \brief  12C0, Message Object  Function Control Register */
#define CAN1_MO22_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00292C0u)

/** Alias (User Manual Name) for CAN1_MO22_EDATA0.
* To use register names with standard convension, please use CAN1_MO22_EDATA0.
*/
#define	CAN1_EMO22DATA0	(CAN1_MO22_EDATA0)

/** \brief  12C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO22_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00292C4u)

/** Alias (User Manual Name) for CAN1_MO22_EDATA1.
* To use register names with standard convension, please use CAN1_MO22_EDATA1.
*/
#define	CAN1_EMO22DATA1	(CAN1_MO22_EDATA1)

/** \brief  12C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO22_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00292C8u)

/** Alias (User Manual Name) for CAN1_MO22_EDATA2.
* To use register names with standard convension, please use CAN1_MO22_EDATA2.
*/
#define	CAN1_EMO22DATA2	(CAN1_MO22_EDATA2)

/** \brief  12CC, Message Object  Acceptance Mask Register */
#define CAN1_MO22_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00292CCu)

/** Alias (User Manual Name) for CAN1_MO22_EDATA3.
* To use register names with standard convension, please use CAN1_MO22_EDATA3.
*/
#define	CAN1_EMO22DATA3	(CAN1_MO22_EDATA3)

/** \brief  12D0, Message Object  Data Register Low */
#define CAN1_MO22_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00292D0u)

/** Alias (User Manual Name) for CAN1_MO22_EDATA4.
* To use register names with standard convension, please use CAN1_MO22_EDATA4.
*/
#define	CAN1_EMO22DATA4	(CAN1_MO22_EDATA4)

/** \brief  12D4, Message Object  Data Register High */
#define CAN1_MO22_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00292D4u)

/** Alias (User Manual Name) for CAN1_MO22_EDATA5.
* To use register names with standard convension, please use CAN1_MO22_EDATA5.
*/
#define	CAN1_EMO22DATA5	(CAN1_MO22_EDATA5)

