leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  12D8, Message Object  Arbitration Register */
#define CAN1_MO22_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00292D8u)

/** Alias (User Manual Name) for CAN1_MO22_EDATA6.
* To use register names with standard convension, please use CAN1_MO22_EDATA6.
*/
#define	CAN1_EMO22DATA6	(CAN1_MO22_EDATA6)

/** \brief  12C0, Message Object  Function Control Register */
#define CAN1_MO22_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292C0u)

/** Alias (User Manual Name) for CAN1_MO22_FCR.
* To use register names with standard convension, please use CAN1_MO22_FCR.
*/
#define	CAN1_MOFCR22	(CAN1_MO22_FCR)

/** \brief  12C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO22_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292C4u)

/** Alias (User Manual Name) for CAN1_MO22_FGPR.
* To use register names with standard convension, please use CAN1_MO22_FGPR.
*/
#define	CAN1_MOFGPR22	(CAN1_MO22_FGPR)

/** \brief  12C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO22_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292C8u)

/** Alias (User Manual Name) for CAN1_MO22_IPR.
* To use register names with standard convension, please use CAN1_MO22_IPR.
*/
#define	CAN1_MOIPR22	(CAN1_MO22_IPR)

/** \brief  12DC, Message Object  Control Register */
#define CAN1_MO22_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00292DCu)

/** Alias (User Manual Name) for CAN1_MO22_STAT.
* To use register names with standard convension, please use CAN1_MO22_STAT.
*/
#define	CAN1_MOSTAT22	(CAN1_MO22_STAT)

/** \brief  12EC, Message Object  Acceptance Mask Register */
#define CAN1_MO23_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292ECu)

/** Alias (User Manual Name) for CAN1_MO23_AMR.
* To use register names with standard convension, please use CAN1_MO23_AMR.
*/
#define	CAN1_MOAMR23	(CAN1_MO23_AMR)

/** \brief  12F8, Message Object  Arbitration Register */
#define CAN1_MO23_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292F8u)

/** Alias (User Manual Name) for CAN1_MO23_AR.
* To use register names with standard convension, please use CAN1_MO23_AR.
*/
#define	CAN1_MOAR23	(CAN1_MO23_AR)

/** \brief  12FC, Message Object  Control Register */
#define CAN1_MO23_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00292FCu)

/** Alias (User Manual Name) for CAN1_MO23_CTR.
* To use register names with standard convension, please use CAN1_MO23_CTR.
*/
#define	CAN1_MOCTR23	(CAN1_MO23_CTR)

/** \brief  12F4, Message Object  Data Register High */
#define CAN1_MO23_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292F4u)

/** Alias (User Manual Name) for CAN1_MO23_DATAH.
* To use register names with standard convension, please use CAN1_MO23_DATAH.
*/
#define	CAN1_MODATAH23	(CAN1_MO23_DATAH)

/** \brief  12F0, Message Object  Data Register Low */
#define CAN1_MO23_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292F0u)

/** Alias (User Manual Name) for CAN1_MO23_DATAL.
* To use register names with standard convension, please use CAN1_MO23_DATAL.
*/
#define	CAN1_MODATAL23	(CAN1_MO23_DATAL)

/** \brief  12E0, Message Object  Function Control Register */
#define CAN1_MO23_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00292E0u)

/** Alias (User Manual Name) for CAN1_MO23_EDATA0.
* To use register names with standard convension, please use CAN1_MO23_EDATA0.
*/
#define	CAN1_EMO23DATA0	(CAN1_MO23_EDATA0)

/** \brief  12E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO23_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00292E4u)

/** Alias (User Manual Name) for CAN1_MO23_EDATA1.
* To use register names with standard convension, please use CAN1_MO23_EDATA1.
*/
#define	CAN1_EMO23DATA1	(CAN1_MO23_EDATA1)

/** \brief  12E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO23_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00292E8u)

/** Alias (User Manual Name) for CAN1_MO23_EDATA2.
* To use register names with standard convension, please use CAN1_MO23_EDATA2.
*/
#define	CAN1_EMO23DATA2	(CAN1_MO23_EDATA2)

/** \brief  12EC, Message Object  Acceptance Mask Register */
#define CAN1_MO23_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00292ECu)

/** Alias (User Manual Name) for CAN1_MO23_EDATA3.
* To use register names with standard convension, please use CAN1_MO23_EDATA3.
*/
#define	CAN1_EMO23DATA3	(CAN1_MO23_EDATA3)

/** \brief  12F0, Message Object  Data Register Low */
#define CAN1_MO23_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00292F0u)

/** Alias (User Manual Name) for CAN1_MO23_EDATA4.
* To use register names with standard convension, please use CAN1_MO23_EDATA4.
*/
#define	CAN1_EMO23DATA4	(CAN1_MO23_EDATA4)

/** \brief  12F4, Message Object  Data Register High */
#define CAN1_MO23_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00292F4u)

/** Alias (User Manual Name) for CAN1_MO23_EDATA5.
* To use register names with standard convension, please use CAN1_MO23_EDATA5.
*/
#define	CAN1_EMO23DATA5	(CAN1_MO23_EDATA5)

/** \brief  12F8, Message Object  Arbitration Register */
#define CAN1_MO23_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00292F8u)

/** Alias (User Manual Name) for CAN1_MO23_EDATA6.
* To use register names with standard convension, please use CAN1_MO23_EDATA6.
*/
#define	CAN1_EMO23DATA6	(CAN1_MO23_EDATA6)

/** \brief  12E0, Message Object  Function Control Register */
#define CAN1_MO23_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292E0u)

/** Alias (User Manual Name) for CAN1_MO23_FCR.
* To use register names with standard convension, please use CAN1_MO23_FCR.
*/
#define	CAN1_MOFCR23	(CAN1_MO23_FCR)

/** \brief  12E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO23_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292E4u)

/** Alias (User Manual Name) for CAN1_MO23_FGPR.
* To use register names with standard convension, please use CAN1_MO23_FGPR.
*/
#define	CAN1_MOFGPR23	(CAN1_MO23_FGPR)

/** \brief  12E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO23_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292E8u)

/** Alias (User Manual Name) for CAN1_MO23_IPR.
* To use register names with standard convension, please use CAN1_MO23_IPR.
*/
#define	CAN1_MOIPR23	(CAN1_MO23_IPR)

/** \brief  12FC, Message Object  Control Register */
#define CAN1_MO23_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00292FCu)

