leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO23_STAT.
* To use register names with standard convension, please use CAN1_MO23_STAT.
*/
#define	CAN1_MOSTAT23	(CAN1_MO23_STAT)

/** \brief  130C, Message Object  Acceptance Mask Register */
#define CAN1_MO24_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002930Cu)

/** Alias (User Manual Name) for CAN1_MO24_AMR.
* To use register names with standard convension, please use CAN1_MO24_AMR.
*/
#define	CAN1_MOAMR24	(CAN1_MO24_AMR)

/** \brief  1318, Message Object  Arbitration Register */
#define CAN1_MO24_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029318u)

/** Alias (User Manual Name) for CAN1_MO24_AR.
* To use register names with standard convension, please use CAN1_MO24_AR.
*/
#define	CAN1_MOAR24	(CAN1_MO24_AR)

/** \brief  131C, Message Object  Control Register */
#define CAN1_MO24_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002931Cu)

/** Alias (User Manual Name) for CAN1_MO24_CTR.
* To use register names with standard convension, please use CAN1_MO24_CTR.
*/
#define	CAN1_MOCTR24	(CAN1_MO24_CTR)

/** \brief  1314, Message Object  Data Register High */
#define CAN1_MO24_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029314u)

/** Alias (User Manual Name) for CAN1_MO24_DATAH.
* To use register names with standard convension, please use CAN1_MO24_DATAH.
*/
#define	CAN1_MODATAH24	(CAN1_MO24_DATAH)

/** \brief  1310, Message Object  Data Register Low */
#define CAN1_MO24_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029310u)

/** Alias (User Manual Name) for CAN1_MO24_DATAL.
* To use register names with standard convension, please use CAN1_MO24_DATAL.
*/
#define	CAN1_MODATAL24	(CAN1_MO24_DATAL)

/** \brief  1300, Message Object  Function Control Register */
#define CAN1_MO24_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029300u)

/** Alias (User Manual Name) for CAN1_MO24_EDATA0.
* To use register names with standard convension, please use CAN1_MO24_EDATA0.
*/
#define	CAN1_EMO24DATA0	(CAN1_MO24_EDATA0)

/** \brief  1304, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO24_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029304u)

/** Alias (User Manual Name) for CAN1_MO24_EDATA1.
* To use register names with standard convension, please use CAN1_MO24_EDATA1.
*/
#define	CAN1_EMO24DATA1	(CAN1_MO24_EDATA1)

/** \brief  1308, Message Object  Interrupt Pointer Register */
#define CAN1_MO24_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029308u)

/** Alias (User Manual Name) for CAN1_MO24_EDATA2.
* To use register names with standard convension, please use CAN1_MO24_EDATA2.
*/
#define	CAN1_EMO24DATA2	(CAN1_MO24_EDATA2)

/** \brief  130C, Message Object  Acceptance Mask Register */
#define CAN1_MO24_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002930Cu)

/** Alias (User Manual Name) for CAN1_MO24_EDATA3.
* To use register names with standard convension, please use CAN1_MO24_EDATA3.
*/
#define	CAN1_EMO24DATA3	(CAN1_MO24_EDATA3)

/** \brief  1310, Message Object  Data Register Low */
#define CAN1_MO24_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029310u)

/** Alias (User Manual Name) for CAN1_MO24_EDATA4.
* To use register names with standard convension, please use CAN1_MO24_EDATA4.
*/
#define	CAN1_EMO24DATA4	(CAN1_MO24_EDATA4)

/** \brief  1314, Message Object  Data Register High */
#define CAN1_MO24_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029314u)

/** Alias (User Manual Name) for CAN1_MO24_EDATA5.
* To use register names with standard convension, please use CAN1_MO24_EDATA5.
*/
#define	CAN1_EMO24DATA5	(CAN1_MO24_EDATA5)

/** \brief  1318, Message Object  Arbitration Register */
#define CAN1_MO24_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029318u)

/** Alias (User Manual Name) for CAN1_MO24_EDATA6.
* To use register names with standard convension, please use CAN1_MO24_EDATA6.
*/
#define	CAN1_EMO24DATA6	(CAN1_MO24_EDATA6)

/** \brief  1300, Message Object  Function Control Register */
#define CAN1_MO24_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029300u)

/** Alias (User Manual Name) for CAN1_MO24_FCR.
* To use register names with standard convension, please use CAN1_MO24_FCR.
*/
#define	CAN1_MOFCR24	(CAN1_MO24_FCR)

/** \brief  1304, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO24_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029304u)

/** Alias (User Manual Name) for CAN1_MO24_FGPR.
* To use register names with standard convension, please use CAN1_MO24_FGPR.
*/
#define	CAN1_MOFGPR24	(CAN1_MO24_FGPR)

/** \brief  1308, Message Object  Interrupt Pointer Register */
#define CAN1_MO24_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029308u)

/** Alias (User Manual Name) for CAN1_MO24_IPR.
* To use register names with standard convension, please use CAN1_MO24_IPR.
*/
#define	CAN1_MOIPR24	(CAN1_MO24_IPR)

/** \brief  131C, Message Object  Control Register */
#define CAN1_MO24_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002931Cu)

/** Alias (User Manual Name) for CAN1_MO24_STAT.
* To use register names with standard convension, please use CAN1_MO24_STAT.
*/
#define	CAN1_MOSTAT24	(CAN1_MO24_STAT)

/** \brief  132C, Message Object  Acceptance Mask Register */
#define CAN1_MO25_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002932Cu)

/** Alias (User Manual Name) for CAN1_MO25_AMR.
* To use register names with standard convension, please use CAN1_MO25_AMR.
*/
#define	CAN1_MOAMR25	(CAN1_MO25_AMR)

/** \brief  1338, Message Object  Arbitration Register */
#define CAN1_MO25_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029338u)

/** Alias (User Manual Name) for CAN1_MO25_AR.
* To use register names with standard convension, please use CAN1_MO25_AR.
*/
#define	CAN1_MOAR25	(CAN1_MO25_AR)

/** \brief  133C, Message Object  Control Register */
#define CAN1_MO25_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002933Cu)

/** Alias (User Manual Name) for CAN1_MO25_CTR.
* To use register names with standard convension, please use CAN1_MO25_CTR.
*/
#define	CAN1_MOCTR25	(CAN1_MO25_CTR)

/** \brief  1334, Message Object  Data Register High */
#define CAN1_MO25_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029334u)

/** Alias (User Manual Name) for CAN1_MO25_DATAH.
* To use register names with standard convension, please use CAN1_MO25_DATAH.
*/
#define	CAN1_MODATAH25	(CAN1_MO25_DATAH)

/** \brief  1330, Message Object  Data Register Low */
#define CAN1_MO25_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029330u)

/** Alias (User Manual Name) for CAN1_MO25_DATAL.
* To use register names with standard convension, please use CAN1_MO25_DATAL.
*/
#define	CAN1_MODATAL25	(CAN1_MO25_DATAL)

