leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1320, Message Object  Function Control Register */
#define CAN1_MO25_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029320u)

/** Alias (User Manual Name) for CAN1_MO25_EDATA0.
* To use register names with standard convension, please use CAN1_MO25_EDATA0.
*/
#define	CAN1_EMO25DATA0	(CAN1_MO25_EDATA0)

/** \brief  1324, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO25_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029324u)

/** Alias (User Manual Name) for CAN1_MO25_EDATA1.
* To use register names with standard convension, please use CAN1_MO25_EDATA1.
*/
#define	CAN1_EMO25DATA1	(CAN1_MO25_EDATA1)

/** \brief  1328, Message Object  Interrupt Pointer Register */
#define CAN1_MO25_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029328u)

/** Alias (User Manual Name) for CAN1_MO25_EDATA2.
* To use register names with standard convension, please use CAN1_MO25_EDATA2.
*/
#define	CAN1_EMO25DATA2	(CAN1_MO25_EDATA2)

/** \brief  132C, Message Object  Acceptance Mask Register */
#define CAN1_MO25_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002932Cu)

/** Alias (User Manual Name) for CAN1_MO25_EDATA3.
* To use register names with standard convension, please use CAN1_MO25_EDATA3.
*/
#define	CAN1_EMO25DATA3	(CAN1_MO25_EDATA3)

/** \brief  1330, Message Object  Data Register Low */
#define CAN1_MO25_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029330u)

/** Alias (User Manual Name) for CAN1_MO25_EDATA4.
* To use register names with standard convension, please use CAN1_MO25_EDATA4.
*/
#define	CAN1_EMO25DATA4	(CAN1_MO25_EDATA4)

/** \brief  1334, Message Object  Data Register High */
#define CAN1_MO25_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029334u)

/** Alias (User Manual Name) for CAN1_MO25_EDATA5.
* To use register names with standard convension, please use CAN1_MO25_EDATA5.
*/
#define	CAN1_EMO25DATA5	(CAN1_MO25_EDATA5)

/** \brief  1338, Message Object  Arbitration Register */
#define CAN1_MO25_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029338u)

/** Alias (User Manual Name) for CAN1_MO25_EDATA6.
* To use register names with standard convension, please use CAN1_MO25_EDATA6.
*/
#define	CAN1_EMO25DATA6	(CAN1_MO25_EDATA6)

/** \brief  1320, Message Object  Function Control Register */
#define CAN1_MO25_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029320u)

/** Alias (User Manual Name) for CAN1_MO25_FCR.
* To use register names with standard convension, please use CAN1_MO25_FCR.
*/
#define	CAN1_MOFCR25	(CAN1_MO25_FCR)

/** \brief  1324, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO25_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029324u)

/** Alias (User Manual Name) for CAN1_MO25_FGPR.
* To use register names with standard convension, please use CAN1_MO25_FGPR.
*/
#define	CAN1_MOFGPR25	(CAN1_MO25_FGPR)

/** \brief  1328, Message Object  Interrupt Pointer Register */
#define CAN1_MO25_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029328u)

/** Alias (User Manual Name) for CAN1_MO25_IPR.
* To use register names with standard convension, please use CAN1_MO25_IPR.
*/
#define	CAN1_MOIPR25	(CAN1_MO25_IPR)

/** \brief  133C, Message Object  Control Register */
#define CAN1_MO25_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002933Cu)

/** Alias (User Manual Name) for CAN1_MO25_STAT.
* To use register names with standard convension, please use CAN1_MO25_STAT.
*/
#define	CAN1_MOSTAT25	(CAN1_MO25_STAT)

/** \brief  134C, Message Object  Acceptance Mask Register */
#define CAN1_MO26_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002934Cu)

/** Alias (User Manual Name) for CAN1_MO26_AMR.
* To use register names with standard convension, please use CAN1_MO26_AMR.
*/
#define	CAN1_MOAMR26	(CAN1_MO26_AMR)

/** \brief  1358, Message Object  Arbitration Register */
#define CAN1_MO26_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029358u)

/** Alias (User Manual Name) for CAN1_MO26_AR.
* To use register names with standard convension, please use CAN1_MO26_AR.
*/
#define	CAN1_MOAR26	(CAN1_MO26_AR)

/** \brief  135C, Message Object  Control Register */
#define CAN1_MO26_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002935Cu)

/** Alias (User Manual Name) for CAN1_MO26_CTR.
* To use register names with standard convension, please use CAN1_MO26_CTR.
*/
#define	CAN1_MOCTR26	(CAN1_MO26_CTR)

/** \brief  1354, Message Object  Data Register High */
#define CAN1_MO26_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029354u)

/** Alias (User Manual Name) for CAN1_MO26_DATAH.
* To use register names with standard convension, please use CAN1_MO26_DATAH.
*/
#define	CAN1_MODATAH26	(CAN1_MO26_DATAH)

/** \brief  1350, Message Object  Data Register Low */
#define CAN1_MO26_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029350u)

/** Alias (User Manual Name) for CAN1_MO26_DATAL.
* To use register names with standard convension, please use CAN1_MO26_DATAL.
*/
#define	CAN1_MODATAL26	(CAN1_MO26_DATAL)

/** \brief  1340, Message Object  Function Control Register */
#define CAN1_MO26_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029340u)

/** Alias (User Manual Name) for CAN1_MO26_EDATA0.
* To use register names with standard convension, please use CAN1_MO26_EDATA0.
*/
#define	CAN1_EMO26DATA0	(CAN1_MO26_EDATA0)

/** \brief  1344, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO26_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029344u)

/** Alias (User Manual Name) for CAN1_MO26_EDATA1.
* To use register names with standard convension, please use CAN1_MO26_EDATA1.
*/
#define	CAN1_EMO26DATA1	(CAN1_MO26_EDATA1)

/** \brief  1348, Message Object  Interrupt Pointer Register */
#define CAN1_MO26_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029348u)

/** Alias (User Manual Name) for CAN1_MO26_EDATA2.
* To use register names with standard convension, please use CAN1_MO26_EDATA2.
*/
#define	CAN1_EMO26DATA2	(CAN1_MO26_EDATA2)

/** \brief  134C, Message Object  Acceptance Mask Register */
#define CAN1_MO26_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002934Cu)

