leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO26_EDATA3.
* To use register names with standard convension, please use CAN1_MO26_EDATA3.
*/
#define	CAN1_EMO26DATA3	(CAN1_MO26_EDATA3)

/** \brief  1350, Message Object  Data Register Low */
#define CAN1_MO26_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029350u)

/** Alias (User Manual Name) for CAN1_MO26_EDATA4.
* To use register names with standard convension, please use CAN1_MO26_EDATA4.
*/
#define	CAN1_EMO26DATA4	(CAN1_MO26_EDATA4)

/** \brief  1354, Message Object  Data Register High */
#define CAN1_MO26_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029354u)

/** Alias (User Manual Name) for CAN1_MO26_EDATA5.
* To use register names with standard convension, please use CAN1_MO26_EDATA5.
*/
#define	CAN1_EMO26DATA5	(CAN1_MO26_EDATA5)

/** \brief  1358, Message Object  Arbitration Register */
#define CAN1_MO26_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029358u)

/** Alias (User Manual Name) for CAN1_MO26_EDATA6.
* To use register names with standard convension, please use CAN1_MO26_EDATA6.
*/
#define	CAN1_EMO26DATA6	(CAN1_MO26_EDATA6)

/** \brief  1340, Message Object  Function Control Register */
#define CAN1_MO26_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029340u)

/** Alias (User Manual Name) for CAN1_MO26_FCR.
* To use register names with standard convension, please use CAN1_MO26_FCR.
*/
#define	CAN1_MOFCR26	(CAN1_MO26_FCR)

/** \brief  1344, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO26_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029344u)

/** Alias (User Manual Name) for CAN1_MO26_FGPR.
* To use register names with standard convension, please use CAN1_MO26_FGPR.
*/
#define	CAN1_MOFGPR26	(CAN1_MO26_FGPR)

/** \brief  1348, Message Object  Interrupt Pointer Register */
#define CAN1_MO26_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029348u)

/** Alias (User Manual Name) for CAN1_MO26_IPR.
* To use register names with standard convension, please use CAN1_MO26_IPR.
*/
#define	CAN1_MOIPR26	(CAN1_MO26_IPR)

/** \brief  135C, Message Object  Control Register */
#define CAN1_MO26_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002935Cu)

/** Alias (User Manual Name) for CAN1_MO26_STAT.
* To use register names with standard convension, please use CAN1_MO26_STAT.
*/
#define	CAN1_MOSTAT26	(CAN1_MO26_STAT)

/** \brief  136C, Message Object  Acceptance Mask Register */
#define CAN1_MO27_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002936Cu)

/** Alias (User Manual Name) for CAN1_MO27_AMR.
* To use register names with standard convension, please use CAN1_MO27_AMR.
*/
#define	CAN1_MOAMR27	(CAN1_MO27_AMR)

/** \brief  1378, Message Object  Arbitration Register */
#define CAN1_MO27_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029378u)

/** Alias (User Manual Name) for CAN1_MO27_AR.
* To use register names with standard convension, please use CAN1_MO27_AR.
*/
#define	CAN1_MOAR27	(CAN1_MO27_AR)

/** \brief  137C, Message Object  Control Register */
#define CAN1_MO27_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002937Cu)

/** Alias (User Manual Name) for CAN1_MO27_CTR.
* To use register names with standard convension, please use CAN1_MO27_CTR.
*/
#define	CAN1_MOCTR27	(CAN1_MO27_CTR)

/** \brief  1374, Message Object  Data Register High */
#define CAN1_MO27_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029374u)

/** Alias (User Manual Name) for CAN1_MO27_DATAH.
* To use register names with standard convension, please use CAN1_MO27_DATAH.
*/
#define	CAN1_MODATAH27	(CAN1_MO27_DATAH)

/** \brief  1370, Message Object  Data Register Low */
#define CAN1_MO27_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029370u)

/** Alias (User Manual Name) for CAN1_MO27_DATAL.
* To use register names with standard convension, please use CAN1_MO27_DATAL.
*/
#define	CAN1_MODATAL27	(CAN1_MO27_DATAL)

/** \brief  1360, Message Object  Function Control Register */
#define CAN1_MO27_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029360u)

/** Alias (User Manual Name) for CAN1_MO27_EDATA0.
* To use register names with standard convension, please use CAN1_MO27_EDATA0.
*/
#define	CAN1_EMO27DATA0	(CAN1_MO27_EDATA0)

/** \brief  1364, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO27_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029364u)

/** Alias (User Manual Name) for CAN1_MO27_EDATA1.
* To use register names with standard convension, please use CAN1_MO27_EDATA1.
*/
#define	CAN1_EMO27DATA1	(CAN1_MO27_EDATA1)

/** \brief  1368, Message Object  Interrupt Pointer Register */
#define CAN1_MO27_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029368u)

/** Alias (User Manual Name) for CAN1_MO27_EDATA2.
* To use register names with standard convension, please use CAN1_MO27_EDATA2.
*/
#define	CAN1_EMO27DATA2	(CAN1_MO27_EDATA2)

/** \brief  136C, Message Object  Acceptance Mask Register */
#define CAN1_MO27_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002936Cu)

/** Alias (User Manual Name) for CAN1_MO27_EDATA3.
* To use register names with standard convension, please use CAN1_MO27_EDATA3.
*/
#define	CAN1_EMO27DATA3	(CAN1_MO27_EDATA3)

/** \brief  1370, Message Object  Data Register Low */
#define CAN1_MO27_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029370u)

/** Alias (User Manual Name) for CAN1_MO27_EDATA4.
* To use register names with standard convension, please use CAN1_MO27_EDATA4.
*/
#define	CAN1_EMO27DATA4	(CAN1_MO27_EDATA4)

/** \brief  1374, Message Object  Data Register High */
#define CAN1_MO27_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029374u)

/** Alias (User Manual Name) for CAN1_MO27_EDATA5.
* To use register names with standard convension, please use CAN1_MO27_EDATA5.
*/
#define	CAN1_EMO27DATA5	(CAN1_MO27_EDATA5)

/** \brief  1378, Message Object  Arbitration Register */
#define CAN1_MO27_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029378u)

/** Alias (User Manual Name) for CAN1_MO27_EDATA6.
* To use register names with standard convension, please use CAN1_MO27_EDATA6.
*/
#define	CAN1_EMO27DATA6	(CAN1_MO27_EDATA6)

