leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1360, Message Object  Function Control Register */
#define CAN1_MO27_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029360u)

/** Alias (User Manual Name) for CAN1_MO27_FCR.
* To use register names with standard convension, please use CAN1_MO27_FCR.
*/
#define	CAN1_MOFCR27	(CAN1_MO27_FCR)

/** \brief  1364, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO27_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029364u)

/** Alias (User Manual Name) for CAN1_MO27_FGPR.
* To use register names with standard convension, please use CAN1_MO27_FGPR.
*/
#define	CAN1_MOFGPR27	(CAN1_MO27_FGPR)

/** \brief  1368, Message Object  Interrupt Pointer Register */
#define CAN1_MO27_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029368u)

/** Alias (User Manual Name) for CAN1_MO27_IPR.
* To use register names with standard convension, please use CAN1_MO27_IPR.
*/
#define	CAN1_MOIPR27	(CAN1_MO27_IPR)

/** \brief  137C, Message Object  Control Register */
#define CAN1_MO27_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002937Cu)

/** Alias (User Manual Name) for CAN1_MO27_STAT.
* To use register names with standard convension, please use CAN1_MO27_STAT.
*/
#define	CAN1_MOSTAT27	(CAN1_MO27_STAT)

/** \brief  138C, Message Object  Acceptance Mask Register */
#define CAN1_MO28_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002938Cu)

/** Alias (User Manual Name) for CAN1_MO28_AMR.
* To use register names with standard convension, please use CAN1_MO28_AMR.
*/
#define	CAN1_MOAMR28	(CAN1_MO28_AMR)

/** \brief  1398, Message Object  Arbitration Register */
#define CAN1_MO28_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029398u)

/** Alias (User Manual Name) for CAN1_MO28_AR.
* To use register names with standard convension, please use CAN1_MO28_AR.
*/
#define	CAN1_MOAR28	(CAN1_MO28_AR)

/** \brief  139C, Message Object  Control Register */
#define CAN1_MO28_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002939Cu)

/** Alias (User Manual Name) for CAN1_MO28_CTR.
* To use register names with standard convension, please use CAN1_MO28_CTR.
*/
#define	CAN1_MOCTR28	(CAN1_MO28_CTR)

/** \brief  1394, Message Object  Data Register High */
#define CAN1_MO28_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029394u)

/** Alias (User Manual Name) for CAN1_MO28_DATAH.
* To use register names with standard convension, please use CAN1_MO28_DATAH.
*/
#define	CAN1_MODATAH28	(CAN1_MO28_DATAH)

/** \brief  1390, Message Object  Data Register Low */
#define CAN1_MO28_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029390u)

/** Alias (User Manual Name) for CAN1_MO28_DATAL.
* To use register names with standard convension, please use CAN1_MO28_DATAL.
*/
#define	CAN1_MODATAL28	(CAN1_MO28_DATAL)

/** \brief  1380, Message Object  Function Control Register */
#define CAN1_MO28_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029380u)

/** Alias (User Manual Name) for CAN1_MO28_EDATA0.
* To use register names with standard convension, please use CAN1_MO28_EDATA0.
*/
#define	CAN1_EMO28DATA0	(CAN1_MO28_EDATA0)

/** \brief  1384, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO28_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029384u)

/** Alias (User Manual Name) for CAN1_MO28_EDATA1.
* To use register names with standard convension, please use CAN1_MO28_EDATA1.
*/
#define	CAN1_EMO28DATA1	(CAN1_MO28_EDATA1)

/** \brief  1388, Message Object  Interrupt Pointer Register */
#define CAN1_MO28_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029388u)

/** Alias (User Manual Name) for CAN1_MO28_EDATA2.
* To use register names with standard convension, please use CAN1_MO28_EDATA2.
*/
#define	CAN1_EMO28DATA2	(CAN1_MO28_EDATA2)

/** \brief  138C, Message Object  Acceptance Mask Register */
#define CAN1_MO28_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002938Cu)

/** Alias (User Manual Name) for CAN1_MO28_EDATA3.
* To use register names with standard convension, please use CAN1_MO28_EDATA3.
*/
#define	CAN1_EMO28DATA3	(CAN1_MO28_EDATA3)

/** \brief  1390, Message Object  Data Register Low */
#define CAN1_MO28_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029390u)

/** Alias (User Manual Name) for CAN1_MO28_EDATA4.
* To use register names with standard convension, please use CAN1_MO28_EDATA4.
*/
#define	CAN1_EMO28DATA4	(CAN1_MO28_EDATA4)

/** \brief  1394, Message Object  Data Register High */
#define CAN1_MO28_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029394u)

/** Alias (User Manual Name) for CAN1_MO28_EDATA5.
* To use register names with standard convension, please use CAN1_MO28_EDATA5.
*/
#define	CAN1_EMO28DATA5	(CAN1_MO28_EDATA5)

/** \brief  1398, Message Object  Arbitration Register */
#define CAN1_MO28_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029398u)

/** Alias (User Manual Name) for CAN1_MO28_EDATA6.
* To use register names with standard convension, please use CAN1_MO28_EDATA6.
*/
#define	CAN1_EMO28DATA6	(CAN1_MO28_EDATA6)

/** \brief  1380, Message Object  Function Control Register */
#define CAN1_MO28_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029380u)

/** Alias (User Manual Name) for CAN1_MO28_FCR.
* To use register names with standard convension, please use CAN1_MO28_FCR.
*/
#define	CAN1_MOFCR28	(CAN1_MO28_FCR)

/** \brief  1384, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO28_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029384u)

/** Alias (User Manual Name) for CAN1_MO28_FGPR.
* To use register names with standard convension, please use CAN1_MO28_FGPR.
*/
#define	CAN1_MOFGPR28	(CAN1_MO28_FGPR)

/** \brief  1388, Message Object  Interrupt Pointer Register */
#define CAN1_MO28_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029388u)

/** Alias (User Manual Name) for CAN1_MO28_IPR.
* To use register names with standard convension, please use CAN1_MO28_IPR.
*/
#define	CAN1_MOIPR28	(CAN1_MO28_IPR)

/** \brief  139C, Message Object  Control Register */
#define CAN1_MO28_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002939Cu)

/** Alias (User Manual Name) for CAN1_MO28_STAT.
* To use register names with standard convension, please use CAN1_MO28_STAT.
*/
#define	CAN1_MOSTAT28	(CAN1_MO28_STAT)

/** \brief  13AC, Message Object  Acceptance Mask Register */
#define CAN1_MO29_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00293ACu)

/** Alias (User Manual Name) for CAN1_MO29_AMR.
* To use register names with standard convension, please use CAN1_MO29_AMR.
*/
#define	CAN1_MOAMR29	(CAN1_MO29_AMR)

/** \brief  13B8, Message Object  Arbitration Register */
#define CAN1_MO29_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00293B8u)

/** Alias (User Manual Name) for CAN1_MO29_AR.
* To use register names with standard convension, please use CAN1_MO29_AR.
*/
#define	CAN1_MOAR29	(CAN1_MO29_AR)

/** \brief  13BC, Message Object  Control Register */
#define CAN1_MO29_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00293BCu)

/** Alias (User Manual Name) for CAN1_MO29_CTR.
* To use register names with standard convension, please use CAN1_MO29_CTR.
*/
#define	CAN1_MOCTR29	(CAN1_MO29_CTR)

/** \brief  13B4, Message Object  Data Register High */
#define CAN1_MO29_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00293B4u)

/** Alias (User Manual Name) for CAN1_MO29_DATAH.
* To use register names with standard convension, please use CAN1_MO29_DATAH.
*/
#define	CAN1_MODATAH29	(CAN1_MO29_DATAH)

