leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  13B0, Message Object  Data Register Low */
#define CAN1_MO29_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00293B0u)

/** Alias (User Manual Name) for CAN1_MO29_DATAL.
* To use register names with standard convension, please use CAN1_MO29_DATAL.
*/
#define	CAN1_MODATAL29	(CAN1_MO29_DATAL)

/** \brief  13A0, Message Object  Function Control Register */
#define CAN1_MO29_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00293A0u)

/** Alias (User Manual Name) for CAN1_MO29_EDATA0.
* To use register names with standard convension, please use CAN1_MO29_EDATA0.
*/
#define	CAN1_EMO29DATA0	(CAN1_MO29_EDATA0)

/** \brief  13A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO29_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00293A4u)

/** Alias (User Manual Name) for CAN1_MO29_EDATA1.
* To use register names with standard convension, please use CAN1_MO29_EDATA1.
*/
#define	CAN1_EMO29DATA1	(CAN1_MO29_EDATA1)

/** \brief  13A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO29_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00293A8u)

/** Alias (User Manual Name) for CAN1_MO29_EDATA2.
* To use register names with standard convension, please use CAN1_MO29_EDATA2.
*/
#define	CAN1_EMO29DATA2	(CAN1_MO29_EDATA2)

/** \brief  13AC, Message Object  Acceptance Mask Register */
#define CAN1_MO29_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00293ACu)

/** Alias (User Manual Name) for CAN1_MO29_EDATA3.
* To use register names with standard convension, please use CAN1_MO29_EDATA3.
*/
#define	CAN1_EMO29DATA3	(CAN1_MO29_EDATA3)

/** \brief  13B0, Message Object  Data Register Low */
#define CAN1_MO29_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00293B0u)

/** Alias (User Manual Name) for CAN1_MO29_EDATA4.
* To use register names with standard convension, please use CAN1_MO29_EDATA4.
*/
#define	CAN1_EMO29DATA4	(CAN1_MO29_EDATA4)

/** \brief  13B4, Message Object  Data Register High */
#define CAN1_MO29_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00293B4u)

/** Alias (User Manual Name) for CAN1_MO29_EDATA5.
* To use register names with standard convension, please use CAN1_MO29_EDATA5.
*/
#define	CAN1_EMO29DATA5	(CAN1_MO29_EDATA5)

/** \brief  13B8, Message Object  Arbitration Register */
#define CAN1_MO29_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00293B8u)

/** Alias (User Manual Name) for CAN1_MO29_EDATA6.
* To use register names with standard convension, please use CAN1_MO29_EDATA6.
*/
#define	CAN1_EMO29DATA6	(CAN1_MO29_EDATA6)

/** \brief  13A0, Message Object  Function Control Register */
#define CAN1_MO29_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00293A0u)

/** Alias (User Manual Name) for CAN1_MO29_FCR.
* To use register names with standard convension, please use CAN1_MO29_FCR.
*/
#define	CAN1_MOFCR29	(CAN1_MO29_FCR)

/** \brief  13A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO29_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00293A4u)

/** Alias (User Manual Name) for CAN1_MO29_FGPR.
* To use register names with standard convension, please use CAN1_MO29_FGPR.
*/
#define	CAN1_MOFGPR29	(CAN1_MO29_FGPR)

/** \brief  13A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO29_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00293A8u)

/** Alias (User Manual Name) for CAN1_MO29_IPR.
* To use register names with standard convension, please use CAN1_MO29_IPR.
*/
#define	CAN1_MOIPR29	(CAN1_MO29_IPR)

/** \brief  13BC, Message Object  Control Register */
#define CAN1_MO29_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00293BCu)

/** Alias (User Manual Name) for CAN1_MO29_STAT.
* To use register names with standard convension, please use CAN1_MO29_STAT.
*/
#define	CAN1_MOSTAT29	(CAN1_MO29_STAT)

/** \brief  104C, Message Object  Acceptance Mask Register */
#define CAN1_MO2_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002904Cu)

/** Alias (User Manual Name) for CAN1_MO2_AMR.
* To use register names with standard convension, please use CAN1_MO2_AMR.
*/
#define	CAN1_MOAMR2	(CAN1_MO2_AMR)

/** \brief  1058, Message Object  Arbitration Register */
#define CAN1_MO2_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029058u)

/** Alias (User Manual Name) for CAN1_MO2_AR.
* To use register names with standard convension, please use CAN1_MO2_AR.
*/
#define	CAN1_MOAR2	(CAN1_MO2_AR)

/** \brief  105C, Message Object  Control Register */
#define CAN1_MO2_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002905Cu)

/** Alias (User Manual Name) for CAN1_MO2_CTR.
* To use register names with standard convension, please use CAN1_MO2_CTR.
*/
#define	CAN1_MOCTR2	(CAN1_MO2_CTR)

/** \brief  1054, Message Object  Data Register High */
#define CAN1_MO2_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029054u)

/** Alias (User Manual Name) for CAN1_MO2_DATAH.
* To use register names with standard convension, please use CAN1_MO2_DATAH.
*/
#define	CAN1_MODATAH2	(CAN1_MO2_DATAH)

/** \brief  1050, Message Object  Data Register Low */
#define CAN1_MO2_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029050u)

/** Alias (User Manual Name) for CAN1_MO2_DATAL.
* To use register names with standard convension, please use CAN1_MO2_DATAL.
*/
#define	CAN1_MODATAL2	(CAN1_MO2_DATAL)

/** \brief  1040, Message Object  Function Control Register */
#define CAN1_MO2_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029040u)

/** Alias (User Manual Name) for CAN1_MO2_EDATA0.
* To use register names with standard convension, please use CAN1_MO2_EDATA0.
*/
#define	CAN1_EMO2DATA0	(CAN1_MO2_EDATA0)

/** \brief  1044, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO2_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029044u)

/** Alias (User Manual Name) for CAN1_MO2_EDATA1.
* To use register names with standard convension, please use CAN1_MO2_EDATA1.
*/
#define	CAN1_EMO2DATA1	(CAN1_MO2_EDATA1)

/** \brief  1048, Message Object  Interrupt Pointer Register */
#define CAN1_MO2_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029048u)

/** Alias (User Manual Name) for CAN1_MO2_EDATA2.
* To use register names with standard convension, please use CAN1_MO2_EDATA2.
*/
#define	CAN1_EMO2DATA2	(CAN1_MO2_EDATA2)

/** \brief  104C, Message Object  Acceptance Mask Register */
#define CAN1_MO2_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002904Cu)

