leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO2_EDATA3.
* To use register names with standard convension, please use CAN1_MO2_EDATA3.
*/
#define	CAN1_EMO2DATA3	(CAN1_MO2_EDATA3)

/** \brief  1050, Message Object  Data Register Low */
#define CAN1_MO2_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029050u)

/** Alias (User Manual Name) for CAN1_MO2_EDATA4.
* To use register names with standard convension, please use CAN1_MO2_EDATA4.
*/
#define	CAN1_EMO2DATA4	(CAN1_MO2_EDATA4)

/** \brief  1054, Message Object  Data Register High */
#define CAN1_MO2_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029054u)

/** Alias (User Manual Name) for CAN1_MO2_EDATA5.
* To use register names with standard convension, please use CAN1_MO2_EDATA5.
*/
#define	CAN1_EMO2DATA5	(CAN1_MO2_EDATA5)

/** \brief  1058, Message Object  Arbitration Register */
#define CAN1_MO2_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029058u)

/** Alias (User Manual Name) for CAN1_MO2_EDATA6.
* To use register names with standard convension, please use CAN1_MO2_EDATA6.
*/
#define	CAN1_EMO2DATA6	(CAN1_MO2_EDATA6)

/** \brief  1040, Message Object  Function Control Register */
#define CAN1_MO2_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029040u)

/** Alias (User Manual Name) for CAN1_MO2_FCR.
* To use register names with standard convension, please use CAN1_MO2_FCR.
*/
#define	CAN1_MOFCR2	(CAN1_MO2_FCR)

/** \brief  1044, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO2_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029044u)

/** Alias (User Manual Name) for CAN1_MO2_FGPR.
* To use register names with standard convension, please use CAN1_MO2_FGPR.
*/
#define	CAN1_MOFGPR2	(CAN1_MO2_FGPR)

/** \brief  1048, Message Object  Interrupt Pointer Register */
#define CAN1_MO2_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029048u)

/** Alias (User Manual Name) for CAN1_MO2_IPR.
* To use register names with standard convension, please use CAN1_MO2_IPR.
*/
#define	CAN1_MOIPR2	(CAN1_MO2_IPR)

/** \brief  105C, Message Object  Control Register */
#define CAN1_MO2_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002905Cu)

/** Alias (User Manual Name) for CAN1_MO2_STAT.
* To use register names with standard convension, please use CAN1_MO2_STAT.
*/
#define	CAN1_MOSTAT2	(CAN1_MO2_STAT)

/** \brief  13CC, Message Object  Acceptance Mask Register */
#define CAN1_MO30_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00293CCu)

/** Alias (User Manual Name) for CAN1_MO30_AMR.
* To use register names with standard convension, please use CAN1_MO30_AMR.
*/
#define	CAN1_MOAMR30	(CAN1_MO30_AMR)

/** \brief  13D8, Message Object  Arbitration Register */
#define CAN1_MO30_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00293D8u)

/** Alias (User Manual Name) for CAN1_MO30_AR.
* To use register names with standard convension, please use CAN1_MO30_AR.
*/
#define	CAN1_MOAR30	(CAN1_MO30_AR)

/** \brief  13DC, Message Object  Control Register */
#define CAN1_MO30_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00293DCu)

/** Alias (User Manual Name) for CAN1_MO30_CTR.
* To use register names with standard convension, please use CAN1_MO30_CTR.
*/
#define	CAN1_MOCTR30	(CAN1_MO30_CTR)

/** \brief  13D4, Message Object  Data Register High */
#define CAN1_MO30_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00293D4u)

/** Alias (User Manual Name) for CAN1_MO30_DATAH.
* To use register names with standard convension, please use CAN1_MO30_DATAH.
*/
#define	CAN1_MODATAH30	(CAN1_MO30_DATAH)

/** \brief  13D0, Message Object  Data Register Low */
#define CAN1_MO30_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00293D0u)

/** Alias (User Manual Name) for CAN1_MO30_DATAL.
* To use register names with standard convension, please use CAN1_MO30_DATAL.
*/
#define	CAN1_MODATAL30	(CAN1_MO30_DATAL)

/** \brief  13C0, Message Object  Function Control Register */
#define CAN1_MO30_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00293C0u)

/** Alias (User Manual Name) for CAN1_MO30_EDATA0.
* To use register names with standard convension, please use CAN1_MO30_EDATA0.
*/
#define	CAN1_EMO30DATA0	(CAN1_MO30_EDATA0)

/** \brief  13C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO30_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00293C4u)

/** Alias (User Manual Name) for CAN1_MO30_EDATA1.
* To use register names with standard convension, please use CAN1_MO30_EDATA1.
*/
#define	CAN1_EMO30DATA1	(CAN1_MO30_EDATA1)

/** \brief  13C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO30_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00293C8u)

/** Alias (User Manual Name) for CAN1_MO30_EDATA2.
* To use register names with standard convension, please use CAN1_MO30_EDATA2.
*/
#define	CAN1_EMO30DATA2	(CAN1_MO30_EDATA2)

/** \brief  13CC, Message Object  Acceptance Mask Register */
#define CAN1_MO30_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00293CCu)

/** Alias (User Manual Name) for CAN1_MO30_EDATA3.
* To use register names with standard convension, please use CAN1_MO30_EDATA3.
*/
#define	CAN1_EMO30DATA3	(CAN1_MO30_EDATA3)

/** \brief  13D0, Message Object  Data Register Low */
#define CAN1_MO30_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00293D0u)

/** Alias (User Manual Name) for CAN1_MO30_EDATA4.
* To use register names with standard convension, please use CAN1_MO30_EDATA4.
*/
#define	CAN1_EMO30DATA4	(CAN1_MO30_EDATA4)

/** \brief  13D4, Message Object  Data Register High */
#define CAN1_MO30_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00293D4u)

/** Alias (User Manual Name) for CAN1_MO30_EDATA5.
* To use register names with standard convension, please use CAN1_MO30_EDATA5.
*/
#define	CAN1_EMO30DATA5	(CAN1_MO30_EDATA5)

/** \brief  13D8, Message Object  Arbitration Register */
#define CAN1_MO30_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00293D8u)

/** Alias (User Manual Name) for CAN1_MO30_EDATA6.
* To use register names with standard convension, please use CAN1_MO30_EDATA6.
*/
#define	CAN1_EMO30DATA6	(CAN1_MO30_EDATA6)

/** \brief  13C0, Message Object  Function Control Register */
#define CAN1_MO30_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00293C0u)

/** Alias (User Manual Name) for CAN1_MO30_FCR.
* To use register names with standard convension, please use CAN1_MO30_FCR.
*/
#define	CAN1_MOFCR30	(CAN1_MO30_FCR)

/** \brief  13C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO30_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00293C4u)

/** Alias (User Manual Name) for CAN1_MO30_FGPR.
* To use register names with standard convension, please use CAN1_MO30_FGPR.
*/
#define	CAN1_MOFGPR30	(CAN1_MO30_FGPR)

/** \brief  13C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO30_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00293C8u)

/** Alias (User Manual Name) for CAN1_MO30_IPR.
* To use register names with standard convension, please use CAN1_MO30_IPR.
*/
#define	CAN1_MOIPR30	(CAN1_MO30_IPR)

