leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  13DC, Message Object  Control Register */
#define CAN1_MO30_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00293DCu)

/** Alias (User Manual Name) for CAN1_MO30_STAT.
* To use register names with standard convension, please use CAN1_MO30_STAT.
*/
#define	CAN1_MOSTAT30	(CAN1_MO30_STAT)

/** \brief  13EC, Message Object  Acceptance Mask Register */
#define CAN1_MO31_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00293ECu)

/** Alias (User Manual Name) for CAN1_MO31_AMR.
* To use register names with standard convension, please use CAN1_MO31_AMR.
*/
#define	CAN1_MOAMR31	(CAN1_MO31_AMR)

/** \brief  13F8, Message Object  Arbitration Register */
#define CAN1_MO31_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00293F8u)

/** Alias (User Manual Name) for CAN1_MO31_AR.
* To use register names with standard convension, please use CAN1_MO31_AR.
*/
#define	CAN1_MOAR31	(CAN1_MO31_AR)

/** \brief  13FC, Message Object  Control Register */
#define CAN1_MO31_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00293FCu)

/** Alias (User Manual Name) for CAN1_MO31_CTR.
* To use register names with standard convension, please use CAN1_MO31_CTR.
*/
#define	CAN1_MOCTR31	(CAN1_MO31_CTR)

/** \brief  13F4, Message Object  Data Register High */
#define CAN1_MO31_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00293F4u)

/** Alias (User Manual Name) for CAN1_MO31_DATAH.
* To use register names with standard convension, please use CAN1_MO31_DATAH.
*/
#define	CAN1_MODATAH31	(CAN1_MO31_DATAH)

/** \brief  13F0, Message Object  Data Register Low */
#define CAN1_MO31_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00293F0u)

/** Alias (User Manual Name) for CAN1_MO31_DATAL.
* To use register names with standard convension, please use CAN1_MO31_DATAL.
*/
#define	CAN1_MODATAL31	(CAN1_MO31_DATAL)

/** \brief  13E0, Message Object  Function Control Register */
#define CAN1_MO31_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00293E0u)

/** Alias (User Manual Name) for CAN1_MO31_EDATA0.
* To use register names with standard convension, please use CAN1_MO31_EDATA0.
*/
#define	CAN1_EMO31DATA0	(CAN1_MO31_EDATA0)

/** \brief  13E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO31_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00293E4u)

/** Alias (User Manual Name) for CAN1_MO31_EDATA1.
* To use register names with standard convension, please use CAN1_MO31_EDATA1.
*/
#define	CAN1_EMO31DATA1	(CAN1_MO31_EDATA1)

/** \brief  13E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO31_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00293E8u)

/** Alias (User Manual Name) for CAN1_MO31_EDATA2.
* To use register names with standard convension, please use CAN1_MO31_EDATA2.
*/
#define	CAN1_EMO31DATA2	(CAN1_MO31_EDATA2)

/** \brief  13EC, Message Object  Acceptance Mask Register */
#define CAN1_MO31_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00293ECu)

/** Alias (User Manual Name) for CAN1_MO31_EDATA3.
* To use register names with standard convension, please use CAN1_MO31_EDATA3.
*/
#define	CAN1_EMO31DATA3	(CAN1_MO31_EDATA3)

/** \brief  13F0, Message Object  Data Register Low */
#define CAN1_MO31_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00293F0u)

/** Alias (User Manual Name) for CAN1_MO31_EDATA4.
* To use register names with standard convension, please use CAN1_MO31_EDATA4.
*/
#define	CAN1_EMO31DATA4	(CAN1_MO31_EDATA4)

/** \brief  13F4, Message Object  Data Register High */
#define CAN1_MO31_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00293F4u)

/** Alias (User Manual Name) for CAN1_MO31_EDATA5.
* To use register names with standard convension, please use CAN1_MO31_EDATA5.
*/
#define	CAN1_EMO31DATA5	(CAN1_MO31_EDATA5)

/** \brief  13F8, Message Object  Arbitration Register */
#define CAN1_MO31_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00293F8u)

/** Alias (User Manual Name) for CAN1_MO31_EDATA6.
* To use register names with standard convension, please use CAN1_MO31_EDATA6.
*/
#define	CAN1_EMO31DATA6	(CAN1_MO31_EDATA6)

/** \brief  13E0, Message Object  Function Control Register */
#define CAN1_MO31_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00293E0u)

/** Alias (User Manual Name) for CAN1_MO31_FCR.
* To use register names with standard convension, please use CAN1_MO31_FCR.
*/
#define	CAN1_MOFCR31	(CAN1_MO31_FCR)

/** \brief  13E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO31_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00293E4u)

/** Alias (User Manual Name) for CAN1_MO31_FGPR.
* To use register names with standard convension, please use CAN1_MO31_FGPR.
*/
#define	CAN1_MOFGPR31	(CAN1_MO31_FGPR)

/** \brief  13E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO31_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00293E8u)

/** Alias (User Manual Name) for CAN1_MO31_IPR.
* To use register names with standard convension, please use CAN1_MO31_IPR.
*/
#define	CAN1_MOIPR31	(CAN1_MO31_IPR)

/** \brief  13FC, Message Object  Control Register */
#define CAN1_MO31_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00293FCu)

/** Alias (User Manual Name) for CAN1_MO31_STAT.
* To use register names with standard convension, please use CAN1_MO31_STAT.
*/
#define	CAN1_MOSTAT31	(CAN1_MO31_STAT)

/** \brief  140C, Message Object  Acceptance Mask Register */
#define CAN1_MO32_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002940Cu)

/** Alias (User Manual Name) for CAN1_MO32_AMR.
* To use register names with standard convension, please use CAN1_MO32_AMR.
*/
#define	CAN1_MOAMR32	(CAN1_MO32_AMR)

/** \brief  1418, Message Object  Arbitration Register */
#define CAN1_MO32_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029418u)

/** Alias (User Manual Name) for CAN1_MO32_AR.
* To use register names with standard convension, please use CAN1_MO32_AR.
*/
#define	CAN1_MOAR32	(CAN1_MO32_AR)

/** \brief  141C, Message Object  Control Register */
#define CAN1_MO32_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002941Cu)

/** Alias (User Manual Name) for CAN1_MO32_CTR.
* To use register names with standard convension, please use CAN1_MO32_CTR.
*/
#define	CAN1_MOCTR32	(CAN1_MO32_CTR)

/** \brief  1414, Message Object  Data Register High */
#define CAN1_MO32_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029414u)

