leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO32_DATAH.
* To use register names with standard convension, please use CAN1_MO32_DATAH.
*/
#define	CAN1_MODATAH32	(CAN1_MO32_DATAH)

/** \brief  1410, Message Object  Data Register Low */
#define CAN1_MO32_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029410u)

/** Alias (User Manual Name) for CAN1_MO32_DATAL.
* To use register names with standard convension, please use CAN1_MO32_DATAL.
*/
#define	CAN1_MODATAL32	(CAN1_MO32_DATAL)

/** \brief  1400, Message Object  Function Control Register */
#define CAN1_MO32_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029400u)

/** Alias (User Manual Name) for CAN1_MO32_EDATA0.
* To use register names with standard convension, please use CAN1_MO32_EDATA0.
*/
#define	CAN1_EMO32DATA0	(CAN1_MO32_EDATA0)

/** \brief  1404, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO32_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029404u)

/** Alias (User Manual Name) for CAN1_MO32_EDATA1.
* To use register names with standard convension, please use CAN1_MO32_EDATA1.
*/
#define	CAN1_EMO32DATA1	(CAN1_MO32_EDATA1)

/** \brief  1408, Message Object  Interrupt Pointer Register */
#define CAN1_MO32_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029408u)

/** Alias (User Manual Name) for CAN1_MO32_EDATA2.
* To use register names with standard convension, please use CAN1_MO32_EDATA2.
*/
#define	CAN1_EMO32DATA2	(CAN1_MO32_EDATA2)

/** \brief  140C, Message Object  Acceptance Mask Register */
#define CAN1_MO32_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002940Cu)

/** Alias (User Manual Name) for CAN1_MO32_EDATA3.
* To use register names with standard convension, please use CAN1_MO32_EDATA3.
*/
#define	CAN1_EMO32DATA3	(CAN1_MO32_EDATA3)

/** \brief  1410, Message Object  Data Register Low */
#define CAN1_MO32_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029410u)

/** Alias (User Manual Name) for CAN1_MO32_EDATA4.
* To use register names with standard convension, please use CAN1_MO32_EDATA4.
*/
#define	CAN1_EMO32DATA4	(CAN1_MO32_EDATA4)

/** \brief  1414, Message Object  Data Register High */
#define CAN1_MO32_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029414u)

/** Alias (User Manual Name) for CAN1_MO32_EDATA5.
* To use register names with standard convension, please use CAN1_MO32_EDATA5.
*/
#define	CAN1_EMO32DATA5	(CAN1_MO32_EDATA5)

/** \brief  1418, Message Object  Arbitration Register */
#define CAN1_MO32_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029418u)

/** Alias (User Manual Name) for CAN1_MO32_EDATA6.
* To use register names with standard convension, please use CAN1_MO32_EDATA6.
*/
#define	CAN1_EMO32DATA6	(CAN1_MO32_EDATA6)

/** \brief  1400, Message Object  Function Control Register */
#define CAN1_MO32_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029400u)

/** Alias (User Manual Name) for CAN1_MO32_FCR.
* To use register names with standard convension, please use CAN1_MO32_FCR.
*/
#define	CAN1_MOFCR32	(CAN1_MO32_FCR)

/** \brief  1404, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO32_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029404u)

/** Alias (User Manual Name) for CAN1_MO32_FGPR.
* To use register names with standard convension, please use CAN1_MO32_FGPR.
*/
#define	CAN1_MOFGPR32	(CAN1_MO32_FGPR)

/** \brief  1408, Message Object  Interrupt Pointer Register */
#define CAN1_MO32_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029408u)

/** Alias (User Manual Name) for CAN1_MO32_IPR.
* To use register names with standard convension, please use CAN1_MO32_IPR.
*/
#define	CAN1_MOIPR32	(CAN1_MO32_IPR)

/** \brief  141C, Message Object  Control Register */
#define CAN1_MO32_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002941Cu)

/** Alias (User Manual Name) for CAN1_MO32_STAT.
* To use register names with standard convension, please use CAN1_MO32_STAT.
*/
#define	CAN1_MOSTAT32	(CAN1_MO32_STAT)

/** \brief  142C, Message Object  Acceptance Mask Register */
#define CAN1_MO33_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002942Cu)

/** Alias (User Manual Name) for CAN1_MO33_AMR.
* To use register names with standard convension, please use CAN1_MO33_AMR.
*/
#define	CAN1_MOAMR33	(CAN1_MO33_AMR)

/** \brief  1438, Message Object  Arbitration Register */
#define CAN1_MO33_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029438u)

/** Alias (User Manual Name) for CAN1_MO33_AR.
* To use register names with standard convension, please use CAN1_MO33_AR.
*/
#define	CAN1_MOAR33	(CAN1_MO33_AR)

/** \brief  143C, Message Object  Control Register */
#define CAN1_MO33_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002943Cu)

/** Alias (User Manual Name) for CAN1_MO33_CTR.
* To use register names with standard convension, please use CAN1_MO33_CTR.
*/
#define	CAN1_MOCTR33	(CAN1_MO33_CTR)

/** \brief  1434, Message Object  Data Register High */
#define CAN1_MO33_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029434u)

/** Alias (User Manual Name) for CAN1_MO33_DATAH.
* To use register names with standard convension, please use CAN1_MO33_DATAH.
*/
#define	CAN1_MODATAH33	(CAN1_MO33_DATAH)

/** \brief  1430, Message Object  Data Register Low */
#define CAN1_MO33_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029430u)

/** Alias (User Manual Name) for CAN1_MO33_DATAL.
* To use register names with standard convension, please use CAN1_MO33_DATAL.
*/
#define	CAN1_MODATAL33	(CAN1_MO33_DATAL)

/** \brief  1420, Message Object  Function Control Register */
#define CAN1_MO33_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029420u)

/** Alias (User Manual Name) for CAN1_MO33_EDATA0.
* To use register names with standard convension, please use CAN1_MO33_EDATA0.
*/
#define	CAN1_EMO33DATA0	(CAN1_MO33_EDATA0)

/** \brief  1424, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO33_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029424u)

/** Alias (User Manual Name) for CAN1_MO33_EDATA1.
* To use register names with standard convension, please use CAN1_MO33_EDATA1.
*/
#define	CAN1_EMO33DATA1	(CAN1_MO33_EDATA1)

/** \brief  1428, Message Object  Interrupt Pointer Register */
#define CAN1_MO33_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029428u)

