leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO33_EDATA2.
* To use register names with standard convension, please use CAN1_MO33_EDATA2.
*/
#define	CAN1_EMO33DATA2	(CAN1_MO33_EDATA2)

/** \brief  142C, Message Object  Acceptance Mask Register */
#define CAN1_MO33_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002942Cu)

/** Alias (User Manual Name) for CAN1_MO33_EDATA3.
* To use register names with standard convension, please use CAN1_MO33_EDATA3.
*/
#define	CAN1_EMO33DATA3	(CAN1_MO33_EDATA3)

/** \brief  1430, Message Object  Data Register Low */
#define CAN1_MO33_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029430u)

/** Alias (User Manual Name) for CAN1_MO33_EDATA4.
* To use register names with standard convension, please use CAN1_MO33_EDATA4.
*/
#define	CAN1_EMO33DATA4	(CAN1_MO33_EDATA4)

/** \brief  1434, Message Object  Data Register High */
#define CAN1_MO33_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029434u)

/** Alias (User Manual Name) for CAN1_MO33_EDATA5.
* To use register names with standard convension, please use CAN1_MO33_EDATA5.
*/
#define	CAN1_EMO33DATA5	(CAN1_MO33_EDATA5)

/** \brief  1438, Message Object  Arbitration Register */
#define CAN1_MO33_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029438u)

/** Alias (User Manual Name) for CAN1_MO33_EDATA6.
* To use register names with standard convension, please use CAN1_MO33_EDATA6.
*/
#define	CAN1_EMO33DATA6	(CAN1_MO33_EDATA6)

/** \brief  1420, Message Object  Function Control Register */
#define CAN1_MO33_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029420u)

/** Alias (User Manual Name) for CAN1_MO33_FCR.
* To use register names with standard convension, please use CAN1_MO33_FCR.
*/
#define	CAN1_MOFCR33	(CAN1_MO33_FCR)

/** \brief  1424, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO33_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029424u)

/** Alias (User Manual Name) for CAN1_MO33_FGPR.
* To use register names with standard convension, please use CAN1_MO33_FGPR.
*/
#define	CAN1_MOFGPR33	(CAN1_MO33_FGPR)

/** \brief  1428, Message Object  Interrupt Pointer Register */
#define CAN1_MO33_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029428u)

/** Alias (User Manual Name) for CAN1_MO33_IPR.
* To use register names with standard convension, please use CAN1_MO33_IPR.
*/
#define	CAN1_MOIPR33	(CAN1_MO33_IPR)

/** \brief  143C, Message Object  Control Register */
#define CAN1_MO33_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002943Cu)

/** Alias (User Manual Name) for CAN1_MO33_STAT.
* To use register names with standard convension, please use CAN1_MO33_STAT.
*/
#define	CAN1_MOSTAT33	(CAN1_MO33_STAT)

/** \brief  144C, Message Object  Acceptance Mask Register */
#define CAN1_MO34_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002944Cu)

/** Alias (User Manual Name) for CAN1_MO34_AMR.
* To use register names with standard convension, please use CAN1_MO34_AMR.
*/
#define	CAN1_MOAMR34	(CAN1_MO34_AMR)

/** \brief  1458, Message Object  Arbitration Register */
#define CAN1_MO34_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029458u)

/** Alias (User Manual Name) for CAN1_MO34_AR.
* To use register names with standard convension, please use CAN1_MO34_AR.
*/
#define	CAN1_MOAR34	(CAN1_MO34_AR)

/** \brief  145C, Message Object  Control Register */
#define CAN1_MO34_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002945Cu)

/** Alias (User Manual Name) for CAN1_MO34_CTR.
* To use register names with standard convension, please use CAN1_MO34_CTR.
*/
#define	CAN1_MOCTR34	(CAN1_MO34_CTR)

/** \brief  1454, Message Object  Data Register High */
#define CAN1_MO34_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029454u)

/** Alias (User Manual Name) for CAN1_MO34_DATAH.
* To use register names with standard convension, please use CAN1_MO34_DATAH.
*/
#define	CAN1_MODATAH34	(CAN1_MO34_DATAH)

/** \brief  1450, Message Object  Data Register Low */
#define CAN1_MO34_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029450u)

/** Alias (User Manual Name) for CAN1_MO34_DATAL.
* To use register names with standard convension, please use CAN1_MO34_DATAL.
*/
#define	CAN1_MODATAL34	(CAN1_MO34_DATAL)

/** \brief  1440, Message Object  Function Control Register */
#define CAN1_MO34_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029440u)

/** Alias (User Manual Name) for CAN1_MO34_EDATA0.
* To use register names with standard convension, please use CAN1_MO34_EDATA0.
*/
#define	CAN1_EMO34DATA0	(CAN1_MO34_EDATA0)

/** \brief  1444, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO34_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029444u)

/** Alias (User Manual Name) for CAN1_MO34_EDATA1.
* To use register names with standard convension, please use CAN1_MO34_EDATA1.
*/
#define	CAN1_EMO34DATA1	(CAN1_MO34_EDATA1)

/** \brief  1448, Message Object  Interrupt Pointer Register */
#define CAN1_MO34_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029448u)

/** Alias (User Manual Name) for CAN1_MO34_EDATA2.
* To use register names with standard convension, please use CAN1_MO34_EDATA2.
*/
#define	CAN1_EMO34DATA2	(CAN1_MO34_EDATA2)

/** \brief  144C, Message Object  Acceptance Mask Register */
#define CAN1_MO34_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002944Cu)

/** Alias (User Manual Name) for CAN1_MO34_EDATA3.
* To use register names with standard convension, please use CAN1_MO34_EDATA3.
*/
#define	CAN1_EMO34DATA3	(CAN1_MO34_EDATA3)

/** \brief  1450, Message Object  Data Register Low */
#define CAN1_MO34_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029450u)

/** Alias (User Manual Name) for CAN1_MO34_EDATA4.
* To use register names with standard convension, please use CAN1_MO34_EDATA4.
*/
#define	CAN1_EMO34DATA4	(CAN1_MO34_EDATA4)

/** \brief  1454, Message Object  Data Register High */
#define CAN1_MO34_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029454u)

/** Alias (User Manual Name) for CAN1_MO34_EDATA5.
* To use register names with standard convension, please use CAN1_MO34_EDATA5.
*/
#define	CAN1_EMO34DATA5	(CAN1_MO34_EDATA5)

/** \brief  1458, Message Object  Arbitration Register */
#define CAN1_MO34_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029458u)

/** Alias (User Manual Name) for CAN1_MO34_EDATA6.
* To use register names with standard convension, please use CAN1_MO34_EDATA6.
*/
#define	CAN1_EMO34DATA6	(CAN1_MO34_EDATA6)

/** \brief  1440, Message Object  Function Control Register */
#define CAN1_MO34_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029440u)

