leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO34_FCR.
* To use register names with standard convension, please use CAN1_MO34_FCR.
*/
#define	CAN1_MOFCR34	(CAN1_MO34_FCR)

/** \brief  1444, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO34_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029444u)

/** Alias (User Manual Name) for CAN1_MO34_FGPR.
* To use register names with standard convension, please use CAN1_MO34_FGPR.
*/
#define	CAN1_MOFGPR34	(CAN1_MO34_FGPR)

/** \brief  1448, Message Object  Interrupt Pointer Register */
#define CAN1_MO34_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029448u)

/** Alias (User Manual Name) for CAN1_MO34_IPR.
* To use register names with standard convension, please use CAN1_MO34_IPR.
*/
#define	CAN1_MOIPR34	(CAN1_MO34_IPR)

/** \brief  145C, Message Object  Control Register */
#define CAN1_MO34_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002945Cu)

/** Alias (User Manual Name) for CAN1_MO34_STAT.
* To use register names with standard convension, please use CAN1_MO34_STAT.
*/
#define	CAN1_MOSTAT34	(CAN1_MO34_STAT)

/** \brief  146C, Message Object  Acceptance Mask Register */
#define CAN1_MO35_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002946Cu)

/** Alias (User Manual Name) for CAN1_MO35_AMR.
* To use register names with standard convension, please use CAN1_MO35_AMR.
*/
#define	CAN1_MOAMR35	(CAN1_MO35_AMR)

/** \brief  1478, Message Object  Arbitration Register */
#define CAN1_MO35_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029478u)

/** Alias (User Manual Name) for CAN1_MO35_AR.
* To use register names with standard convension, please use CAN1_MO35_AR.
*/
#define	CAN1_MOAR35	(CAN1_MO35_AR)

/** \brief  147C, Message Object  Control Register */
#define CAN1_MO35_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002947Cu)

/** Alias (User Manual Name) for CAN1_MO35_CTR.
* To use register names with standard convension, please use CAN1_MO35_CTR.
*/
#define	CAN1_MOCTR35	(CAN1_MO35_CTR)

/** \brief  1474, Message Object  Data Register High */
#define CAN1_MO35_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029474u)

/** Alias (User Manual Name) for CAN1_MO35_DATAH.
* To use register names with standard convension, please use CAN1_MO35_DATAH.
*/
#define	CAN1_MODATAH35	(CAN1_MO35_DATAH)

/** \brief  1470, Message Object  Data Register Low */
#define CAN1_MO35_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029470u)

/** Alias (User Manual Name) for CAN1_MO35_DATAL.
* To use register names with standard convension, please use CAN1_MO35_DATAL.
*/
#define	CAN1_MODATAL35	(CAN1_MO35_DATAL)

/** \brief  1460, Message Object  Function Control Register */
#define CAN1_MO35_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029460u)

/** Alias (User Manual Name) for CAN1_MO35_EDATA0.
* To use register names with standard convension, please use CAN1_MO35_EDATA0.
*/
#define	CAN1_EMO35DATA0	(CAN1_MO35_EDATA0)

/** \brief  1464, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO35_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029464u)

/** Alias (User Manual Name) for CAN1_MO35_EDATA1.
* To use register names with standard convension, please use CAN1_MO35_EDATA1.
*/
#define	CAN1_EMO35DATA1	(CAN1_MO35_EDATA1)

/** \brief  1468, Message Object  Interrupt Pointer Register */
#define CAN1_MO35_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029468u)

/** Alias (User Manual Name) for CAN1_MO35_EDATA2.
* To use register names with standard convension, please use CAN1_MO35_EDATA2.
*/
#define	CAN1_EMO35DATA2	(CAN1_MO35_EDATA2)

/** \brief  146C, Message Object  Acceptance Mask Register */
#define CAN1_MO35_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002946Cu)

/** Alias (User Manual Name) for CAN1_MO35_EDATA3.
* To use register names with standard convension, please use CAN1_MO35_EDATA3.
*/
#define	CAN1_EMO35DATA3	(CAN1_MO35_EDATA3)

/** \brief  1470, Message Object  Data Register Low */
#define CAN1_MO35_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029470u)

/** Alias (User Manual Name) for CAN1_MO35_EDATA4.
* To use register names with standard convension, please use CAN1_MO35_EDATA4.
*/
#define	CAN1_EMO35DATA4	(CAN1_MO35_EDATA4)

/** \brief  1474, Message Object  Data Register High */
#define CAN1_MO35_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029474u)

/** Alias (User Manual Name) for CAN1_MO35_EDATA5.
* To use register names with standard convension, please use CAN1_MO35_EDATA5.
*/
#define	CAN1_EMO35DATA5	(CAN1_MO35_EDATA5)

/** \brief  1478, Message Object  Arbitration Register */
#define CAN1_MO35_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029478u)

/** Alias (User Manual Name) for CAN1_MO35_EDATA6.
* To use register names with standard convension, please use CAN1_MO35_EDATA6.
*/
#define	CAN1_EMO35DATA6	(CAN1_MO35_EDATA6)

/** \brief  1460, Message Object  Function Control Register */
#define CAN1_MO35_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029460u)

/** Alias (User Manual Name) for CAN1_MO35_FCR.
* To use register names with standard convension, please use CAN1_MO35_FCR.
*/
#define	CAN1_MOFCR35	(CAN1_MO35_FCR)

/** \brief  1464, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO35_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029464u)

/** Alias (User Manual Name) for CAN1_MO35_FGPR.
* To use register names with standard convension, please use CAN1_MO35_FGPR.
*/
#define	CAN1_MOFGPR35	(CAN1_MO35_FGPR)

/** \brief  1468, Message Object  Interrupt Pointer Register */
#define CAN1_MO35_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029468u)

/** Alias (User Manual Name) for CAN1_MO35_IPR.
* To use register names with standard convension, please use CAN1_MO35_IPR.
*/
#define	CAN1_MOIPR35	(CAN1_MO35_IPR)

/** \brief  147C, Message Object  Control Register */
#define CAN1_MO35_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002947Cu)

