leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO35_STAT.
* To use register names with standard convension, please use CAN1_MO35_STAT.
*/
#define	CAN1_MOSTAT35	(CAN1_MO35_STAT)

/** \brief  148C, Message Object  Acceptance Mask Register */
#define CAN1_MO36_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002948Cu)

/** Alias (User Manual Name) for CAN1_MO36_AMR.
* To use register names with standard convension, please use CAN1_MO36_AMR.
*/
#define	CAN1_MOAMR36	(CAN1_MO36_AMR)

/** \brief  1498, Message Object  Arbitration Register */
#define CAN1_MO36_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029498u)

/** Alias (User Manual Name) for CAN1_MO36_AR.
* To use register names with standard convension, please use CAN1_MO36_AR.
*/
#define	CAN1_MOAR36	(CAN1_MO36_AR)

/** \brief  149C, Message Object  Control Register */
#define CAN1_MO36_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002949Cu)

/** Alias (User Manual Name) for CAN1_MO36_CTR.
* To use register names with standard convension, please use CAN1_MO36_CTR.
*/
#define	CAN1_MOCTR36	(CAN1_MO36_CTR)

/** \brief  1494, Message Object  Data Register High */
#define CAN1_MO36_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029494u)

/** Alias (User Manual Name) for CAN1_MO36_DATAH.
* To use register names with standard convension, please use CAN1_MO36_DATAH.
*/
#define	CAN1_MODATAH36	(CAN1_MO36_DATAH)

/** \brief  1490, Message Object  Data Register Low */
#define CAN1_MO36_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029490u)

/** Alias (User Manual Name) for CAN1_MO36_DATAL.
* To use register names with standard convension, please use CAN1_MO36_DATAL.
*/
#define	CAN1_MODATAL36	(CAN1_MO36_DATAL)

/** \brief  1480, Message Object  Function Control Register */
#define CAN1_MO36_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029480u)

/** Alias (User Manual Name) for CAN1_MO36_EDATA0.
* To use register names with standard convension, please use CAN1_MO36_EDATA0.
*/
#define	CAN1_EMO36DATA0	(CAN1_MO36_EDATA0)

/** \brief  1484, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO36_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029484u)

/** Alias (User Manual Name) for CAN1_MO36_EDATA1.
* To use register names with standard convension, please use CAN1_MO36_EDATA1.
*/
#define	CAN1_EMO36DATA1	(CAN1_MO36_EDATA1)

/** \brief  1488, Message Object  Interrupt Pointer Register */
#define CAN1_MO36_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029488u)

/** Alias (User Manual Name) for CAN1_MO36_EDATA2.
* To use register names with standard convension, please use CAN1_MO36_EDATA2.
*/
#define	CAN1_EMO36DATA2	(CAN1_MO36_EDATA2)

/** \brief  148C, Message Object  Acceptance Mask Register */
#define CAN1_MO36_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002948Cu)

/** Alias (User Manual Name) for CAN1_MO36_EDATA3.
* To use register names with standard convension, please use CAN1_MO36_EDATA3.
*/
#define	CAN1_EMO36DATA3	(CAN1_MO36_EDATA3)

/** \brief  1490, Message Object  Data Register Low */
#define CAN1_MO36_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029490u)

/** Alias (User Manual Name) for CAN1_MO36_EDATA4.
* To use register names with standard convension, please use CAN1_MO36_EDATA4.
*/
#define	CAN1_EMO36DATA4	(CAN1_MO36_EDATA4)

/** \brief  1494, Message Object  Data Register High */
#define CAN1_MO36_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029494u)

/** Alias (User Manual Name) for CAN1_MO36_EDATA5.
* To use register names with standard convension, please use CAN1_MO36_EDATA5.
*/
#define	CAN1_EMO36DATA5	(CAN1_MO36_EDATA5)

/** \brief  1498, Message Object  Arbitration Register */
#define CAN1_MO36_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029498u)

/** Alias (User Manual Name) for CAN1_MO36_EDATA6.
* To use register names with standard convension, please use CAN1_MO36_EDATA6.
*/
#define	CAN1_EMO36DATA6	(CAN1_MO36_EDATA6)

/** \brief  1480, Message Object  Function Control Register */
#define CAN1_MO36_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029480u)

/** Alias (User Manual Name) for CAN1_MO36_FCR.
* To use register names with standard convension, please use CAN1_MO36_FCR.
*/
#define	CAN1_MOFCR36	(CAN1_MO36_FCR)

/** \brief  1484, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO36_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029484u)

/** Alias (User Manual Name) for CAN1_MO36_FGPR.
* To use register names with standard convension, please use CAN1_MO36_FGPR.
*/
#define	CAN1_MOFGPR36	(CAN1_MO36_FGPR)

/** \brief  1488, Message Object  Interrupt Pointer Register */
#define CAN1_MO36_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029488u)

/** Alias (User Manual Name) for CAN1_MO36_IPR.
* To use register names with standard convension, please use CAN1_MO36_IPR.
*/
#define	CAN1_MOIPR36	(CAN1_MO36_IPR)

/** \brief  149C, Message Object  Control Register */
#define CAN1_MO36_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002949Cu)

/** Alias (User Manual Name) for CAN1_MO36_STAT.
* To use register names with standard convension, please use CAN1_MO36_STAT.
*/
#define	CAN1_MOSTAT36	(CAN1_MO36_STAT)

/** \brief  14AC, Message Object  Acceptance Mask Register */
#define CAN1_MO37_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294ACu)

/** Alias (User Manual Name) for CAN1_MO37_AMR.
* To use register names with standard convension, please use CAN1_MO37_AMR.
*/
#define	CAN1_MOAMR37	(CAN1_MO37_AMR)

/** \brief  14B8, Message Object  Arbitration Register */
#define CAN1_MO37_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294B8u)

/** Alias (User Manual Name) for CAN1_MO37_AR.
* To use register names with standard convension, please use CAN1_MO37_AR.
*/
#define	CAN1_MOAR37	(CAN1_MO37_AR)

/** \brief  14BC, Message Object  Control Register */
#define CAN1_MO37_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00294BCu)

/** Alias (User Manual Name) for CAN1_MO37_CTR.
* To use register names with standard convension, please use CAN1_MO37_CTR.
*/
#define	CAN1_MOCTR37	(CAN1_MO37_CTR)

/** \brief  14B4, Message Object  Data Register High */
#define CAN1_MO37_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294B4u)

