leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO37_DATAH.
* To use register names with standard convension, please use CAN1_MO37_DATAH.
*/
#define	CAN1_MODATAH37	(CAN1_MO37_DATAH)

/** \brief  14B0, Message Object  Data Register Low */
#define CAN1_MO37_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294B0u)

/** Alias (User Manual Name) for CAN1_MO37_DATAL.
* To use register names with standard convension, please use CAN1_MO37_DATAL.
*/
#define	CAN1_MODATAL37	(CAN1_MO37_DATAL)

/** \brief  14A0, Message Object  Function Control Register */
#define CAN1_MO37_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00294A0u)

/** Alias (User Manual Name) for CAN1_MO37_EDATA0.
* To use register names with standard convension, please use CAN1_MO37_EDATA0.
*/
#define	CAN1_EMO37DATA0	(CAN1_MO37_EDATA0)

/** \brief  14A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO37_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00294A4u)

/** Alias (User Manual Name) for CAN1_MO37_EDATA1.
* To use register names with standard convension, please use CAN1_MO37_EDATA1.
*/
#define	CAN1_EMO37DATA1	(CAN1_MO37_EDATA1)

/** \brief  14A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO37_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00294A8u)

/** Alias (User Manual Name) for CAN1_MO37_EDATA2.
* To use register names with standard convension, please use CAN1_MO37_EDATA2.
*/
#define	CAN1_EMO37DATA2	(CAN1_MO37_EDATA2)

/** \brief  14AC, Message Object  Acceptance Mask Register */
#define CAN1_MO37_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00294ACu)

/** Alias (User Manual Name) for CAN1_MO37_EDATA3.
* To use register names with standard convension, please use CAN1_MO37_EDATA3.
*/
#define	CAN1_EMO37DATA3	(CAN1_MO37_EDATA3)

/** \brief  14B0, Message Object  Data Register Low */
#define CAN1_MO37_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00294B0u)

/** Alias (User Manual Name) for CAN1_MO37_EDATA4.
* To use register names with standard convension, please use CAN1_MO37_EDATA4.
*/
#define	CAN1_EMO37DATA4	(CAN1_MO37_EDATA4)

/** \brief  14B4, Message Object  Data Register High */
#define CAN1_MO37_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00294B4u)

/** Alias (User Manual Name) for CAN1_MO37_EDATA5.
* To use register names with standard convension, please use CAN1_MO37_EDATA5.
*/
#define	CAN1_EMO37DATA5	(CAN1_MO37_EDATA5)

/** \brief  14B8, Message Object  Arbitration Register */
#define CAN1_MO37_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00294B8u)

/** Alias (User Manual Name) for CAN1_MO37_EDATA6.
* To use register names with standard convension, please use CAN1_MO37_EDATA6.
*/
#define	CAN1_EMO37DATA6	(CAN1_MO37_EDATA6)

/** \brief  14A0, Message Object  Function Control Register */
#define CAN1_MO37_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294A0u)

/** Alias (User Manual Name) for CAN1_MO37_FCR.
* To use register names with standard convension, please use CAN1_MO37_FCR.
*/
#define	CAN1_MOFCR37	(CAN1_MO37_FCR)

/** \brief  14A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO37_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294A4u)

/** Alias (User Manual Name) for CAN1_MO37_FGPR.
* To use register names with standard convension, please use CAN1_MO37_FGPR.
*/
#define	CAN1_MOFGPR37	(CAN1_MO37_FGPR)

/** \brief  14A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO37_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294A8u)

/** Alias (User Manual Name) for CAN1_MO37_IPR.
* To use register names with standard convension, please use CAN1_MO37_IPR.
*/
#define	CAN1_MOIPR37	(CAN1_MO37_IPR)

/** \brief  14BC, Message Object  Control Register */
#define CAN1_MO37_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00294BCu)

/** Alias (User Manual Name) for CAN1_MO37_STAT.
* To use register names with standard convension, please use CAN1_MO37_STAT.
*/
#define	CAN1_MOSTAT37	(CAN1_MO37_STAT)

/** \brief  14CC, Message Object  Acceptance Mask Register */
#define CAN1_MO38_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294CCu)

/** Alias (User Manual Name) for CAN1_MO38_AMR.
* To use register names with standard convension, please use CAN1_MO38_AMR.
*/
#define	CAN1_MOAMR38	(CAN1_MO38_AMR)

/** \brief  14D8, Message Object  Arbitration Register */
#define CAN1_MO38_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294D8u)

/** Alias (User Manual Name) for CAN1_MO38_AR.
* To use register names with standard convension, please use CAN1_MO38_AR.
*/
#define	CAN1_MOAR38	(CAN1_MO38_AR)

/** \brief  14DC, Message Object  Control Register */
#define CAN1_MO38_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00294DCu)

/** Alias (User Manual Name) for CAN1_MO38_CTR.
* To use register names with standard convension, please use CAN1_MO38_CTR.
*/
#define	CAN1_MOCTR38	(CAN1_MO38_CTR)

/** \brief  14D4, Message Object  Data Register High */
#define CAN1_MO38_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294D4u)

/** Alias (User Manual Name) for CAN1_MO38_DATAH.
* To use register names with standard convension, please use CAN1_MO38_DATAH.
*/
#define	CAN1_MODATAH38	(CAN1_MO38_DATAH)

/** \brief  14D0, Message Object  Data Register Low */
#define CAN1_MO38_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294D0u)

/** Alias (User Manual Name) for CAN1_MO38_DATAL.
* To use register names with standard convension, please use CAN1_MO38_DATAL.
*/
#define	CAN1_MODATAL38	(CAN1_MO38_DATAL)

/** \brief  14C0, Message Object  Function Control Register */
#define CAN1_MO38_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00294C0u)

/** Alias (User Manual Name) for CAN1_MO38_EDATA0.
* To use register names with standard convension, please use CAN1_MO38_EDATA0.
*/
#define	CAN1_EMO38DATA0	(CAN1_MO38_EDATA0)

/** \brief  14C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO38_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00294C4u)

/** Alias (User Manual Name) for CAN1_MO38_EDATA1.
* To use register names with standard convension, please use CAN1_MO38_EDATA1.
*/
#define	CAN1_EMO38DATA1	(CAN1_MO38_EDATA1)

/** \brief  14C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO38_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00294C8u)

/** Alias (User Manual Name) for CAN1_MO38_EDATA2.
* To use register names with standard convension, please use CAN1_MO38_EDATA2.
*/
#define	CAN1_EMO38DATA2	(CAN1_MO38_EDATA2)

