leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  14CC, Message Object  Acceptance Mask Register */
#define CAN1_MO38_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00294CCu)

/** Alias (User Manual Name) for CAN1_MO38_EDATA3.
* To use register names with standard convension, please use CAN1_MO38_EDATA3.
*/
#define	CAN1_EMO38DATA3	(CAN1_MO38_EDATA3)

/** \brief  14D0, Message Object  Data Register Low */
#define CAN1_MO38_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00294D0u)

/** Alias (User Manual Name) for CAN1_MO38_EDATA4.
* To use register names with standard convension, please use CAN1_MO38_EDATA4.
*/
#define	CAN1_EMO38DATA4	(CAN1_MO38_EDATA4)

/** \brief  14D4, Message Object  Data Register High */
#define CAN1_MO38_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00294D4u)

/** Alias (User Manual Name) for CAN1_MO38_EDATA5.
* To use register names with standard convension, please use CAN1_MO38_EDATA5.
*/
#define	CAN1_EMO38DATA5	(CAN1_MO38_EDATA5)

/** \brief  14D8, Message Object  Arbitration Register */
#define CAN1_MO38_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00294D8u)

/** Alias (User Manual Name) for CAN1_MO38_EDATA6.
* To use register names with standard convension, please use CAN1_MO38_EDATA6.
*/
#define	CAN1_EMO38DATA6	(CAN1_MO38_EDATA6)

/** \brief  14C0, Message Object  Function Control Register */
#define CAN1_MO38_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294C0u)

/** Alias (User Manual Name) for CAN1_MO38_FCR.
* To use register names with standard convension, please use CAN1_MO38_FCR.
*/
#define	CAN1_MOFCR38	(CAN1_MO38_FCR)

/** \brief  14C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO38_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294C4u)

/** Alias (User Manual Name) for CAN1_MO38_FGPR.
* To use register names with standard convension, please use CAN1_MO38_FGPR.
*/
#define	CAN1_MOFGPR38	(CAN1_MO38_FGPR)

/** \brief  14C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO38_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294C8u)

/** Alias (User Manual Name) for CAN1_MO38_IPR.
* To use register names with standard convension, please use CAN1_MO38_IPR.
*/
#define	CAN1_MOIPR38	(CAN1_MO38_IPR)

/** \brief  14DC, Message Object  Control Register */
#define CAN1_MO38_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00294DCu)

/** Alias (User Manual Name) for CAN1_MO38_STAT.
* To use register names with standard convension, please use CAN1_MO38_STAT.
*/
#define	CAN1_MOSTAT38	(CAN1_MO38_STAT)

/** \brief  14EC, Message Object  Acceptance Mask Register */
#define CAN1_MO39_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294ECu)

/** Alias (User Manual Name) for CAN1_MO39_AMR.
* To use register names with standard convension, please use CAN1_MO39_AMR.
*/
#define	CAN1_MOAMR39	(CAN1_MO39_AMR)

/** \brief  14F8, Message Object  Arbitration Register */
#define CAN1_MO39_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294F8u)

/** Alias (User Manual Name) for CAN1_MO39_AR.
* To use register names with standard convension, please use CAN1_MO39_AR.
*/
#define	CAN1_MOAR39	(CAN1_MO39_AR)

/** \brief  14FC, Message Object  Control Register */
#define CAN1_MO39_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00294FCu)

/** Alias (User Manual Name) for CAN1_MO39_CTR.
* To use register names with standard convension, please use CAN1_MO39_CTR.
*/
#define	CAN1_MOCTR39	(CAN1_MO39_CTR)

/** \brief  14F4, Message Object  Data Register High */
#define CAN1_MO39_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294F4u)

/** Alias (User Manual Name) for CAN1_MO39_DATAH.
* To use register names with standard convension, please use CAN1_MO39_DATAH.
*/
#define	CAN1_MODATAH39	(CAN1_MO39_DATAH)

/** \brief  14F0, Message Object  Data Register Low */
#define CAN1_MO39_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294F0u)

/** Alias (User Manual Name) for CAN1_MO39_DATAL.
* To use register names with standard convension, please use CAN1_MO39_DATAL.
*/
#define	CAN1_MODATAL39	(CAN1_MO39_DATAL)

/** \brief  14E0, Message Object  Function Control Register */
#define CAN1_MO39_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00294E0u)

/** Alias (User Manual Name) for CAN1_MO39_EDATA0.
* To use register names with standard convension, please use CAN1_MO39_EDATA0.
*/
#define	CAN1_EMO39DATA0	(CAN1_MO39_EDATA0)

/** \brief  14E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO39_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00294E4u)

/** Alias (User Manual Name) for CAN1_MO39_EDATA1.
* To use register names with standard convension, please use CAN1_MO39_EDATA1.
*/
#define	CAN1_EMO39DATA1	(CAN1_MO39_EDATA1)

/** \brief  14E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO39_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00294E8u)

/** Alias (User Manual Name) for CAN1_MO39_EDATA2.
* To use register names with standard convension, please use CAN1_MO39_EDATA2.
*/
#define	CAN1_EMO39DATA2	(CAN1_MO39_EDATA2)

/** \brief  14EC, Message Object  Acceptance Mask Register */
#define CAN1_MO39_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00294ECu)

/** Alias (User Manual Name) for CAN1_MO39_EDATA3.
* To use register names with standard convension, please use CAN1_MO39_EDATA3.
*/
#define	CAN1_EMO39DATA3	(CAN1_MO39_EDATA3)

/** \brief  14F0, Message Object  Data Register Low */
#define CAN1_MO39_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00294F0u)

/** Alias (User Manual Name) for CAN1_MO39_EDATA4.
* To use register names with standard convension, please use CAN1_MO39_EDATA4.
*/
#define	CAN1_EMO39DATA4	(CAN1_MO39_EDATA4)

/** \brief  14F4, Message Object  Data Register High */
#define CAN1_MO39_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00294F4u)

/** Alias (User Manual Name) for CAN1_MO39_EDATA5.
* To use register names with standard convension, please use CAN1_MO39_EDATA5.
*/
#define	CAN1_EMO39DATA5	(CAN1_MO39_EDATA5)

/** \brief  14F8, Message Object  Arbitration Register */
#define CAN1_MO39_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00294F8u)

/** Alias (User Manual Name) for CAN1_MO39_EDATA6.
* To use register names with standard convension, please use CAN1_MO39_EDATA6.
*/
#define	CAN1_EMO39DATA6	(CAN1_MO39_EDATA6)

