leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  14E0, Message Object  Function Control Register */
#define CAN1_MO39_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294E0u)

/** Alias (User Manual Name) for CAN1_MO39_FCR.
* To use register names with standard convension, please use CAN1_MO39_FCR.
*/
#define	CAN1_MOFCR39	(CAN1_MO39_FCR)

/** \brief  14E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO39_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294E4u)

/** Alias (User Manual Name) for CAN1_MO39_FGPR.
* To use register names with standard convension, please use CAN1_MO39_FGPR.
*/
#define	CAN1_MOFGPR39	(CAN1_MO39_FGPR)

/** \brief  14E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO39_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294E8u)

/** Alias (User Manual Name) for CAN1_MO39_IPR.
* To use register names with standard convension, please use CAN1_MO39_IPR.
*/
#define	CAN1_MOIPR39	(CAN1_MO39_IPR)

/** \brief  14FC, Message Object  Control Register */
#define CAN1_MO39_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00294FCu)

/** Alias (User Manual Name) for CAN1_MO39_STAT.
* To use register names with standard convension, please use CAN1_MO39_STAT.
*/
#define	CAN1_MOSTAT39	(CAN1_MO39_STAT)

/** \brief  106C, Message Object  Acceptance Mask Register */
#define CAN1_MO3_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002906Cu)

/** Alias (User Manual Name) for CAN1_MO3_AMR.
* To use register names with standard convension, please use CAN1_MO3_AMR.
*/
#define	CAN1_MOAMR3	(CAN1_MO3_AMR)

/** \brief  1078, Message Object  Arbitration Register */
#define CAN1_MO3_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029078u)

/** Alias (User Manual Name) for CAN1_MO3_AR.
* To use register names with standard convension, please use CAN1_MO3_AR.
*/
#define	CAN1_MOAR3	(CAN1_MO3_AR)

/** \brief  107C, Message Object  Control Register */
#define CAN1_MO3_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002907Cu)

/** Alias (User Manual Name) for CAN1_MO3_CTR.
* To use register names with standard convension, please use CAN1_MO3_CTR.
*/
#define	CAN1_MOCTR3	(CAN1_MO3_CTR)

/** \brief  1074, Message Object  Data Register High */
#define CAN1_MO3_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029074u)

/** Alias (User Manual Name) for CAN1_MO3_DATAH.
* To use register names with standard convension, please use CAN1_MO3_DATAH.
*/
#define	CAN1_MODATAH3	(CAN1_MO3_DATAH)

/** \brief  1070, Message Object  Data Register Low */
#define CAN1_MO3_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029070u)

/** Alias (User Manual Name) for CAN1_MO3_DATAL.
* To use register names with standard convension, please use CAN1_MO3_DATAL.
*/
#define	CAN1_MODATAL3	(CAN1_MO3_DATAL)

/** \brief  1060, Message Object  Function Control Register */
#define CAN1_MO3_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029060u)

/** Alias (User Manual Name) for CAN1_MO3_EDATA0.
* To use register names with standard convension, please use CAN1_MO3_EDATA0.
*/
#define	CAN1_EMO3DATA0	(CAN1_MO3_EDATA0)

/** \brief  1064, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO3_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029064u)

/** Alias (User Manual Name) for CAN1_MO3_EDATA1.
* To use register names with standard convension, please use CAN1_MO3_EDATA1.
*/
#define	CAN1_EMO3DATA1	(CAN1_MO3_EDATA1)

/** \brief  1068, Message Object  Interrupt Pointer Register */
#define CAN1_MO3_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029068u)

/** Alias (User Manual Name) for CAN1_MO3_EDATA2.
* To use register names with standard convension, please use CAN1_MO3_EDATA2.
*/
#define	CAN1_EMO3DATA2	(CAN1_MO3_EDATA2)

/** \brief  106C, Message Object  Acceptance Mask Register */
#define CAN1_MO3_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002906Cu)

/** Alias (User Manual Name) for CAN1_MO3_EDATA3.
* To use register names with standard convension, please use CAN1_MO3_EDATA3.
*/
#define	CAN1_EMO3DATA3	(CAN1_MO3_EDATA3)

/** \brief  1070, Message Object  Data Register Low */
#define CAN1_MO3_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029070u)

/** Alias (User Manual Name) for CAN1_MO3_EDATA4.
* To use register names with standard convension, please use CAN1_MO3_EDATA4.
*/
#define	CAN1_EMO3DATA4	(CAN1_MO3_EDATA4)

/** \brief  1074, Message Object  Data Register High */
#define CAN1_MO3_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029074u)

/** Alias (User Manual Name) for CAN1_MO3_EDATA5.
* To use register names with standard convension, please use CAN1_MO3_EDATA5.
*/
#define	CAN1_EMO3DATA5	(CAN1_MO3_EDATA5)

/** \brief  1078, Message Object  Arbitration Register */
#define CAN1_MO3_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029078u)

/** Alias (User Manual Name) for CAN1_MO3_EDATA6.
* To use register names with standard convension, please use CAN1_MO3_EDATA6.
*/
#define	CAN1_EMO3DATA6	(CAN1_MO3_EDATA6)

/** \brief  1060, Message Object  Function Control Register */
#define CAN1_MO3_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029060u)

/** Alias (User Manual Name) for CAN1_MO3_FCR.
* To use register names with standard convension, please use CAN1_MO3_FCR.
*/
#define	CAN1_MOFCR3	(CAN1_MO3_FCR)

/** \brief  1064, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO3_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029064u)

/** Alias (User Manual Name) for CAN1_MO3_FGPR.
* To use register names with standard convension, please use CAN1_MO3_FGPR.
*/
#define	CAN1_MOFGPR3	(CAN1_MO3_FGPR)

/** \brief  1068, Message Object  Interrupt Pointer Register */
#define CAN1_MO3_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029068u)

/** Alias (User Manual Name) for CAN1_MO3_IPR.
* To use register names with standard convension, please use CAN1_MO3_IPR.
*/
#define	CAN1_MOIPR3	(CAN1_MO3_IPR)

/** \brief  107C, Message Object  Control Register */
#define CAN1_MO3_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002907Cu)

