leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO3_STAT.
* To use register names with standard convension, please use CAN1_MO3_STAT.
*/
#define	CAN1_MOSTAT3	(CAN1_MO3_STAT)

/** \brief  150C, Message Object  Acceptance Mask Register */
#define CAN1_MO40_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002950Cu)

/** Alias (User Manual Name) for CAN1_MO40_AMR.
* To use register names with standard convension, please use CAN1_MO40_AMR.
*/
#define	CAN1_MOAMR40	(CAN1_MO40_AMR)

/** \brief  1518, Message Object  Arbitration Register */
#define CAN1_MO40_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029518u)

/** Alias (User Manual Name) for CAN1_MO40_AR.
* To use register names with standard convension, please use CAN1_MO40_AR.
*/
#define	CAN1_MOAR40	(CAN1_MO40_AR)

/** \brief  151C, Message Object  Control Register */
#define CAN1_MO40_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002951Cu)

/** Alias (User Manual Name) for CAN1_MO40_CTR.
* To use register names with standard convension, please use CAN1_MO40_CTR.
*/
#define	CAN1_MOCTR40	(CAN1_MO40_CTR)

/** \brief  1514, Message Object  Data Register High */
#define CAN1_MO40_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029514u)

/** Alias (User Manual Name) for CAN1_MO40_DATAH.
* To use register names with standard convension, please use CAN1_MO40_DATAH.
*/
#define	CAN1_MODATAH40	(CAN1_MO40_DATAH)

/** \brief  1510, Message Object  Data Register Low */
#define CAN1_MO40_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029510u)

/** Alias (User Manual Name) for CAN1_MO40_DATAL.
* To use register names with standard convension, please use CAN1_MO40_DATAL.
*/
#define	CAN1_MODATAL40	(CAN1_MO40_DATAL)

/** \brief  1500, Message Object  Function Control Register */
#define CAN1_MO40_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029500u)

/** Alias (User Manual Name) for CAN1_MO40_EDATA0.
* To use register names with standard convension, please use CAN1_MO40_EDATA0.
*/
#define	CAN1_EMO40DATA0	(CAN1_MO40_EDATA0)

/** \brief  1504, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO40_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029504u)

/** Alias (User Manual Name) for CAN1_MO40_EDATA1.
* To use register names with standard convension, please use CAN1_MO40_EDATA1.
*/
#define	CAN1_EMO40DATA1	(CAN1_MO40_EDATA1)

/** \brief  1508, Message Object  Interrupt Pointer Register */
#define CAN1_MO40_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029508u)

/** Alias (User Manual Name) for CAN1_MO40_EDATA2.
* To use register names with standard convension, please use CAN1_MO40_EDATA2.
*/
#define	CAN1_EMO40DATA2	(CAN1_MO40_EDATA2)

/** \brief  150C, Message Object  Acceptance Mask Register */
#define CAN1_MO40_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002950Cu)

/** Alias (User Manual Name) for CAN1_MO40_EDATA3.
* To use register names with standard convension, please use CAN1_MO40_EDATA3.
*/
#define	CAN1_EMO40DATA3	(CAN1_MO40_EDATA3)

/** \brief  1510, Message Object  Data Register Low */
#define CAN1_MO40_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029510u)

/** Alias (User Manual Name) for CAN1_MO40_EDATA4.
* To use register names with standard convension, please use CAN1_MO40_EDATA4.
*/
#define	CAN1_EMO40DATA4	(CAN1_MO40_EDATA4)

/** \brief  1514, Message Object  Data Register High */
#define CAN1_MO40_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029514u)

/** Alias (User Manual Name) for CAN1_MO40_EDATA5.
* To use register names with standard convension, please use CAN1_MO40_EDATA5.
*/
#define	CAN1_EMO40DATA5	(CAN1_MO40_EDATA5)

/** \brief  1518, Message Object  Arbitration Register */
#define CAN1_MO40_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029518u)

/** Alias (User Manual Name) for CAN1_MO40_EDATA6.
* To use register names with standard convension, please use CAN1_MO40_EDATA6.
*/
#define	CAN1_EMO40DATA6	(CAN1_MO40_EDATA6)

/** \brief  1500, Message Object  Function Control Register */
#define CAN1_MO40_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029500u)

/** Alias (User Manual Name) for CAN1_MO40_FCR.
* To use register names with standard convension, please use CAN1_MO40_FCR.
*/
#define	CAN1_MOFCR40	(CAN1_MO40_FCR)

/** \brief  1504, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO40_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029504u)

/** Alias (User Manual Name) for CAN1_MO40_FGPR.
* To use register names with standard convension, please use CAN1_MO40_FGPR.
*/
#define	CAN1_MOFGPR40	(CAN1_MO40_FGPR)

/** \brief  1508, Message Object  Interrupt Pointer Register */
#define CAN1_MO40_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029508u)

/** Alias (User Manual Name) for CAN1_MO40_IPR.
* To use register names with standard convension, please use CAN1_MO40_IPR.
*/
#define	CAN1_MOIPR40	(CAN1_MO40_IPR)

/** \brief  151C, Message Object  Control Register */
#define CAN1_MO40_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002951Cu)

/** Alias (User Manual Name) for CAN1_MO40_STAT.
* To use register names with standard convension, please use CAN1_MO40_STAT.
*/
#define	CAN1_MOSTAT40	(CAN1_MO40_STAT)

/** \brief  152C, Message Object  Acceptance Mask Register */
#define CAN1_MO41_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002952Cu)

/** Alias (User Manual Name) for CAN1_MO41_AMR.
* To use register names with standard convension, please use CAN1_MO41_AMR.
*/
#define	CAN1_MOAMR41	(CAN1_MO41_AMR)

/** \brief  1538, Message Object  Arbitration Register */
#define CAN1_MO41_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029538u)

/** Alias (User Manual Name) for CAN1_MO41_AR.
* To use register names with standard convension, please use CAN1_MO41_AR.
*/
#define	CAN1_MOAR41	(CAN1_MO41_AR)

/** \brief  153C, Message Object  Control Register */
#define CAN1_MO41_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002953Cu)

/** Alias (User Manual Name) for CAN1_MO41_CTR.
* To use register names with standard convension, please use CAN1_MO41_CTR.
*/
#define	CAN1_MOCTR41	(CAN1_MO41_CTR)

/** \brief  1534, Message Object  Data Register High */
#define CAN1_MO41_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029534u)

/** Alias (User Manual Name) for CAN1_MO41_DATAH.
* To use register names with standard convension, please use CAN1_MO41_DATAH.
*/
#define	CAN1_MODATAH41	(CAN1_MO41_DATAH)

/** \brief  1530, Message Object  Data Register Low */
#define CAN1_MO41_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029530u)

/** Alias (User Manual Name) for CAN1_MO41_DATAL.
* To use register names with standard convension, please use CAN1_MO41_DATAL.
*/
#define	CAN1_MODATAL41	(CAN1_MO41_DATAL)

