leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO42_EDATA4.
* To use register names with standard convension, please use CAN1_MO42_EDATA4.
*/
#define	CAN1_EMO42DATA4	(CAN1_MO42_EDATA4)

/** \brief  1554, Message Object  Data Register High */
#define CAN1_MO42_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029554u)

/** Alias (User Manual Name) for CAN1_MO42_EDATA5.
* To use register names with standard convension, please use CAN1_MO42_EDATA5.
*/
#define	CAN1_EMO42DATA5	(CAN1_MO42_EDATA5)

/** \brief  1558, Message Object  Arbitration Register */
#define CAN1_MO42_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029558u)

/** Alias (User Manual Name) for CAN1_MO42_EDATA6.
* To use register names with standard convension, please use CAN1_MO42_EDATA6.
*/
#define	CAN1_EMO42DATA6	(CAN1_MO42_EDATA6)

/** \brief  1540, Message Object  Function Control Register */
#define CAN1_MO42_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029540u)

/** Alias (User Manual Name) for CAN1_MO42_FCR.
* To use register names with standard convension, please use CAN1_MO42_FCR.
*/
#define	CAN1_MOFCR42	(CAN1_MO42_FCR)

/** \brief  1544, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO42_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029544u)

/** Alias (User Manual Name) for CAN1_MO42_FGPR.
* To use register names with standard convension, please use CAN1_MO42_FGPR.
*/
#define	CAN1_MOFGPR42	(CAN1_MO42_FGPR)

/** \brief  1548, Message Object  Interrupt Pointer Register */
#define CAN1_MO42_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029548u)

/** Alias (User Manual Name) for CAN1_MO42_IPR.
* To use register names with standard convension, please use CAN1_MO42_IPR.
*/
#define	CAN1_MOIPR42	(CAN1_MO42_IPR)

/** \brief  155C, Message Object  Control Register */
#define CAN1_MO42_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002955Cu)

/** Alias (User Manual Name) for CAN1_MO42_STAT.
* To use register names with standard convension, please use CAN1_MO42_STAT.
*/
#define	CAN1_MOSTAT42	(CAN1_MO42_STAT)

/** \brief  156C, Message Object  Acceptance Mask Register */
#define CAN1_MO43_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002956Cu)

/** Alias (User Manual Name) for CAN1_MO43_AMR.
* To use register names with standard convension, please use CAN1_MO43_AMR.
*/
#define	CAN1_MOAMR43	(CAN1_MO43_AMR)

/** \brief  1578, Message Object  Arbitration Register */
#define CAN1_MO43_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029578u)

/** Alias (User Manual Name) for CAN1_MO43_AR.
* To use register names with standard convension, please use CAN1_MO43_AR.
*/
#define	CAN1_MOAR43	(CAN1_MO43_AR)

/** \brief  157C, Message Object  Control Register */
#define CAN1_MO43_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002957Cu)

/** Alias (User Manual Name) for CAN1_MO43_CTR.
* To use register names with standard convension, please use CAN1_MO43_CTR.
*/
#define	CAN1_MOCTR43	(CAN1_MO43_CTR)

/** \brief  1574, Message Object  Data Register High */
#define CAN1_MO43_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029574u)

/** Alias (User Manual Name) for CAN1_MO43_DATAH.
* To use register names with standard convension, please use CAN1_MO43_DATAH.
*/
#define	CAN1_MODATAH43	(CAN1_MO43_DATAH)

/** \brief  1570, Message Object  Data Register Low */
#define CAN1_MO43_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029570u)

/** Alias (User Manual Name) for CAN1_MO43_DATAL.
* To use register names with standard convension, please use CAN1_MO43_DATAL.
*/
#define	CAN1_MODATAL43	(CAN1_MO43_DATAL)

/** \brief  1560, Message Object  Function Control Register */
#define CAN1_MO43_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029560u)

/** Alias (User Manual Name) for CAN1_MO43_EDATA0.
* To use register names with standard convension, please use CAN1_MO43_EDATA0.
*/
#define	CAN1_EMO43DATA0	(CAN1_MO43_EDATA0)

/** \brief  1564, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO43_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029564u)

/** Alias (User Manual Name) for CAN1_MO43_EDATA1.
* To use register names with standard convension, please use CAN1_MO43_EDATA1.
*/
#define	CAN1_EMO43DATA1	(CAN1_MO43_EDATA1)

/** \brief  1568, Message Object  Interrupt Pointer Register */
#define CAN1_MO43_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029568u)

/** Alias (User Manual Name) for CAN1_MO43_EDATA2.
* To use register names with standard convension, please use CAN1_MO43_EDATA2.
*/
#define	CAN1_EMO43DATA2	(CAN1_MO43_EDATA2)

/** \brief  156C, Message Object  Acceptance Mask Register */
#define CAN1_MO43_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002956Cu)

/** Alias (User Manual Name) for CAN1_MO43_EDATA3.
* To use register names with standard convension, please use CAN1_MO43_EDATA3.
*/
#define	CAN1_EMO43DATA3	(CAN1_MO43_EDATA3)

/** \brief  1570, Message Object  Data Register Low */
#define CAN1_MO43_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029570u)

/** Alias (User Manual Name) for CAN1_MO43_EDATA4.
* To use register names with standard convension, please use CAN1_MO43_EDATA4.
*/
#define	CAN1_EMO43DATA4	(CAN1_MO43_EDATA4)

/** \brief  1574, Message Object  Data Register High */
#define CAN1_MO43_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029574u)

/** Alias (User Manual Name) for CAN1_MO43_EDATA5.
* To use register names with standard convension, please use CAN1_MO43_EDATA5.
*/
#define	CAN1_EMO43DATA5	(CAN1_MO43_EDATA5)

/** \brief  1578, Message Object  Arbitration Register */
#define CAN1_MO43_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029578u)

/** Alias (User Manual Name) for CAN1_MO43_EDATA6.
* To use register names with standard convension, please use CAN1_MO43_EDATA6.
*/
#define	CAN1_EMO43DATA6	(CAN1_MO43_EDATA6)

/** \brief  1560, Message Object  Function Control Register */
#define CAN1_MO43_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029560u)

/** Alias (User Manual Name) for CAN1_MO43_FCR.
* To use register names with standard convension, please use CAN1_MO43_FCR.
*/
#define	CAN1_MOFCR43	(CAN1_MO43_FCR)

/** \brief  1564, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO43_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029564u)

/** Alias (User Manual Name) for CAN1_MO43_FGPR.
* To use register names with standard convension, please use CAN1_MO43_FGPR.
*/
#define	CAN1_MOFGPR43	(CAN1_MO43_FGPR)

/** \brief  1568, Message Object  Interrupt Pointer Register */
#define CAN1_MO43_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029568u)

/** Alias (User Manual Name) for CAN1_MO43_IPR.
* To use register names with standard convension, please use CAN1_MO43_IPR.
*/
#define	CAN1_MOIPR43	(CAN1_MO43_IPR)

/** \brief  157C, Message Object  Control Register */
#define CAN1_MO43_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002957Cu)

/** Alias (User Manual Name) for CAN1_MO43_STAT.
* To use register names with standard convension, please use CAN1_MO43_STAT.
*/
#define	CAN1_MOSTAT43	(CAN1_MO43_STAT)

/** \brief  158C, Message Object  Acceptance Mask Register */
#define CAN1_MO44_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002958Cu)

/** Alias (User Manual Name) for CAN1_MO44_AMR.
* To use register names with standard convension, please use CAN1_MO44_AMR.
*/
#define	CAN1_MOAMR44	(CAN1_MO44_AMR)

/** \brief  1598, Message Object  Arbitration Register */
#define CAN1_MO44_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029598u)

/** Alias (User Manual Name) for CAN1_MO44_AR.
* To use register names with standard convension, please use CAN1_MO44_AR.
*/
#define	CAN1_MOAR44	(CAN1_MO44_AR)

/** \brief  159C, Message Object  Control Register */
#define CAN1_MO44_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002959Cu)

/** Alias (User Manual Name) for CAN1_MO44_CTR.
* To use register names with standard convension, please use CAN1_MO44_CTR.
*/
#define	CAN1_MOCTR44	(CAN1_MO44_CTR)

