leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO45_EDATA1.
* To use register names with standard convension, please use CAN1_MO45_EDATA1.
*/
#define	CAN1_EMO45DATA1	(CAN1_MO45_EDATA1)

/** \brief  15A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO45_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00295A8u)

/** Alias (User Manual Name) for CAN1_MO45_EDATA2.
* To use register names with standard convension, please use CAN1_MO45_EDATA2.
*/
#define	CAN1_EMO45DATA2	(CAN1_MO45_EDATA2)

/** \brief  15AC, Message Object  Acceptance Mask Register */
#define CAN1_MO45_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00295ACu)

/** Alias (User Manual Name) for CAN1_MO45_EDATA3.
* To use register names with standard convension, please use CAN1_MO45_EDATA3.
*/
#define	CAN1_EMO45DATA3	(CAN1_MO45_EDATA3)

/** \brief  15B0, Message Object  Data Register Low */
#define CAN1_MO45_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00295B0u)

/** Alias (User Manual Name) for CAN1_MO45_EDATA4.
* To use register names with standard convension, please use CAN1_MO45_EDATA4.
*/
#define	CAN1_EMO45DATA4	(CAN1_MO45_EDATA4)

/** \brief  15B4, Message Object  Data Register High */
#define CAN1_MO45_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00295B4u)

/** Alias (User Manual Name) for CAN1_MO45_EDATA5.
* To use register names with standard convension, please use CAN1_MO45_EDATA5.
*/
#define	CAN1_EMO45DATA5	(CAN1_MO45_EDATA5)

/** \brief  15B8, Message Object  Arbitration Register */
#define CAN1_MO45_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00295B8u)

/** Alias (User Manual Name) for CAN1_MO45_EDATA6.
* To use register names with standard convension, please use CAN1_MO45_EDATA6.
*/
#define	CAN1_EMO45DATA6	(CAN1_MO45_EDATA6)

/** \brief  15A0, Message Object  Function Control Register */
#define CAN1_MO45_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00295A0u)

/** Alias (User Manual Name) for CAN1_MO45_FCR.
* To use register names with standard convension, please use CAN1_MO45_FCR.
*/
#define	CAN1_MOFCR45	(CAN1_MO45_FCR)

/** \brief  15A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO45_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00295A4u)

/** Alias (User Manual Name) for CAN1_MO45_FGPR.
* To use register names with standard convension, please use CAN1_MO45_FGPR.
*/
#define	CAN1_MOFGPR45	(CAN1_MO45_FGPR)

/** \brief  15A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO45_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00295A8u)

/** Alias (User Manual Name) for CAN1_MO45_IPR.
* To use register names with standard convension, please use CAN1_MO45_IPR.
*/
#define	CAN1_MOIPR45	(CAN1_MO45_IPR)

/** \brief  15BC, Message Object  Control Register */
#define CAN1_MO45_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00295BCu)

/** Alias (User Manual Name) for CAN1_MO45_STAT.
* To use register names with standard convension, please use CAN1_MO45_STAT.
*/
#define	CAN1_MOSTAT45	(CAN1_MO45_STAT)

/** \brief  15CC, Message Object  Acceptance Mask Register */
#define CAN1_MO46_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00295CCu)

/** Alias (User Manual Name) for CAN1_MO46_AMR.
* To use register names with standard convension, please use CAN1_MO46_AMR.
*/
#define	CAN1_MOAMR46	(CAN1_MO46_AMR)

/** \brief  15D8, Message Object  Arbitration Register */
#define CAN1_MO46_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00295D8u)

/** Alias (User Manual Name) for CAN1_MO46_AR.
* To use register names with standard convension, please use CAN1_MO46_AR.
*/
#define	CAN1_MOAR46	(CAN1_MO46_AR)

/** \brief  15DC, Message Object  Control Register */
#define CAN1_MO46_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00295DCu)

/** Alias (User Manual Name) for CAN1_MO46_CTR.
* To use register names with standard convension, please use CAN1_MO46_CTR.
*/
#define	CAN1_MOCTR46	(CAN1_MO46_CTR)

/** \brief  15D4, Message Object  Data Register High */
#define CAN1_MO46_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00295D4u)

/** Alias (User Manual Name) for CAN1_MO46_DATAH.
* To use register names with standard convension, please use CAN1_MO46_DATAH.
*/
#define	CAN1_MODATAH46	(CAN1_MO46_DATAH)

/** \brief  15D0, Message Object  Data Register Low */
#define CAN1_MO46_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00295D0u)

/** Alias (User Manual Name) for CAN1_MO46_DATAL.
* To use register names with standard convension, please use CAN1_MO46_DATAL.
*/
#define	CAN1_MODATAL46	(CAN1_MO46_DATAL)

/** \brief  15C0, Message Object  Function Control Register */
#define CAN1_MO46_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00295C0u)

/** Alias (User Manual Name) for CAN1_MO46_EDATA0.
* To use register names with standard convension, please use CAN1_MO46_EDATA0.
*/
#define	CAN1_EMO46DATA0	(CAN1_MO46_EDATA0)

/** \brief  15C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO46_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00295C4u)

/** Alias (User Manual Name) for CAN1_MO46_EDATA1.
* To use register names with standard convension, please use CAN1_MO46_EDATA1.
*/
#define	CAN1_EMO46DATA1	(CAN1_MO46_EDATA1)

/** \brief  15C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO46_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00295C8u)

/** Alias (User Manual Name) for CAN1_MO46_EDATA2.
* To use register names with standard convension, please use CAN1_MO46_EDATA2.
*/
#define	CAN1_EMO46DATA2	(CAN1_MO46_EDATA2)

/** \brief  15CC, Message Object  Acceptance Mask Register */
#define CAN1_MO46_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00295CCu)

/** Alias (User Manual Name) for CAN1_MO46_EDATA3.
* To use register names with standard convension, please use CAN1_MO46_EDATA3.
*/
#define	CAN1_EMO46DATA3	(CAN1_MO46_EDATA3)

/** \brief  15D0, Message Object  Data Register Low */
#define CAN1_MO46_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00295D0u)

