leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO46_EDATA4.
* To use register names with standard convension, please use CAN1_MO46_EDATA4.
*/
#define	CAN1_EMO46DATA4	(CAN1_MO46_EDATA4)

/** \brief  15D4, Message Object  Data Register High */
#define CAN1_MO46_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00295D4u)

/** Alias (User Manual Name) for CAN1_MO46_EDATA5.
* To use register names with standard convension, please use CAN1_MO46_EDATA5.
*/
#define	CAN1_EMO46DATA5	(CAN1_MO46_EDATA5)

/** \brief  15D8, Message Object  Arbitration Register */
#define CAN1_MO46_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00295D8u)

/** Alias (User Manual Name) for CAN1_MO46_EDATA6.
* To use register names with standard convension, please use CAN1_MO46_EDATA6.
*/
#define	CAN1_EMO46DATA6	(CAN1_MO46_EDATA6)

/** \brief  15C0, Message Object  Function Control Register */
#define CAN1_MO46_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00295C0u)

/** Alias (User Manual Name) for CAN1_MO46_FCR.
* To use register names with standard convension, please use CAN1_MO46_FCR.
*/
#define	CAN1_MOFCR46	(CAN1_MO46_FCR)

/** \brief  15C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO46_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00295C4u)

/** Alias (User Manual Name) for CAN1_MO46_FGPR.
* To use register names with standard convension, please use CAN1_MO46_FGPR.
*/
#define	CAN1_MOFGPR46	(CAN1_MO46_FGPR)

/** \brief  15C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO46_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00295C8u)

/** Alias (User Manual Name) for CAN1_MO46_IPR.
* To use register names with standard convension, please use CAN1_MO46_IPR.
*/
#define	CAN1_MOIPR46	(CAN1_MO46_IPR)

/** \brief  15DC, Message Object  Control Register */
#define CAN1_MO46_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00295DCu)

/** Alias (User Manual Name) for CAN1_MO46_STAT.
* To use register names with standard convension, please use CAN1_MO46_STAT.
*/
#define	CAN1_MOSTAT46	(CAN1_MO46_STAT)

/** \brief  15EC, Message Object  Acceptance Mask Register */
#define CAN1_MO47_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00295ECu)

/** Alias (User Manual Name) for CAN1_MO47_AMR.
* To use register names with standard convension, please use CAN1_MO47_AMR.
*/
#define	CAN1_MOAMR47	(CAN1_MO47_AMR)

/** \brief  15F8, Message Object  Arbitration Register */
#define CAN1_MO47_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00295F8u)

/** Alias (User Manual Name) for CAN1_MO47_AR.
* To use register names with standard convension, please use CAN1_MO47_AR.
*/
#define	CAN1_MOAR47	(CAN1_MO47_AR)

/** \brief  15FC, Message Object  Control Register */
#define CAN1_MO47_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00295FCu)

/** Alias (User Manual Name) for CAN1_MO47_CTR.
* To use register names with standard convension, please use CAN1_MO47_CTR.
*/
#define	CAN1_MOCTR47	(CAN1_MO47_CTR)

/** \brief  15F4, Message Object  Data Register High */
#define CAN1_MO47_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00295F4u)

/** Alias (User Manual Name) for CAN1_MO47_DATAH.
* To use register names with standard convension, please use CAN1_MO47_DATAH.
*/
#define	CAN1_MODATAH47	(CAN1_MO47_DATAH)

/** \brief  15F0, Message Object  Data Register Low */
#define CAN1_MO47_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00295F0u)

/** Alias (User Manual Name) for CAN1_MO47_DATAL.
* To use register names with standard convension, please use CAN1_MO47_DATAL.
*/
#define	CAN1_MODATAL47	(CAN1_MO47_DATAL)

/** \brief  15E0, Message Object  Function Control Register */
#define CAN1_MO47_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00295E0u)

/** Alias (User Manual Name) for CAN1_MO47_EDATA0.
* To use register names with standard convension, please use CAN1_MO47_EDATA0.
*/
#define	CAN1_EMO47DATA0	(CAN1_MO47_EDATA0)

/** \brief  15E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO47_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00295E4u)

/** Alias (User Manual Name) for CAN1_MO47_EDATA1.
* To use register names with standard convension, please use CAN1_MO47_EDATA1.
*/
#define	CAN1_EMO47DATA1	(CAN1_MO47_EDATA1)

/** \brief  15E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO47_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00295E8u)

/** Alias (User Manual Name) for CAN1_MO47_EDATA2.
* To use register names with standard convension, please use CAN1_MO47_EDATA2.
*/
#define	CAN1_EMO47DATA2	(CAN1_MO47_EDATA2)

/** \brief  15EC, Message Object  Acceptance Mask Register */
#define CAN1_MO47_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00295ECu)

/** Alias (User Manual Name) for CAN1_MO47_EDATA3.
* To use register names with standard convension, please use CAN1_MO47_EDATA3.
*/
#define	CAN1_EMO47DATA3	(CAN1_MO47_EDATA3)

/** \brief  15F0, Message Object  Data Register Low */
#define CAN1_MO47_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00295F0u)

/** Alias (User Manual Name) for CAN1_MO47_EDATA4.
* To use register names with standard convension, please use CAN1_MO47_EDATA4.
*/
#define	CAN1_EMO47DATA4	(CAN1_MO47_EDATA4)

/** \brief  15F4, Message Object  Data Register High */
#define CAN1_MO47_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00295F4u)

/** Alias (User Manual Name) for CAN1_MO47_EDATA5.
* To use register names with standard convension, please use CAN1_MO47_EDATA5.
*/
#define	CAN1_EMO47DATA5	(CAN1_MO47_EDATA5)

/** \brief  15F8, Message Object  Arbitration Register */
#define CAN1_MO47_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00295F8u)

/** Alias (User Manual Name) for CAN1_MO47_EDATA6.
* To use register names with standard convension, please use CAN1_MO47_EDATA6.
*/
#define	CAN1_EMO47DATA6	(CAN1_MO47_EDATA6)

/** \brief  15E0, Message Object  Function Control Register */
#define CAN1_MO47_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00295E0u)

