leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO47_FCR.
* To use register names with standard convension, please use CAN1_MO47_FCR.
*/
#define	CAN1_MOFCR47	(CAN1_MO47_FCR)

/** \brief  15E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO47_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00295E4u)

/** Alias (User Manual Name) for CAN1_MO47_FGPR.
* To use register names with standard convension, please use CAN1_MO47_FGPR.
*/
#define	CAN1_MOFGPR47	(CAN1_MO47_FGPR)

/** \brief  15E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO47_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00295E8u)

/** Alias (User Manual Name) for CAN1_MO47_IPR.
* To use register names with standard convension, please use CAN1_MO47_IPR.
*/
#define	CAN1_MOIPR47	(CAN1_MO47_IPR)

/** \brief  15FC, Message Object  Control Register */
#define CAN1_MO47_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00295FCu)

/** Alias (User Manual Name) for CAN1_MO47_STAT.
* To use register names with standard convension, please use CAN1_MO47_STAT.
*/
#define	CAN1_MOSTAT47	(CAN1_MO47_STAT)

/** \brief  160C, Message Object  Acceptance Mask Register */
#define CAN1_MO48_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002960Cu)

/** Alias (User Manual Name) for CAN1_MO48_AMR.
* To use register names with standard convension, please use CAN1_MO48_AMR.
*/
#define	CAN1_MOAMR48	(CAN1_MO48_AMR)

/** \brief  1618, Message Object  Arbitration Register */
#define CAN1_MO48_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029618u)

/** Alias (User Manual Name) for CAN1_MO48_AR.
* To use register names with standard convension, please use CAN1_MO48_AR.
*/
#define	CAN1_MOAR48	(CAN1_MO48_AR)

/** \brief  161C, Message Object  Control Register */
#define CAN1_MO48_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002961Cu)

/** Alias (User Manual Name) for CAN1_MO48_CTR.
* To use register names with standard convension, please use CAN1_MO48_CTR.
*/
#define	CAN1_MOCTR48	(CAN1_MO48_CTR)

/** \brief  1614, Message Object  Data Register High */
#define CAN1_MO48_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029614u)

/** Alias (User Manual Name) for CAN1_MO48_DATAH.
* To use register names with standard convension, please use CAN1_MO48_DATAH.
*/
#define	CAN1_MODATAH48	(CAN1_MO48_DATAH)

/** \brief  1610, Message Object  Data Register Low */
#define CAN1_MO48_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029610u)

/** Alias (User Manual Name) for CAN1_MO48_DATAL.
* To use register names with standard convension, please use CAN1_MO48_DATAL.
*/
#define	CAN1_MODATAL48	(CAN1_MO48_DATAL)

/** \brief  1600, Message Object  Function Control Register */
#define CAN1_MO48_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029600u)

/** Alias (User Manual Name) for CAN1_MO48_EDATA0.
* To use register names with standard convension, please use CAN1_MO48_EDATA0.
*/
#define	CAN1_EMO48DATA0	(CAN1_MO48_EDATA0)

/** \brief  1604, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO48_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029604u)

/** Alias (User Manual Name) for CAN1_MO48_EDATA1.
* To use register names with standard convension, please use CAN1_MO48_EDATA1.
*/
#define	CAN1_EMO48DATA1	(CAN1_MO48_EDATA1)

/** \brief  1608, Message Object  Interrupt Pointer Register */
#define CAN1_MO48_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029608u)

/** Alias (User Manual Name) for CAN1_MO48_EDATA2.
* To use register names with standard convension, please use CAN1_MO48_EDATA2.
*/
#define	CAN1_EMO48DATA2	(CAN1_MO48_EDATA2)

/** \brief  160C, Message Object  Acceptance Mask Register */
#define CAN1_MO48_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002960Cu)

/** Alias (User Manual Name) for CAN1_MO48_EDATA3.
* To use register names with standard convension, please use CAN1_MO48_EDATA3.
*/
#define	CAN1_EMO48DATA3	(CAN1_MO48_EDATA3)

/** \brief  1610, Message Object  Data Register Low */
#define CAN1_MO48_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029610u)

/** Alias (User Manual Name) for CAN1_MO48_EDATA4.
* To use register names with standard convension, please use CAN1_MO48_EDATA4.
*/
#define	CAN1_EMO48DATA4	(CAN1_MO48_EDATA4)

/** \brief  1614, Message Object  Data Register High */
#define CAN1_MO48_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029614u)

/** Alias (User Manual Name) for CAN1_MO48_EDATA5.
* To use register names with standard convension, please use CAN1_MO48_EDATA5.
*/
#define	CAN1_EMO48DATA5	(CAN1_MO48_EDATA5)

/** \brief  1618, Message Object  Arbitration Register */
#define CAN1_MO48_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029618u)

/** Alias (User Manual Name) for CAN1_MO48_EDATA6.
* To use register names with standard convension, please use CAN1_MO48_EDATA6.
*/
#define	CAN1_EMO48DATA6	(CAN1_MO48_EDATA6)

/** \brief  1600, Message Object  Function Control Register */
#define CAN1_MO48_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029600u)

/** Alias (User Manual Name) for CAN1_MO48_FCR.
* To use register names with standard convension, please use CAN1_MO48_FCR.
*/
#define	CAN1_MOFCR48	(CAN1_MO48_FCR)

/** \brief  1604, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO48_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029604u)

/** Alias (User Manual Name) for CAN1_MO48_FGPR.
* To use register names with standard convension, please use CAN1_MO48_FGPR.
*/
#define	CAN1_MOFGPR48	(CAN1_MO48_FGPR)

/** \brief  1608, Message Object  Interrupt Pointer Register */
#define CAN1_MO48_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029608u)

/** Alias (User Manual Name) for CAN1_MO48_IPR.
* To use register names with standard convension, please use CAN1_MO48_IPR.
*/
#define	CAN1_MOIPR48	(CAN1_MO48_IPR)

/** \brief  161C, Message Object  Control Register */
#define CAN1_MO48_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002961Cu)

/** Alias (User Manual Name) for CAN1_MO48_STAT.
* To use register names with standard convension, please use CAN1_MO48_STAT.
*/
#define	CAN1_MOSTAT48	(CAN1_MO48_STAT)

/** \brief  162C, Message Object  Acceptance Mask Register */
#define CAN1_MO49_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002962Cu)

/** Alias (User Manual Name) for CAN1_MO49_AMR.
* To use register names with standard convension, please use CAN1_MO49_AMR.
*/
#define	CAN1_MOAMR49	(CAN1_MO49_AMR)

