leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1638, Message Object  Arbitration Register */
#define CAN1_MO49_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029638u)

/** Alias (User Manual Name) for CAN1_MO49_AR.
* To use register names with standard convension, please use CAN1_MO49_AR.
*/
#define	CAN1_MOAR49	(CAN1_MO49_AR)

/** \brief  163C, Message Object  Control Register */
#define CAN1_MO49_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002963Cu)

/** Alias (User Manual Name) for CAN1_MO49_CTR.
* To use register names with standard convension, please use CAN1_MO49_CTR.
*/
#define	CAN1_MOCTR49	(CAN1_MO49_CTR)

/** \brief  1634, Message Object  Data Register High */
#define CAN1_MO49_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029634u)

/** Alias (User Manual Name) for CAN1_MO49_DATAH.
* To use register names with standard convension, please use CAN1_MO49_DATAH.
*/
#define	CAN1_MODATAH49	(CAN1_MO49_DATAH)

/** \brief  1630, Message Object  Data Register Low */
#define CAN1_MO49_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029630u)

/** Alias (User Manual Name) for CAN1_MO49_DATAL.
* To use register names with standard convension, please use CAN1_MO49_DATAL.
*/
#define	CAN1_MODATAL49	(CAN1_MO49_DATAL)

/** \brief  1620, Message Object  Function Control Register */
#define CAN1_MO49_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029620u)

/** Alias (User Manual Name) for CAN1_MO49_EDATA0.
* To use register names with standard convension, please use CAN1_MO49_EDATA0.
*/
#define	CAN1_EMO49DATA0	(CAN1_MO49_EDATA0)

/** \brief  1624, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO49_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029624u)

/** Alias (User Manual Name) for CAN1_MO49_EDATA1.
* To use register names with standard convension, please use CAN1_MO49_EDATA1.
*/
#define	CAN1_EMO49DATA1	(CAN1_MO49_EDATA1)

/** \brief  1628, Message Object  Interrupt Pointer Register */
#define CAN1_MO49_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029628u)

/** Alias (User Manual Name) for CAN1_MO49_EDATA2.
* To use register names with standard convension, please use CAN1_MO49_EDATA2.
*/
#define	CAN1_EMO49DATA2	(CAN1_MO49_EDATA2)

/** \brief  162C, Message Object  Acceptance Mask Register */
#define CAN1_MO49_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002962Cu)

/** Alias (User Manual Name) for CAN1_MO49_EDATA3.
* To use register names with standard convension, please use CAN1_MO49_EDATA3.
*/
#define	CAN1_EMO49DATA3	(CAN1_MO49_EDATA3)

/** \brief  1630, Message Object  Data Register Low */
#define CAN1_MO49_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029630u)

/** Alias (User Manual Name) for CAN1_MO49_EDATA4.
* To use register names with standard convension, please use CAN1_MO49_EDATA4.
*/
#define	CAN1_EMO49DATA4	(CAN1_MO49_EDATA4)

/** \brief  1634, Message Object  Data Register High */
#define CAN1_MO49_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029634u)

/** Alias (User Manual Name) for CAN1_MO49_EDATA5.
* To use register names with standard convension, please use CAN1_MO49_EDATA5.
*/
#define	CAN1_EMO49DATA5	(CAN1_MO49_EDATA5)

/** \brief  1638, Message Object  Arbitration Register */
#define CAN1_MO49_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029638u)

/** Alias (User Manual Name) for CAN1_MO49_EDATA6.
* To use register names with standard convension, please use CAN1_MO49_EDATA6.
*/
#define	CAN1_EMO49DATA6	(CAN1_MO49_EDATA6)

/** \brief  1620, Message Object  Function Control Register */
#define CAN1_MO49_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029620u)

/** Alias (User Manual Name) for CAN1_MO49_FCR.
* To use register names with standard convension, please use CAN1_MO49_FCR.
*/
#define	CAN1_MOFCR49	(CAN1_MO49_FCR)

/** \brief  1624, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO49_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029624u)

/** Alias (User Manual Name) for CAN1_MO49_FGPR.
* To use register names with standard convension, please use CAN1_MO49_FGPR.
*/
#define	CAN1_MOFGPR49	(CAN1_MO49_FGPR)

/** \brief  1628, Message Object  Interrupt Pointer Register */
#define CAN1_MO49_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029628u)

/** Alias (User Manual Name) for CAN1_MO49_IPR.
* To use register names with standard convension, please use CAN1_MO49_IPR.
*/
#define	CAN1_MOIPR49	(CAN1_MO49_IPR)

/** \brief  163C, Message Object  Control Register */
#define CAN1_MO49_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002963Cu)

/** Alias (User Manual Name) for CAN1_MO49_STAT.
* To use register names with standard convension, please use CAN1_MO49_STAT.
*/
#define	CAN1_MOSTAT49	(CAN1_MO49_STAT)

/** \brief  108C, Message Object  Acceptance Mask Register */
#define CAN1_MO4_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002908Cu)

/** Alias (User Manual Name) for CAN1_MO4_AMR.
* To use register names with standard convension, please use CAN1_MO4_AMR.
*/
#define	CAN1_MOAMR4	(CAN1_MO4_AMR)

/** \brief  1098, Message Object  Arbitration Register */
#define CAN1_MO4_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029098u)

/** Alias (User Manual Name) for CAN1_MO4_AR.
* To use register names with standard convension, please use CAN1_MO4_AR.
*/
#define	CAN1_MOAR4	(CAN1_MO4_AR)

/** \brief  109C, Message Object  Control Register */
#define CAN1_MO4_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002909Cu)

/** Alias (User Manual Name) for CAN1_MO4_CTR.
* To use register names with standard convension, please use CAN1_MO4_CTR.
*/
#define	CAN1_MOCTR4	(CAN1_MO4_CTR)

/** \brief  1094, Message Object  Data Register High */
#define CAN1_MO4_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029094u)

/** Alias (User Manual Name) for CAN1_MO4_DATAH.
* To use register names with standard convension, please use CAN1_MO4_DATAH.
*/
#define	CAN1_MODATAH4	(CAN1_MO4_DATAH)

/** \brief  1090, Message Object  Data Register Low */
#define CAN1_MO4_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029090u)

/** Alias (User Manual Name) for CAN1_MO4_DATAL.
* To use register names with standard convension, please use CAN1_MO4_DATAL.
*/
#define	CAN1_MODATAL4	(CAN1_MO4_DATAL)

/** \brief  1080, Message Object  Function Control Register */
#define CAN1_MO4_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029080u)

/** Alias (User Manual Name) for CAN1_MO4_EDATA0.
* To use register names with standard convension, please use CAN1_MO4_EDATA0.
*/
#define	CAN1_EMO4DATA0	(CAN1_MO4_EDATA0)

/** \brief  1084, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO4_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029084u)

