leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1640, Message Object  Function Control Register */
#define CAN1_MO50_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029640u)

/** Alias (User Manual Name) for CAN1_MO50_FCR.
* To use register names with standard convension, please use CAN1_MO50_FCR.
*/
#define	CAN1_MOFCR50	(CAN1_MO50_FCR)

/** \brief  1644, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO50_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029644u)

/** Alias (User Manual Name) for CAN1_MO50_FGPR.
* To use register names with standard convension, please use CAN1_MO50_FGPR.
*/
#define	CAN1_MOFGPR50	(CAN1_MO50_FGPR)

/** \brief  1648, Message Object  Interrupt Pointer Register */
#define CAN1_MO50_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029648u)

/** Alias (User Manual Name) for CAN1_MO50_IPR.
* To use register names with standard convension, please use CAN1_MO50_IPR.
*/
#define	CAN1_MOIPR50	(CAN1_MO50_IPR)

/** \brief  165C, Message Object  Control Register */
#define CAN1_MO50_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002965Cu)

/** Alias (User Manual Name) for CAN1_MO50_STAT.
* To use register names with standard convension, please use CAN1_MO50_STAT.
*/
#define	CAN1_MOSTAT50	(CAN1_MO50_STAT)

/** \brief  166C, Message Object  Acceptance Mask Register */
#define CAN1_MO51_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002966Cu)

/** Alias (User Manual Name) for CAN1_MO51_AMR.
* To use register names with standard convension, please use CAN1_MO51_AMR.
*/
#define	CAN1_MOAMR51	(CAN1_MO51_AMR)

/** \brief  1678, Message Object  Arbitration Register */
#define CAN1_MO51_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029678u)

/** Alias (User Manual Name) for CAN1_MO51_AR.
* To use register names with standard convension, please use CAN1_MO51_AR.
*/
#define	CAN1_MOAR51	(CAN1_MO51_AR)

/** \brief  167C, Message Object  Control Register */
#define CAN1_MO51_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002967Cu)

/** Alias (User Manual Name) for CAN1_MO51_CTR.
* To use register names with standard convension, please use CAN1_MO51_CTR.
*/
#define	CAN1_MOCTR51	(CAN1_MO51_CTR)

/** \brief  1674, Message Object  Data Register High */
#define CAN1_MO51_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029674u)

/** Alias (User Manual Name) for CAN1_MO51_DATAH.
* To use register names with standard convension, please use CAN1_MO51_DATAH.
*/
#define	CAN1_MODATAH51	(CAN1_MO51_DATAH)

/** \brief  1670, Message Object  Data Register Low */
#define CAN1_MO51_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029670u)

/** Alias (User Manual Name) for CAN1_MO51_DATAL.
* To use register names with standard convension, please use CAN1_MO51_DATAL.
*/
#define	CAN1_MODATAL51	(CAN1_MO51_DATAL)

/** \brief  1660, Message Object  Function Control Register */
#define CAN1_MO51_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029660u)

/** Alias (User Manual Name) for CAN1_MO51_EDATA0.
* To use register names with standard convension, please use CAN1_MO51_EDATA0.
*/
#define	CAN1_EMO51DATA0	(CAN1_MO51_EDATA0)

/** \brief  1664, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO51_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029664u)

/** Alias (User Manual Name) for CAN1_MO51_EDATA1.
* To use register names with standard convension, please use CAN1_MO51_EDATA1.
*/
#define	CAN1_EMO51DATA1	(CAN1_MO51_EDATA1)

/** \brief  1668, Message Object  Interrupt Pointer Register */
#define CAN1_MO51_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029668u)

/** Alias (User Manual Name) for CAN1_MO51_EDATA2.
* To use register names with standard convension, please use CAN1_MO51_EDATA2.
*/
#define	CAN1_EMO51DATA2	(CAN1_MO51_EDATA2)

/** \brief  166C, Message Object  Acceptance Mask Register */
#define CAN1_MO51_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002966Cu)

/** Alias (User Manual Name) for CAN1_MO51_EDATA3.
* To use register names with standard convension, please use CAN1_MO51_EDATA3.
*/
#define	CAN1_EMO51DATA3	(CAN1_MO51_EDATA3)

/** \brief  1670, Message Object  Data Register Low */
#define CAN1_MO51_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029670u)

/** Alias (User Manual Name) for CAN1_MO51_EDATA4.
* To use register names with standard convension, please use CAN1_MO51_EDATA4.
*/
#define	CAN1_EMO51DATA4	(CAN1_MO51_EDATA4)

/** \brief  1674, Message Object  Data Register High */
#define CAN1_MO51_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029674u)

/** Alias (User Manual Name) for CAN1_MO51_EDATA5.
* To use register names with standard convension, please use CAN1_MO51_EDATA5.
*/
#define	CAN1_EMO51DATA5	(CAN1_MO51_EDATA5)

/** \brief  1678, Message Object  Arbitration Register */
#define CAN1_MO51_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029678u)

/** Alias (User Manual Name) for CAN1_MO51_EDATA6.
* To use register names with standard convension, please use CAN1_MO51_EDATA6.
*/
#define	CAN1_EMO51DATA6	(CAN1_MO51_EDATA6)

/** \brief  1660, Message Object  Function Control Register */
#define CAN1_MO51_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029660u)

/** Alias (User Manual Name) for CAN1_MO51_FCR.
* To use register names with standard convension, please use CAN1_MO51_FCR.
*/
#define	CAN1_MOFCR51	(CAN1_MO51_FCR)

/** \brief  1664, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO51_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029664u)

/** Alias (User Manual Name) for CAN1_MO51_FGPR.
* To use register names with standard convension, please use CAN1_MO51_FGPR.
*/
#define	CAN1_MOFGPR51	(CAN1_MO51_FGPR)

/** \brief  1668, Message Object  Interrupt Pointer Register */
#define CAN1_MO51_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029668u)

/** Alias (User Manual Name) for CAN1_MO51_IPR.
* To use register names with standard convension, please use CAN1_MO51_IPR.
*/
#define	CAN1_MOIPR51	(CAN1_MO51_IPR)

/** \brief  167C, Message Object  Control Register */
#define CAN1_MO51_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002967Cu)

