leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO51_STAT.
* To use register names with standard convension, please use CAN1_MO51_STAT.
*/
#define	CAN1_MOSTAT51	(CAN1_MO51_STAT)

/** \brief  168C, Message Object  Acceptance Mask Register */
#define CAN1_MO52_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002968Cu)

/** Alias (User Manual Name) for CAN1_MO52_AMR.
* To use register names with standard convension, please use CAN1_MO52_AMR.
*/
#define	CAN1_MOAMR52	(CAN1_MO52_AMR)

/** \brief  1698, Message Object  Arbitration Register */
#define CAN1_MO52_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029698u)

/** Alias (User Manual Name) for CAN1_MO52_AR.
* To use register names with standard convension, please use CAN1_MO52_AR.
*/
#define	CAN1_MOAR52	(CAN1_MO52_AR)

/** \brief  169C, Message Object  Control Register */
#define CAN1_MO52_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002969Cu)

/** Alias (User Manual Name) for CAN1_MO52_CTR.
* To use register names with standard convension, please use CAN1_MO52_CTR.
*/
#define	CAN1_MOCTR52	(CAN1_MO52_CTR)

/** \brief  1694, Message Object  Data Register High */
#define CAN1_MO52_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029694u)

/** Alias (User Manual Name) for CAN1_MO52_DATAH.
* To use register names with standard convension, please use CAN1_MO52_DATAH.
*/
#define	CAN1_MODATAH52	(CAN1_MO52_DATAH)

/** \brief  1690, Message Object  Data Register Low */
#define CAN1_MO52_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029690u)

/** Alias (User Manual Name) for CAN1_MO52_DATAL.
* To use register names with standard convension, please use CAN1_MO52_DATAL.
*/
#define	CAN1_MODATAL52	(CAN1_MO52_DATAL)

/** \brief  1680, Message Object  Function Control Register */
#define CAN1_MO52_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029680u)

/** Alias (User Manual Name) for CAN1_MO52_EDATA0.
* To use register names with standard convension, please use CAN1_MO52_EDATA0.
*/
#define	CAN1_EMO52DATA0	(CAN1_MO52_EDATA0)

/** \brief  1684, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO52_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029684u)

/** Alias (User Manual Name) for CAN1_MO52_EDATA1.
* To use register names with standard convension, please use CAN1_MO52_EDATA1.
*/
#define	CAN1_EMO52DATA1	(CAN1_MO52_EDATA1)

/** \brief  1688, Message Object  Interrupt Pointer Register */
#define CAN1_MO52_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029688u)

/** Alias (User Manual Name) for CAN1_MO52_EDATA2.
* To use register names with standard convension, please use CAN1_MO52_EDATA2.
*/
#define	CAN1_EMO52DATA2	(CAN1_MO52_EDATA2)

/** \brief  168C, Message Object  Acceptance Mask Register */
#define CAN1_MO52_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002968Cu)

/** Alias (User Manual Name) for CAN1_MO52_EDATA3.
* To use register names with standard convension, please use CAN1_MO52_EDATA3.
*/
#define	CAN1_EMO52DATA3	(CAN1_MO52_EDATA3)

/** \brief  1690, Message Object  Data Register Low */
#define CAN1_MO52_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029690u)

/** Alias (User Manual Name) for CAN1_MO52_EDATA4.
* To use register names with standard convension, please use CAN1_MO52_EDATA4.
*/
#define	CAN1_EMO52DATA4	(CAN1_MO52_EDATA4)

/** \brief  1694, Message Object  Data Register High */
#define CAN1_MO52_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029694u)

/** Alias (User Manual Name) for CAN1_MO52_EDATA5.
* To use register names with standard convension, please use CAN1_MO52_EDATA5.
*/
#define	CAN1_EMO52DATA5	(CAN1_MO52_EDATA5)

/** \brief  1698, Message Object  Arbitration Register */
#define CAN1_MO52_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029698u)

/** Alias (User Manual Name) for CAN1_MO52_EDATA6.
* To use register names with standard convension, please use CAN1_MO52_EDATA6.
*/
#define	CAN1_EMO52DATA6	(CAN1_MO52_EDATA6)

/** \brief  1680, Message Object  Function Control Register */
#define CAN1_MO52_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029680u)

/** Alias (User Manual Name) for CAN1_MO52_FCR.
* To use register names with standard convension, please use CAN1_MO52_FCR.
*/
#define	CAN1_MOFCR52	(CAN1_MO52_FCR)

/** \brief  1684, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO52_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029684u)

/** Alias (User Manual Name) for CAN1_MO52_FGPR.
* To use register names with standard convension, please use CAN1_MO52_FGPR.
*/
#define	CAN1_MOFGPR52	(CAN1_MO52_FGPR)

/** \brief  1688, Message Object  Interrupt Pointer Register */
#define CAN1_MO52_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029688u)

/** Alias (User Manual Name) for CAN1_MO52_IPR.
* To use register names with standard convension, please use CAN1_MO52_IPR.
*/
#define	CAN1_MOIPR52	(CAN1_MO52_IPR)

/** \brief  169C, Message Object  Control Register */
#define CAN1_MO52_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002969Cu)

/** Alias (User Manual Name) for CAN1_MO52_STAT.
* To use register names with standard convension, please use CAN1_MO52_STAT.
*/
#define	CAN1_MOSTAT52	(CAN1_MO52_STAT)

/** \brief  16AC, Message Object  Acceptance Mask Register */
#define CAN1_MO53_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00296ACu)

/** Alias (User Manual Name) for CAN1_MO53_AMR.
* To use register names with standard convension, please use CAN1_MO53_AMR.
*/
#define	CAN1_MOAMR53	(CAN1_MO53_AMR)

/** \brief  16B8, Message Object  Arbitration Register */
#define CAN1_MO53_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00296B8u)

/** Alias (User Manual Name) for CAN1_MO53_AR.
* To use register names with standard convension, please use CAN1_MO53_AR.
*/
#define	CAN1_MOAR53	(CAN1_MO53_AR)

/** \brief  16BC, Message Object  Control Register */
#define CAN1_MO53_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00296BCu)

/** Alias (User Manual Name) for CAN1_MO53_CTR.
* To use register names with standard convension, please use CAN1_MO53_CTR.
*/
#define	CAN1_MOCTR53	(CAN1_MO53_CTR)

