leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  16B4, Message Object  Data Register High */
#define CAN1_MO53_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00296B4u)

/** Alias (User Manual Name) for CAN1_MO53_DATAH.
* To use register names with standard convension, please use CAN1_MO53_DATAH.
*/
#define	CAN1_MODATAH53	(CAN1_MO53_DATAH)

/** \brief  16B0, Message Object  Data Register Low */
#define CAN1_MO53_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00296B0u)

/** Alias (User Manual Name) for CAN1_MO53_DATAL.
* To use register names with standard convension, please use CAN1_MO53_DATAL.
*/
#define	CAN1_MODATAL53	(CAN1_MO53_DATAL)

/** \brief  16A0, Message Object  Function Control Register */
#define CAN1_MO53_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00296A0u)

/** Alias (User Manual Name) for CAN1_MO53_EDATA0.
* To use register names with standard convension, please use CAN1_MO53_EDATA0.
*/
#define	CAN1_EMO53DATA0	(CAN1_MO53_EDATA0)

/** \brief  16A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO53_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00296A4u)

/** Alias (User Manual Name) for CAN1_MO53_EDATA1.
* To use register names with standard convension, please use CAN1_MO53_EDATA1.
*/
#define	CAN1_EMO53DATA1	(CAN1_MO53_EDATA1)

/** \brief  16A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO53_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00296A8u)

/** Alias (User Manual Name) for CAN1_MO53_EDATA2.
* To use register names with standard convension, please use CAN1_MO53_EDATA2.
*/
#define	CAN1_EMO53DATA2	(CAN1_MO53_EDATA2)

/** \brief  16AC, Message Object  Acceptance Mask Register */
#define CAN1_MO53_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00296ACu)

/** Alias (User Manual Name) for CAN1_MO53_EDATA3.
* To use register names with standard convension, please use CAN1_MO53_EDATA3.
*/
#define	CAN1_EMO53DATA3	(CAN1_MO53_EDATA3)

/** \brief  16B0, Message Object  Data Register Low */
#define CAN1_MO53_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00296B0u)

/** Alias (User Manual Name) for CAN1_MO53_EDATA4.
* To use register names with standard convension, please use CAN1_MO53_EDATA4.
*/
#define	CAN1_EMO53DATA4	(CAN1_MO53_EDATA4)

/** \brief  16B4, Message Object  Data Register High */
#define CAN1_MO53_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00296B4u)

/** Alias (User Manual Name) for CAN1_MO53_EDATA5.
* To use register names with standard convension, please use CAN1_MO53_EDATA5.
*/
#define	CAN1_EMO53DATA5	(CAN1_MO53_EDATA5)

/** \brief  16B8, Message Object  Arbitration Register */
#define CAN1_MO53_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00296B8u)

/** Alias (User Manual Name) for CAN1_MO53_EDATA6.
* To use register names with standard convension, please use CAN1_MO53_EDATA6.
*/
#define	CAN1_EMO53DATA6	(CAN1_MO53_EDATA6)

/** \brief  16A0, Message Object  Function Control Register */
#define CAN1_MO53_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00296A0u)

/** Alias (User Manual Name) for CAN1_MO53_FCR.
* To use register names with standard convension, please use CAN1_MO53_FCR.
*/
#define	CAN1_MOFCR53	(CAN1_MO53_FCR)

/** \brief  16A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO53_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00296A4u)

/** Alias (User Manual Name) for CAN1_MO53_FGPR.
* To use register names with standard convension, please use CAN1_MO53_FGPR.
*/
#define	CAN1_MOFGPR53	(CAN1_MO53_FGPR)

/** \brief  16A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO53_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00296A8u)

/** Alias (User Manual Name) for CAN1_MO53_IPR.
* To use register names with standard convension, please use CAN1_MO53_IPR.
*/
#define	CAN1_MOIPR53	(CAN1_MO53_IPR)

/** \brief  16BC, Message Object  Control Register */
#define CAN1_MO53_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00296BCu)

/** Alias (User Manual Name) for CAN1_MO53_STAT.
* To use register names with standard convension, please use CAN1_MO53_STAT.
*/
#define	CAN1_MOSTAT53	(CAN1_MO53_STAT)

/** \brief  16CC, Message Object  Acceptance Mask Register */
#define CAN1_MO54_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00296CCu)

/** Alias (User Manual Name) for CAN1_MO54_AMR.
* To use register names with standard convension, please use CAN1_MO54_AMR.
*/
#define	CAN1_MOAMR54	(CAN1_MO54_AMR)

/** \brief  16D8, Message Object  Arbitration Register */
#define CAN1_MO54_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00296D8u)

/** Alias (User Manual Name) for CAN1_MO54_AR.
* To use register names with standard convension, please use CAN1_MO54_AR.
*/
#define	CAN1_MOAR54	(CAN1_MO54_AR)

/** \brief  16DC, Message Object  Control Register */
#define CAN1_MO54_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00296DCu)

/** Alias (User Manual Name) for CAN1_MO54_CTR.
* To use register names with standard convension, please use CAN1_MO54_CTR.
*/
#define	CAN1_MOCTR54	(CAN1_MO54_CTR)

/** \brief  16D4, Message Object  Data Register High */
#define CAN1_MO54_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00296D4u)

/** Alias (User Manual Name) for CAN1_MO54_DATAH.
* To use register names with standard convension, please use CAN1_MO54_DATAH.
*/
#define	CAN1_MODATAH54	(CAN1_MO54_DATAH)

/** \brief  16D0, Message Object  Data Register Low */
#define CAN1_MO54_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00296D0u)

/** Alias (User Manual Name) for CAN1_MO54_DATAL.
* To use register names with standard convension, please use CAN1_MO54_DATAL.
*/
#define	CAN1_MODATAL54	(CAN1_MO54_DATAL)

/** \brief  16C0, Message Object  Function Control Register */
#define CAN1_MO54_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00296C0u)

/** Alias (User Manual Name) for CAN1_MO54_EDATA0.
* To use register names with standard convension, please use CAN1_MO54_EDATA0.
*/
#define	CAN1_EMO54DATA0	(CAN1_MO54_EDATA0)

/** \brief  16C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO54_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00296C4u)

/** Alias (User Manual Name) for CAN1_MO54_EDATA1.
* To use register names with standard convension, please use CAN1_MO54_EDATA1.
*/
#define	CAN1_EMO54DATA1	(CAN1_MO54_EDATA1)

