leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  16C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO54_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00296C8u)

/** Alias (User Manual Name) for CAN1_MO54_EDATA2.
* To use register names with standard convension, please use CAN1_MO54_EDATA2.
*/
#define	CAN1_EMO54DATA2	(CAN1_MO54_EDATA2)

/** \brief  16CC, Message Object  Acceptance Mask Register */
#define CAN1_MO54_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00296CCu)

/** Alias (User Manual Name) for CAN1_MO54_EDATA3.
* To use register names with standard convension, please use CAN1_MO54_EDATA3.
*/
#define	CAN1_EMO54DATA3	(CAN1_MO54_EDATA3)

/** \brief  16D0, Message Object  Data Register Low */
#define CAN1_MO54_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00296D0u)

/** Alias (User Manual Name) for CAN1_MO54_EDATA4.
* To use register names with standard convension, please use CAN1_MO54_EDATA4.
*/
#define	CAN1_EMO54DATA4	(CAN1_MO54_EDATA4)

/** \brief  16D4, Message Object  Data Register High */
#define CAN1_MO54_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00296D4u)

/** Alias (User Manual Name) for CAN1_MO54_EDATA5.
* To use register names with standard convension, please use CAN1_MO54_EDATA5.
*/
#define	CAN1_EMO54DATA5	(CAN1_MO54_EDATA5)

/** \brief  16D8, Message Object  Arbitration Register */
#define CAN1_MO54_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00296D8u)

/** Alias (User Manual Name) for CAN1_MO54_EDATA6.
* To use register names with standard convension, please use CAN1_MO54_EDATA6.
*/
#define	CAN1_EMO54DATA6	(CAN1_MO54_EDATA6)

/** \brief  16C0, Message Object  Function Control Register */
#define CAN1_MO54_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00296C0u)

/** Alias (User Manual Name) for CAN1_MO54_FCR.
* To use register names with standard convension, please use CAN1_MO54_FCR.
*/
#define	CAN1_MOFCR54	(CAN1_MO54_FCR)

/** \brief  16C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO54_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00296C4u)

/** Alias (User Manual Name) for CAN1_MO54_FGPR.
* To use register names with standard convension, please use CAN1_MO54_FGPR.
*/
#define	CAN1_MOFGPR54	(CAN1_MO54_FGPR)

/** \brief  16C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO54_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00296C8u)

/** Alias (User Manual Name) for CAN1_MO54_IPR.
* To use register names with standard convension, please use CAN1_MO54_IPR.
*/
#define	CAN1_MOIPR54	(CAN1_MO54_IPR)

/** \brief  16DC, Message Object  Control Register */
#define CAN1_MO54_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00296DCu)

/** Alias (User Manual Name) for CAN1_MO54_STAT.
* To use register names with standard convension, please use CAN1_MO54_STAT.
*/
#define	CAN1_MOSTAT54	(CAN1_MO54_STAT)

/** \brief  16EC, Message Object  Acceptance Mask Register */
#define CAN1_MO55_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00296ECu)

/** Alias (User Manual Name) for CAN1_MO55_AMR.
* To use register names with standard convension, please use CAN1_MO55_AMR.
*/
#define	CAN1_MOAMR55	(CAN1_MO55_AMR)

/** \brief  16F8, Message Object  Arbitration Register */
#define CAN1_MO55_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00296F8u)

/** Alias (User Manual Name) for CAN1_MO55_AR.
* To use register names with standard convension, please use CAN1_MO55_AR.
*/
#define	CAN1_MOAR55	(CAN1_MO55_AR)

/** \brief  16FC, Message Object  Control Register */
#define CAN1_MO55_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00296FCu)

/** Alias (User Manual Name) for CAN1_MO55_CTR.
* To use register names with standard convension, please use CAN1_MO55_CTR.
*/
#define	CAN1_MOCTR55	(CAN1_MO55_CTR)

/** \brief  16F4, Message Object  Data Register High */
#define CAN1_MO55_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00296F4u)

/** Alias (User Manual Name) for CAN1_MO55_DATAH.
* To use register names with standard convension, please use CAN1_MO55_DATAH.
*/
#define	CAN1_MODATAH55	(CAN1_MO55_DATAH)

/** \brief  16F0, Message Object  Data Register Low */
#define CAN1_MO55_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00296F0u)

/** Alias (User Manual Name) for CAN1_MO55_DATAL.
* To use register names with standard convension, please use CAN1_MO55_DATAL.
*/
#define	CAN1_MODATAL55	(CAN1_MO55_DATAL)

/** \brief  16E0, Message Object  Function Control Register */
#define CAN1_MO55_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00296E0u)

/** Alias (User Manual Name) for CAN1_MO55_EDATA0.
* To use register names with standard convension, please use CAN1_MO55_EDATA0.
*/
#define	CAN1_EMO55DATA0	(CAN1_MO55_EDATA0)

/** \brief  16E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO55_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00296E4u)

/** Alias (User Manual Name) for CAN1_MO55_EDATA1.
* To use register names with standard convension, please use CAN1_MO55_EDATA1.
*/
#define	CAN1_EMO55DATA1	(CAN1_MO55_EDATA1)

/** \brief  16E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO55_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00296E8u)

/** Alias (User Manual Name) for CAN1_MO55_EDATA2.
* To use register names with standard convension, please use CAN1_MO55_EDATA2.
*/
#define	CAN1_EMO55DATA2	(CAN1_MO55_EDATA2)

/** \brief  16EC, Message Object  Acceptance Mask Register */
#define CAN1_MO55_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00296ECu)

/** Alias (User Manual Name) for CAN1_MO55_EDATA3.
* To use register names with standard convension, please use CAN1_MO55_EDATA3.
*/
#define	CAN1_EMO55DATA3	(CAN1_MO55_EDATA3)

/** \brief  16F0, Message Object  Data Register Low */
#define CAN1_MO55_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00296F0u)

/** Alias (User Manual Name) for CAN1_MO55_EDATA4.
* To use register names with standard convension, please use CAN1_MO55_EDATA4.
*/
#define	CAN1_EMO55DATA4	(CAN1_MO55_EDATA4)

/** \brief  16F4, Message Object  Data Register High */
#define CAN1_MO55_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00296F4u)

/** Alias (User Manual Name) for CAN1_MO55_EDATA5.
* To use register names with standard convension, please use CAN1_MO55_EDATA5.
*/
#define	CAN1_EMO55DATA5	(CAN1_MO55_EDATA5)

/** \brief  16F8, Message Object  Arbitration Register */
#define CAN1_MO55_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00296F8u)

/** Alias (User Manual Name) for CAN1_MO55_EDATA6.
* To use register names with standard convension, please use CAN1_MO55_EDATA6.
*/
#define	CAN1_EMO55DATA6	(CAN1_MO55_EDATA6)

/** \brief  16E0, Message Object  Function Control Register */
#define CAN1_MO55_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00296E0u)

/** Alias (User Manual Name) for CAN1_MO55_FCR.
* To use register names with standard convension, please use CAN1_MO55_FCR.
*/
#define	CAN1_MOFCR55	(CAN1_MO55_FCR)

/** \brief  16E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO55_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00296E4u)

/** Alias (User Manual Name) for CAN1_MO55_FGPR.
* To use register names with standard convension, please use CAN1_MO55_FGPR.
*/
#define	CAN1_MOFGPR55	(CAN1_MO55_FGPR)

