leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  16E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO55_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00296E8u)

/** Alias (User Manual Name) for CAN1_MO55_IPR.
* To use register names with standard convension, please use CAN1_MO55_IPR.
*/
#define	CAN1_MOIPR55	(CAN1_MO55_IPR)

/** \brief  16FC, Message Object  Control Register */
#define CAN1_MO55_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00296FCu)

/** Alias (User Manual Name) for CAN1_MO55_STAT.
* To use register names with standard convension, please use CAN1_MO55_STAT.
*/
#define	CAN1_MOSTAT55	(CAN1_MO55_STAT)

/** \brief  170C, Message Object  Acceptance Mask Register */
#define CAN1_MO56_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002970Cu)

/** Alias (User Manual Name) for CAN1_MO56_AMR.
* To use register names with standard convension, please use CAN1_MO56_AMR.
*/
#define	CAN1_MOAMR56	(CAN1_MO56_AMR)

/** \brief  1718, Message Object  Arbitration Register */
#define CAN1_MO56_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029718u)

/** Alias (User Manual Name) for CAN1_MO56_AR.
* To use register names with standard convension, please use CAN1_MO56_AR.
*/
#define	CAN1_MOAR56	(CAN1_MO56_AR)

/** \brief  171C, Message Object  Control Register */
#define CAN1_MO56_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002971Cu)

/** Alias (User Manual Name) for CAN1_MO56_CTR.
* To use register names with standard convension, please use CAN1_MO56_CTR.
*/
#define	CAN1_MOCTR56	(CAN1_MO56_CTR)

/** \brief  1714, Message Object  Data Register High */
#define CAN1_MO56_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029714u)

/** Alias (User Manual Name) for CAN1_MO56_DATAH.
* To use register names with standard convension, please use CAN1_MO56_DATAH.
*/
#define	CAN1_MODATAH56	(CAN1_MO56_DATAH)

/** \brief  1710, Message Object  Data Register Low */
#define CAN1_MO56_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029710u)

/** Alias (User Manual Name) for CAN1_MO56_DATAL.
* To use register names with standard convension, please use CAN1_MO56_DATAL.
*/
#define	CAN1_MODATAL56	(CAN1_MO56_DATAL)

/** \brief  1700, Message Object  Function Control Register */
#define CAN1_MO56_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029700u)

/** Alias (User Manual Name) for CAN1_MO56_EDATA0.
* To use register names with standard convension, please use CAN1_MO56_EDATA0.
*/
#define	CAN1_EMO56DATA0	(CAN1_MO56_EDATA0)

/** \brief  1704, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO56_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029704u)

/** Alias (User Manual Name) for CAN1_MO56_EDATA1.
* To use register names with standard convension, please use CAN1_MO56_EDATA1.
*/
#define	CAN1_EMO56DATA1	(CAN1_MO56_EDATA1)

/** \brief  1708, Message Object  Interrupt Pointer Register */
#define CAN1_MO56_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029708u)

/** Alias (User Manual Name) for CAN1_MO56_EDATA2.
* To use register names with standard convension, please use CAN1_MO56_EDATA2.
*/
#define	CAN1_EMO56DATA2	(CAN1_MO56_EDATA2)

/** \brief  170C, Message Object  Acceptance Mask Register */
#define CAN1_MO56_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002970Cu)

/** Alias (User Manual Name) for CAN1_MO56_EDATA3.
* To use register names with standard convension, please use CAN1_MO56_EDATA3.
*/
#define	CAN1_EMO56DATA3	(CAN1_MO56_EDATA3)

/** \brief  1710, Message Object  Data Register Low */
#define CAN1_MO56_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029710u)

/** Alias (User Manual Name) for CAN1_MO56_EDATA4.
* To use register names with standard convension, please use CAN1_MO56_EDATA4.
*/
#define	CAN1_EMO56DATA4	(CAN1_MO56_EDATA4)

/** \brief  1714, Message Object  Data Register High */
#define CAN1_MO56_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029714u)

/** Alias (User Manual Name) for CAN1_MO56_EDATA5.
* To use register names with standard convension, please use CAN1_MO56_EDATA5.
*/
#define	CAN1_EMO56DATA5	(CAN1_MO56_EDATA5)

/** \brief  1718, Message Object  Arbitration Register */
#define CAN1_MO56_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029718u)

/** Alias (User Manual Name) for CAN1_MO56_EDATA6.
* To use register names with standard convension, please use CAN1_MO56_EDATA6.
*/
#define	CAN1_EMO56DATA6	(CAN1_MO56_EDATA6)

/** \brief  1700, Message Object  Function Control Register */
#define CAN1_MO56_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029700u)

/** Alias (User Manual Name) for CAN1_MO56_FCR.
* To use register names with standard convension, please use CAN1_MO56_FCR.
*/
#define	CAN1_MOFCR56	(CAN1_MO56_FCR)

/** \brief  1704, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO56_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029704u)

/** Alias (User Manual Name) for CAN1_MO56_FGPR.
* To use register names with standard convension, please use CAN1_MO56_FGPR.
*/
#define	CAN1_MOFGPR56	(CAN1_MO56_FGPR)

/** \brief  1708, Message Object  Interrupt Pointer Register */
#define CAN1_MO56_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029708u)

/** Alias (User Manual Name) for CAN1_MO56_IPR.
* To use register names with standard convension, please use CAN1_MO56_IPR.
*/
#define	CAN1_MOIPR56	(CAN1_MO56_IPR)

/** \brief  171C, Message Object  Control Register */
#define CAN1_MO56_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002971Cu)

/** Alias (User Manual Name) for CAN1_MO56_STAT.
* To use register names with standard convension, please use CAN1_MO56_STAT.
*/
#define	CAN1_MOSTAT56	(CAN1_MO56_STAT)

/** \brief  172C, Message Object  Acceptance Mask Register */
#define CAN1_MO57_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002972Cu)

/** Alias (User Manual Name) for CAN1_MO57_AMR.
* To use register names with standard convension, please use CAN1_MO57_AMR.
*/
#define	CAN1_MOAMR57	(CAN1_MO57_AMR)

/** \brief  1738, Message Object  Arbitration Register */
#define CAN1_MO57_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029738u)

