leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO57_AR.
* To use register names with standard convension, please use CAN1_MO57_AR.
*/
#define	CAN1_MOAR57	(CAN1_MO57_AR)

/** \brief  173C, Message Object  Control Register */
#define CAN1_MO57_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002973Cu)

/** Alias (User Manual Name) for CAN1_MO57_CTR.
* To use register names with standard convension, please use CAN1_MO57_CTR.
*/
#define	CAN1_MOCTR57	(CAN1_MO57_CTR)

/** \brief  1734, Message Object  Data Register High */
#define CAN1_MO57_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029734u)

/** Alias (User Manual Name) for CAN1_MO57_DATAH.
* To use register names with standard convension, please use CAN1_MO57_DATAH.
*/
#define	CAN1_MODATAH57	(CAN1_MO57_DATAH)

/** \brief  1730, Message Object  Data Register Low */
#define CAN1_MO57_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029730u)

/** Alias (User Manual Name) for CAN1_MO57_DATAL.
* To use register names with standard convension, please use CAN1_MO57_DATAL.
*/
#define	CAN1_MODATAL57	(CAN1_MO57_DATAL)

/** \brief  1720, Message Object  Function Control Register */
#define CAN1_MO57_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029720u)

/** Alias (User Manual Name) for CAN1_MO57_EDATA0.
* To use register names with standard convension, please use CAN1_MO57_EDATA0.
*/
#define	CAN1_EMO57DATA0	(CAN1_MO57_EDATA0)

/** \brief  1724, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO57_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029724u)

/** Alias (User Manual Name) for CAN1_MO57_EDATA1.
* To use register names with standard convension, please use CAN1_MO57_EDATA1.
*/
#define	CAN1_EMO57DATA1	(CAN1_MO57_EDATA1)

/** \brief  1728, Message Object  Interrupt Pointer Register */
#define CAN1_MO57_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029728u)

/** Alias (User Manual Name) for CAN1_MO57_EDATA2.
* To use register names with standard convension, please use CAN1_MO57_EDATA2.
*/
#define	CAN1_EMO57DATA2	(CAN1_MO57_EDATA2)

/** \brief  172C, Message Object  Acceptance Mask Register */
#define CAN1_MO57_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002972Cu)

/** Alias (User Manual Name) for CAN1_MO57_EDATA3.
* To use register names with standard convension, please use CAN1_MO57_EDATA3.
*/
#define	CAN1_EMO57DATA3	(CAN1_MO57_EDATA3)

/** \brief  1730, Message Object  Data Register Low */
#define CAN1_MO57_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029730u)

/** Alias (User Manual Name) for CAN1_MO57_EDATA4.
* To use register names with standard convension, please use CAN1_MO57_EDATA4.
*/
#define	CAN1_EMO57DATA4	(CAN1_MO57_EDATA4)

/** \brief  1734, Message Object  Data Register High */
#define CAN1_MO57_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029734u)

/** Alias (User Manual Name) for CAN1_MO57_EDATA5.
* To use register names with standard convension, please use CAN1_MO57_EDATA5.
*/
#define	CAN1_EMO57DATA5	(CAN1_MO57_EDATA5)

/** \brief  1738, Message Object  Arbitration Register */
#define CAN1_MO57_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029738u)

/** Alias (User Manual Name) for CAN1_MO57_EDATA6.
* To use register names with standard convension, please use CAN1_MO57_EDATA6.
*/
#define	CAN1_EMO57DATA6	(CAN1_MO57_EDATA6)

/** \brief  1720, Message Object  Function Control Register */
#define CAN1_MO57_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029720u)

/** Alias (User Manual Name) for CAN1_MO57_FCR.
* To use register names with standard convension, please use CAN1_MO57_FCR.
*/
#define	CAN1_MOFCR57	(CAN1_MO57_FCR)

/** \brief  1724, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO57_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029724u)

/** Alias (User Manual Name) for CAN1_MO57_FGPR.
* To use register names with standard convension, please use CAN1_MO57_FGPR.
*/
#define	CAN1_MOFGPR57	(CAN1_MO57_FGPR)

/** \brief  1728, Message Object  Interrupt Pointer Register */
#define CAN1_MO57_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029728u)

/** Alias (User Manual Name) for CAN1_MO57_IPR.
* To use register names with standard convension, please use CAN1_MO57_IPR.
*/
#define	CAN1_MOIPR57	(CAN1_MO57_IPR)

/** \brief  173C, Message Object  Control Register */
#define CAN1_MO57_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002973Cu)

/** Alias (User Manual Name) for CAN1_MO57_STAT.
* To use register names with standard convension, please use CAN1_MO57_STAT.
*/
#define	CAN1_MOSTAT57	(CAN1_MO57_STAT)

/** \brief  174C, Message Object  Acceptance Mask Register */
#define CAN1_MO58_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002974Cu)

/** Alias (User Manual Name) for CAN1_MO58_AMR.
* To use register names with standard convension, please use CAN1_MO58_AMR.
*/
#define	CAN1_MOAMR58	(CAN1_MO58_AMR)

/** \brief  1758, Message Object  Arbitration Register */
#define CAN1_MO58_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029758u)

/** Alias (User Manual Name) for CAN1_MO58_AR.
* To use register names with standard convension, please use CAN1_MO58_AR.
*/
#define	CAN1_MOAR58	(CAN1_MO58_AR)

/** \brief  175C, Message Object  Control Register */
#define CAN1_MO58_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002975Cu)

/** Alias (User Manual Name) for CAN1_MO58_CTR.
* To use register names with standard convension, please use CAN1_MO58_CTR.
*/
#define	CAN1_MOCTR58	(CAN1_MO58_CTR)

/** \brief  1754, Message Object  Data Register High */
#define CAN1_MO58_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029754u)

/** Alias (User Manual Name) for CAN1_MO58_DATAH.
* To use register names with standard convension, please use CAN1_MO58_DATAH.
*/
#define	CAN1_MODATAH58	(CAN1_MO58_DATAH)

/** \brief  1750, Message Object  Data Register Low */
#define CAN1_MO58_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029750u)

/** Alias (User Manual Name) for CAN1_MO58_DATAL.
* To use register names with standard convension, please use CAN1_MO58_DATAL.
*/
#define	CAN1_MODATAL58	(CAN1_MO58_DATAL)

/** \brief  1740, Message Object  Function Control Register */
#define CAN1_MO58_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029740u)

