leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO59_EDATA3.
* To use register names with standard convension, please use CAN1_MO59_EDATA3.
*/
#define	CAN1_EMO59DATA3	(CAN1_MO59_EDATA3)

/** \brief  1770, Message Object  Data Register Low */
#define CAN1_MO59_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029770u)

/** Alias (User Manual Name) for CAN1_MO59_EDATA4.
* To use register names with standard convension, please use CAN1_MO59_EDATA4.
*/
#define	CAN1_EMO59DATA4	(CAN1_MO59_EDATA4)

/** \brief  1774, Message Object  Data Register High */
#define CAN1_MO59_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029774u)

/** Alias (User Manual Name) for CAN1_MO59_EDATA5.
* To use register names with standard convension, please use CAN1_MO59_EDATA5.
*/
#define	CAN1_EMO59DATA5	(CAN1_MO59_EDATA5)

/** \brief  1778, Message Object  Arbitration Register */
#define CAN1_MO59_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029778u)

/** Alias (User Manual Name) for CAN1_MO59_EDATA6.
* To use register names with standard convension, please use CAN1_MO59_EDATA6.
*/
#define	CAN1_EMO59DATA6	(CAN1_MO59_EDATA6)

/** \brief  1760, Message Object  Function Control Register */
#define CAN1_MO59_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029760u)

/** Alias (User Manual Name) for CAN1_MO59_FCR.
* To use register names with standard convension, please use CAN1_MO59_FCR.
*/
#define	CAN1_MOFCR59	(CAN1_MO59_FCR)

/** \brief  1764, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO59_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029764u)

/** Alias (User Manual Name) for CAN1_MO59_FGPR.
* To use register names with standard convension, please use CAN1_MO59_FGPR.
*/
#define	CAN1_MOFGPR59	(CAN1_MO59_FGPR)

/** \brief  1768, Message Object  Interrupt Pointer Register */
#define CAN1_MO59_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029768u)

/** Alias (User Manual Name) for CAN1_MO59_IPR.
* To use register names with standard convension, please use CAN1_MO59_IPR.
*/
#define	CAN1_MOIPR59	(CAN1_MO59_IPR)

/** \brief  177C, Message Object  Control Register */
#define CAN1_MO59_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002977Cu)

/** Alias (User Manual Name) for CAN1_MO59_STAT.
* To use register names with standard convension, please use CAN1_MO59_STAT.
*/
#define	CAN1_MOSTAT59	(CAN1_MO59_STAT)

/** \brief  10AC, Message Object  Acceptance Mask Register */
#define CAN1_MO5_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00290ACu)

/** Alias (User Manual Name) for CAN1_MO5_AMR.
* To use register names with standard convension, please use CAN1_MO5_AMR.
*/
#define	CAN1_MOAMR5	(CAN1_MO5_AMR)

/** \brief  10B8, Message Object  Arbitration Register */
#define CAN1_MO5_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00290B8u)

/** Alias (User Manual Name) for CAN1_MO5_AR.
* To use register names with standard convension, please use CAN1_MO5_AR.
*/
#define	CAN1_MOAR5	(CAN1_MO5_AR)

/** \brief  10BC, Message Object  Control Register */
#define CAN1_MO5_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00290BCu)

/** Alias (User Manual Name) for CAN1_MO5_CTR.
* To use register names with standard convension, please use CAN1_MO5_CTR.
*/
#define	CAN1_MOCTR5	(CAN1_MO5_CTR)

/** \brief  10B4, Message Object  Data Register High */
#define CAN1_MO5_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00290B4u)

/** Alias (User Manual Name) for CAN1_MO5_DATAH.
* To use register names with standard convension, please use CAN1_MO5_DATAH.
*/
#define	CAN1_MODATAH5	(CAN1_MO5_DATAH)

/** \brief  10B0, Message Object  Data Register Low */
#define CAN1_MO5_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00290B0u)

/** Alias (User Manual Name) for CAN1_MO5_DATAL.
* To use register names with standard convension, please use CAN1_MO5_DATAL.
*/
#define	CAN1_MODATAL5	(CAN1_MO5_DATAL)

/** \brief  10A0, Message Object  Function Control Register */
#define CAN1_MO5_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00290A0u)

/** Alias (User Manual Name) for CAN1_MO5_EDATA0.
* To use register names with standard convension, please use CAN1_MO5_EDATA0.
*/
#define	CAN1_EMO5DATA0	(CAN1_MO5_EDATA0)

/** \brief  10A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO5_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00290A4u)

/** Alias (User Manual Name) for CAN1_MO5_EDATA1.
* To use register names with standard convension, please use CAN1_MO5_EDATA1.
*/
#define	CAN1_EMO5DATA1	(CAN1_MO5_EDATA1)

/** \brief  10A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO5_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00290A8u)

/** Alias (User Manual Name) for CAN1_MO5_EDATA2.
* To use register names with standard convension, please use CAN1_MO5_EDATA2.
*/
#define	CAN1_EMO5DATA2	(CAN1_MO5_EDATA2)

/** \brief  10AC, Message Object  Acceptance Mask Register */
#define CAN1_MO5_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00290ACu)

/** Alias (User Manual Name) for CAN1_MO5_EDATA3.
* To use register names with standard convension, please use CAN1_MO5_EDATA3.
*/
#define	CAN1_EMO5DATA3	(CAN1_MO5_EDATA3)

/** \brief  10B0, Message Object  Data Register Low */
#define CAN1_MO5_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00290B0u)

/** Alias (User Manual Name) for CAN1_MO5_EDATA4.
* To use register names with standard convension, please use CAN1_MO5_EDATA4.
*/
#define	CAN1_EMO5DATA4	(CAN1_MO5_EDATA4)

/** \brief  10B4, Message Object  Data Register High */
#define CAN1_MO5_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00290B4u)

/** Alias (User Manual Name) for CAN1_MO5_EDATA5.
* To use register names with standard convension, please use CAN1_MO5_EDATA5.
*/
#define	CAN1_EMO5DATA5	(CAN1_MO5_EDATA5)

/** \brief  10B8, Message Object  Arbitration Register */
#define CAN1_MO5_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00290B8u)

/** Alias (User Manual Name) for CAN1_MO5_EDATA6.
* To use register names with standard convension, please use CAN1_MO5_EDATA6.
*/
#define	CAN1_EMO5DATA6	(CAN1_MO5_EDATA6)

/** \brief  10A0, Message Object  Function Control Register */
#define CAN1_MO5_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00290A0u)

/** Alias (User Manual Name) for CAN1_MO5_FCR.
* To use register names with standard convension, please use CAN1_MO5_FCR.
*/
#define	CAN1_MOFCR5	(CAN1_MO5_FCR)

/** \brief  10A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO5_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00290A4u)

