leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO5_FGPR.
* To use register names with standard convension, please use CAN1_MO5_FGPR.
*/
#define	CAN1_MOFGPR5	(CAN1_MO5_FGPR)

/** \brief  10A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO5_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00290A8u)

/** Alias (User Manual Name) for CAN1_MO5_IPR.
* To use register names with standard convension, please use CAN1_MO5_IPR.
*/
#define	CAN1_MOIPR5	(CAN1_MO5_IPR)

/** \brief  10BC, Message Object  Control Register */
#define CAN1_MO5_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00290BCu)

/** Alias (User Manual Name) for CAN1_MO5_STAT.
* To use register names with standard convension, please use CAN1_MO5_STAT.
*/
#define	CAN1_MOSTAT5	(CAN1_MO5_STAT)

/** \brief  178C, Message Object  Acceptance Mask Register */
#define CAN1_MO60_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002978Cu)

/** Alias (User Manual Name) for CAN1_MO60_AMR.
* To use register names with standard convension, please use CAN1_MO60_AMR.
*/
#define	CAN1_MOAMR60	(CAN1_MO60_AMR)

/** \brief  1798, Message Object  Arbitration Register */
#define CAN1_MO60_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029798u)

/** Alias (User Manual Name) for CAN1_MO60_AR.
* To use register names with standard convension, please use CAN1_MO60_AR.
*/
#define	CAN1_MOAR60	(CAN1_MO60_AR)

/** \brief  179C, Message Object  Control Register */
#define CAN1_MO60_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002979Cu)

/** Alias (User Manual Name) for CAN1_MO60_CTR.
* To use register names with standard convension, please use CAN1_MO60_CTR.
*/
#define	CAN1_MOCTR60	(CAN1_MO60_CTR)

/** \brief  1794, Message Object  Data Register High */
#define CAN1_MO60_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029794u)

/** Alias (User Manual Name) for CAN1_MO60_DATAH.
* To use register names with standard convension, please use CAN1_MO60_DATAH.
*/
#define	CAN1_MODATAH60	(CAN1_MO60_DATAH)

/** \brief  1790, Message Object  Data Register Low */
#define CAN1_MO60_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029790u)

/** Alias (User Manual Name) for CAN1_MO60_DATAL.
* To use register names with standard convension, please use CAN1_MO60_DATAL.
*/
#define	CAN1_MODATAL60	(CAN1_MO60_DATAL)

/** \brief  1780, Message Object  Function Control Register */
#define CAN1_MO60_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029780u)

/** Alias (User Manual Name) for CAN1_MO60_EDATA0.
* To use register names with standard convension, please use CAN1_MO60_EDATA0.
*/
#define	CAN1_EMO60DATA0	(CAN1_MO60_EDATA0)

/** \brief  1784, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO60_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029784u)

/** Alias (User Manual Name) for CAN1_MO60_EDATA1.
* To use register names with standard convension, please use CAN1_MO60_EDATA1.
*/
#define	CAN1_EMO60DATA1	(CAN1_MO60_EDATA1)

/** \brief  1788, Message Object  Interrupt Pointer Register */
#define CAN1_MO60_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029788u)

/** Alias (User Manual Name) for CAN1_MO60_EDATA2.
* To use register names with standard convension, please use CAN1_MO60_EDATA2.
*/
#define	CAN1_EMO60DATA2	(CAN1_MO60_EDATA2)

/** \brief  178C, Message Object  Acceptance Mask Register */
#define CAN1_MO60_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002978Cu)

/** Alias (User Manual Name) for CAN1_MO60_EDATA3.
* To use register names with standard convension, please use CAN1_MO60_EDATA3.
*/
#define	CAN1_EMO60DATA3	(CAN1_MO60_EDATA3)

/** \brief  1790, Message Object  Data Register Low */
#define CAN1_MO60_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029790u)

/** Alias (User Manual Name) for CAN1_MO60_EDATA4.
* To use register names with standard convension, please use CAN1_MO60_EDATA4.
*/
#define	CAN1_EMO60DATA4	(CAN1_MO60_EDATA4)

/** \brief  1794, Message Object  Data Register High */
#define CAN1_MO60_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029794u)

/** Alias (User Manual Name) for CAN1_MO60_EDATA5.
* To use register names with standard convension, please use CAN1_MO60_EDATA5.
*/
#define	CAN1_EMO60DATA5	(CAN1_MO60_EDATA5)

/** \brief  1798, Message Object  Arbitration Register */
#define CAN1_MO60_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029798u)

/** Alias (User Manual Name) for CAN1_MO60_EDATA6.
* To use register names with standard convension, please use CAN1_MO60_EDATA6.
*/
#define	CAN1_EMO60DATA6	(CAN1_MO60_EDATA6)

/** \brief  1780, Message Object  Function Control Register */
#define CAN1_MO60_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029780u)

/** Alias (User Manual Name) for CAN1_MO60_FCR.
* To use register names with standard convension, please use CAN1_MO60_FCR.
*/
#define	CAN1_MOFCR60	(CAN1_MO60_FCR)

/** \brief  1784, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO60_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029784u)

/** Alias (User Manual Name) for CAN1_MO60_FGPR.
* To use register names with standard convension, please use CAN1_MO60_FGPR.
*/
#define	CAN1_MOFGPR60	(CAN1_MO60_FGPR)

/** \brief  1788, Message Object  Interrupt Pointer Register */
#define CAN1_MO60_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029788u)

/** Alias (User Manual Name) for CAN1_MO60_IPR.
* To use register names with standard convension, please use CAN1_MO60_IPR.
*/
#define	CAN1_MOIPR60	(CAN1_MO60_IPR)

/** \brief  179C, Message Object  Control Register */
#define CAN1_MO60_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002979Cu)

/** Alias (User Manual Name) for CAN1_MO60_STAT.
* To use register names with standard convension, please use CAN1_MO60_STAT.
*/
#define	CAN1_MOSTAT60	(CAN1_MO60_STAT)

/** \brief  17AC, Message Object  Acceptance Mask Register */
#define CAN1_MO61_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00297ACu)

/** Alias (User Manual Name) for CAN1_MO61_AMR.
* To use register names with standard convension, please use CAN1_MO61_AMR.
*/
#define	CAN1_MOAMR61	(CAN1_MO61_AMR)

/** \brief  17B8, Message Object  Arbitration Register */
#define CAN1_MO61_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00297B8u)

/** Alias (User Manual Name) for CAN1_MO61_AR.
* To use register names with standard convension, please use CAN1_MO61_AR.
*/
#define	CAN1_MOAR61	(CAN1_MO61_AR)

