leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  17BC, Message Object  Control Register */
#define CAN1_MO61_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00297BCu)

/** Alias (User Manual Name) for CAN1_MO61_CTR.
* To use register names with standard convension, please use CAN1_MO61_CTR.
*/
#define	CAN1_MOCTR61	(CAN1_MO61_CTR)

/** \brief  17B4, Message Object  Data Register High */
#define CAN1_MO61_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00297B4u)

/** Alias (User Manual Name) for CAN1_MO61_DATAH.
* To use register names with standard convension, please use CAN1_MO61_DATAH.
*/
#define	CAN1_MODATAH61	(CAN1_MO61_DATAH)

/** \brief  17B0, Message Object  Data Register Low */
#define CAN1_MO61_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00297B0u)

/** Alias (User Manual Name) for CAN1_MO61_DATAL.
* To use register names with standard convension, please use CAN1_MO61_DATAL.
*/
#define	CAN1_MODATAL61	(CAN1_MO61_DATAL)

/** \brief  17A0, Message Object  Function Control Register */
#define CAN1_MO61_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00297A0u)

/** Alias (User Manual Name) for CAN1_MO61_EDATA0.
* To use register names with standard convension, please use CAN1_MO61_EDATA0.
*/
#define	CAN1_EMO61DATA0	(CAN1_MO61_EDATA0)

/** \brief  17A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO61_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00297A4u)

/** Alias (User Manual Name) for CAN1_MO61_EDATA1.
* To use register names with standard convension, please use CAN1_MO61_EDATA1.
*/
#define	CAN1_EMO61DATA1	(CAN1_MO61_EDATA1)

/** \brief  17A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO61_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00297A8u)

/** Alias (User Manual Name) for CAN1_MO61_EDATA2.
* To use register names with standard convension, please use CAN1_MO61_EDATA2.
*/
#define	CAN1_EMO61DATA2	(CAN1_MO61_EDATA2)

/** \brief  17AC, Message Object  Acceptance Mask Register */
#define CAN1_MO61_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00297ACu)

/** Alias (User Manual Name) for CAN1_MO61_EDATA3.
* To use register names with standard convension, please use CAN1_MO61_EDATA3.
*/
#define	CAN1_EMO61DATA3	(CAN1_MO61_EDATA3)

/** \brief  17B0, Message Object  Data Register Low */
#define CAN1_MO61_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00297B0u)

/** Alias (User Manual Name) for CAN1_MO61_EDATA4.
* To use register names with standard convension, please use CAN1_MO61_EDATA4.
*/
#define	CAN1_EMO61DATA4	(CAN1_MO61_EDATA4)

/** \brief  17B4, Message Object  Data Register High */
#define CAN1_MO61_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00297B4u)

/** Alias (User Manual Name) for CAN1_MO61_EDATA5.
* To use register names with standard convension, please use CAN1_MO61_EDATA5.
*/
#define	CAN1_EMO61DATA5	(CAN1_MO61_EDATA5)

/** \brief  17B8, Message Object  Arbitration Register */
#define CAN1_MO61_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00297B8u)

/** Alias (User Manual Name) for CAN1_MO61_EDATA6.
* To use register names with standard convension, please use CAN1_MO61_EDATA6.
*/
#define	CAN1_EMO61DATA6	(CAN1_MO61_EDATA6)

/** \brief  17A0, Message Object  Function Control Register */
#define CAN1_MO61_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00297A0u)

/** Alias (User Manual Name) for CAN1_MO61_FCR.
* To use register names with standard convension, please use CAN1_MO61_FCR.
*/
#define	CAN1_MOFCR61	(CAN1_MO61_FCR)

/** \brief  17A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO61_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00297A4u)

/** Alias (User Manual Name) for CAN1_MO61_FGPR.
* To use register names with standard convension, please use CAN1_MO61_FGPR.
*/
#define	CAN1_MOFGPR61	(CAN1_MO61_FGPR)

/** \brief  17A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO61_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00297A8u)

/** Alias (User Manual Name) for CAN1_MO61_IPR.
* To use register names with standard convension, please use CAN1_MO61_IPR.
*/
#define	CAN1_MOIPR61	(CAN1_MO61_IPR)

/** \brief  17BC, Message Object  Control Register */
#define CAN1_MO61_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00297BCu)

/** Alias (User Manual Name) for CAN1_MO61_STAT.
* To use register names with standard convension, please use CAN1_MO61_STAT.
*/
#define	CAN1_MOSTAT61	(CAN1_MO61_STAT)

/** \brief  17CC, Message Object  Acceptance Mask Register */
#define CAN1_MO62_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00297CCu)

/** Alias (User Manual Name) for CAN1_MO62_AMR.
* To use register names with standard convension, please use CAN1_MO62_AMR.
*/
#define	CAN1_MOAMR62	(CAN1_MO62_AMR)

/** \brief  17D8, Message Object  Arbitration Register */
#define CAN1_MO62_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00297D8u)

/** Alias (User Manual Name) for CAN1_MO62_AR.
* To use register names with standard convension, please use CAN1_MO62_AR.
*/
#define	CAN1_MOAR62	(CAN1_MO62_AR)

/** \brief  17DC, Message Object  Control Register */
#define CAN1_MO62_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00297DCu)

/** Alias (User Manual Name) for CAN1_MO62_CTR.
* To use register names with standard convension, please use CAN1_MO62_CTR.
*/
#define	CAN1_MOCTR62	(CAN1_MO62_CTR)

/** \brief  17D4, Message Object  Data Register High */
#define CAN1_MO62_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00297D4u)

/** Alias (User Manual Name) for CAN1_MO62_DATAH.
* To use register names with standard convension, please use CAN1_MO62_DATAH.
*/
#define	CAN1_MODATAH62	(CAN1_MO62_DATAH)

/** \brief  17D0, Message Object  Data Register Low */
#define CAN1_MO62_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00297D0u)

/** Alias (User Manual Name) for CAN1_MO62_DATAL.
* To use register names with standard convension, please use CAN1_MO62_DATAL.
*/
#define	CAN1_MODATAL62	(CAN1_MO62_DATAL)

/** \brief  17C0, Message Object  Function Control Register */
#define CAN1_MO62_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00297C0u)

/** Alias (User Manual Name) for CAN1_MO62_EDATA0.
* To use register names with standard convension, please use CAN1_MO62_EDATA0.
*/
#define	CAN1_EMO62DATA0	(CAN1_MO62_EDATA0)

/** \brief  17C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO62_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00297C4u)

