leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO62_EDATA1.
* To use register names with standard convension, please use CAN1_MO62_EDATA1.
*/
#define	CAN1_EMO62DATA1	(CAN1_MO62_EDATA1)

/** \brief  17C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO62_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00297C8u)

/** Alias (User Manual Name) for CAN1_MO62_EDATA2.
* To use register names with standard convension, please use CAN1_MO62_EDATA2.
*/
#define	CAN1_EMO62DATA2	(CAN1_MO62_EDATA2)

/** \brief  17CC, Message Object  Acceptance Mask Register */
#define CAN1_MO62_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00297CCu)

/** Alias (User Manual Name) for CAN1_MO62_EDATA3.
* To use register names with standard convension, please use CAN1_MO62_EDATA3.
*/
#define	CAN1_EMO62DATA3	(CAN1_MO62_EDATA3)

/** \brief  17D0, Message Object  Data Register Low */
#define CAN1_MO62_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00297D0u)

/** Alias (User Manual Name) for CAN1_MO62_EDATA4.
* To use register names with standard convension, please use CAN1_MO62_EDATA4.
*/
#define	CAN1_EMO62DATA4	(CAN1_MO62_EDATA4)

/** \brief  17D4, Message Object  Data Register High */
#define CAN1_MO62_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00297D4u)

/** Alias (User Manual Name) for CAN1_MO62_EDATA5.
* To use register names with standard convension, please use CAN1_MO62_EDATA5.
*/
#define	CAN1_EMO62DATA5	(CAN1_MO62_EDATA5)

/** \brief  17D8, Message Object  Arbitration Register */
#define CAN1_MO62_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00297D8u)

/** Alias (User Manual Name) for CAN1_MO62_EDATA6.
* To use register names with standard convension, please use CAN1_MO62_EDATA6.
*/
#define	CAN1_EMO62DATA6	(CAN1_MO62_EDATA6)

/** \brief  17C0, Message Object  Function Control Register */
#define CAN1_MO62_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00297C0u)

/** Alias (User Manual Name) for CAN1_MO62_FCR.
* To use register names with standard convension, please use CAN1_MO62_FCR.
*/
#define	CAN1_MOFCR62	(CAN1_MO62_FCR)

/** \brief  17C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO62_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00297C4u)

/** Alias (User Manual Name) for CAN1_MO62_FGPR.
* To use register names with standard convension, please use CAN1_MO62_FGPR.
*/
#define	CAN1_MOFGPR62	(CAN1_MO62_FGPR)

/** \brief  17C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO62_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00297C8u)

/** Alias (User Manual Name) for CAN1_MO62_IPR.
* To use register names with standard convension, please use CAN1_MO62_IPR.
*/
#define	CAN1_MOIPR62	(CAN1_MO62_IPR)

/** \brief  17DC, Message Object  Control Register */
#define CAN1_MO62_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00297DCu)

/** Alias (User Manual Name) for CAN1_MO62_STAT.
* To use register names with standard convension, please use CAN1_MO62_STAT.
*/
#define	CAN1_MOSTAT62	(CAN1_MO62_STAT)

/** \brief  17EC, Message Object  Acceptance Mask Register */
#define CAN1_MO63_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00297ECu)

/** Alias (User Manual Name) for CAN1_MO63_AMR.
* To use register names with standard convension, please use CAN1_MO63_AMR.
*/
#define	CAN1_MOAMR63	(CAN1_MO63_AMR)

/** \brief  17F8, Message Object  Arbitration Register */
#define CAN1_MO63_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00297F8u)

/** Alias (User Manual Name) for CAN1_MO63_AR.
* To use register names with standard convension, please use CAN1_MO63_AR.
*/
#define	CAN1_MOAR63	(CAN1_MO63_AR)

/** \brief  17FC, Message Object  Control Register */
#define CAN1_MO63_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00297FCu)

/** Alias (User Manual Name) for CAN1_MO63_CTR.
* To use register names with standard convension, please use CAN1_MO63_CTR.
*/
#define	CAN1_MOCTR63	(CAN1_MO63_CTR)

/** \brief  17F4, Message Object  Data Register High */
#define CAN1_MO63_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00297F4u)

/** Alias (User Manual Name) for CAN1_MO63_DATAH.
* To use register names with standard convension, please use CAN1_MO63_DATAH.
*/
#define	CAN1_MODATAH63	(CAN1_MO63_DATAH)

/** \brief  17F0, Message Object  Data Register Low */
#define CAN1_MO63_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00297F0u)

/** Alias (User Manual Name) for CAN1_MO63_DATAL.
* To use register names with standard convension, please use CAN1_MO63_DATAL.
*/
#define	CAN1_MODATAL63	(CAN1_MO63_DATAL)

/** \brief  17E0, Message Object  Function Control Register */
#define CAN1_MO63_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00297E0u)

/** Alias (User Manual Name) for CAN1_MO63_EDATA0.
* To use register names with standard convension, please use CAN1_MO63_EDATA0.
*/
#define	CAN1_EMO63DATA0	(CAN1_MO63_EDATA0)

/** \brief  17E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO63_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00297E4u)

/** Alias (User Manual Name) for CAN1_MO63_EDATA1.
* To use register names with standard convension, please use CAN1_MO63_EDATA1.
*/
#define	CAN1_EMO63DATA1	(CAN1_MO63_EDATA1)

/** \brief  17E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO63_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00297E8u)

/** Alias (User Manual Name) for CAN1_MO63_EDATA2.
* To use register names with standard convension, please use CAN1_MO63_EDATA2.
*/
#define	CAN1_EMO63DATA2	(CAN1_MO63_EDATA2)

/** \brief  17EC, Message Object  Acceptance Mask Register */
#define CAN1_MO63_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00297ECu)

/** Alias (User Manual Name) for CAN1_MO63_EDATA3.
* To use register names with standard convension, please use CAN1_MO63_EDATA3.
*/
#define	CAN1_EMO63DATA3	(CAN1_MO63_EDATA3)

/** \brief  17F0, Message Object  Data Register Low */
#define CAN1_MO63_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00297F0u)

/** Alias (User Manual Name) for CAN1_MO63_EDATA4.
* To use register names with standard convension, please use CAN1_MO63_EDATA4.
*/
#define	CAN1_EMO63DATA4	(CAN1_MO63_EDATA4)

