leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  17F4, Message Object  Data Register High */
#define CAN1_MO63_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00297F4u)

/** Alias (User Manual Name) for CAN1_MO63_EDATA5.
* To use register names with standard convension, please use CAN1_MO63_EDATA5.
*/
#define	CAN1_EMO63DATA5	(CAN1_MO63_EDATA5)

/** \brief  17F8, Message Object  Arbitration Register */
#define CAN1_MO63_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00297F8u)

/** Alias (User Manual Name) for CAN1_MO63_EDATA6.
* To use register names with standard convension, please use CAN1_MO63_EDATA6.
*/
#define	CAN1_EMO63DATA6	(CAN1_MO63_EDATA6)

/** \brief  17E0, Message Object  Function Control Register */
#define CAN1_MO63_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00297E0u)

/** Alias (User Manual Name) for CAN1_MO63_FCR.
* To use register names with standard convension, please use CAN1_MO63_FCR.
*/
#define	CAN1_MOFCR63	(CAN1_MO63_FCR)

/** \brief  17E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO63_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00297E4u)

/** Alias (User Manual Name) for CAN1_MO63_FGPR.
* To use register names with standard convension, please use CAN1_MO63_FGPR.
*/
#define	CAN1_MOFGPR63	(CAN1_MO63_FGPR)

/** \brief  17E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO63_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00297E8u)

/** Alias (User Manual Name) for CAN1_MO63_IPR.
* To use register names with standard convension, please use CAN1_MO63_IPR.
*/
#define	CAN1_MOIPR63	(CAN1_MO63_IPR)

/** \brief  17FC, Message Object  Control Register */
#define CAN1_MO63_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00297FCu)

/** Alias (User Manual Name) for CAN1_MO63_STAT.
* To use register names with standard convension, please use CAN1_MO63_STAT.
*/
#define	CAN1_MOSTAT63	(CAN1_MO63_STAT)

/** \brief  180C, Message Object  Acceptance Mask Register */
#define CAN1_MO64_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002980Cu)

/** Alias (User Manual Name) for CAN1_MO64_AMR.
* To use register names with standard convension, please use CAN1_MO64_AMR.
*/
#define	CAN1_MOAMR64	(CAN1_MO64_AMR)

/** \brief  1818, Message Object  Arbitration Register */
#define CAN1_MO64_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029818u)

/** Alias (User Manual Name) for CAN1_MO64_AR.
* To use register names with standard convension, please use CAN1_MO64_AR.
*/
#define	CAN1_MOAR64	(CAN1_MO64_AR)

/** \brief  181C, Message Object  Control Register */
#define CAN1_MO64_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002981Cu)

/** Alias (User Manual Name) for CAN1_MO64_CTR.
* To use register names with standard convension, please use CAN1_MO64_CTR.
*/
#define	CAN1_MOCTR64	(CAN1_MO64_CTR)

/** \brief  1814, Message Object  Data Register High */
#define CAN1_MO64_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029814u)

/** Alias (User Manual Name) for CAN1_MO64_DATAH.
* To use register names with standard convension, please use CAN1_MO64_DATAH.
*/
#define	CAN1_MODATAH64	(CAN1_MO64_DATAH)

/** \brief  1810, Message Object  Data Register Low */
#define CAN1_MO64_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029810u)

/** Alias (User Manual Name) for CAN1_MO64_DATAL.
* To use register names with standard convension, please use CAN1_MO64_DATAL.
*/
#define	CAN1_MODATAL64	(CAN1_MO64_DATAL)

/** \brief  1800, Message Object  Function Control Register */
#define CAN1_MO64_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029800u)

/** Alias (User Manual Name) for CAN1_MO64_EDATA0.
* To use register names with standard convension, please use CAN1_MO64_EDATA0.
*/
#define	CAN1_EMO64DATA0	(CAN1_MO64_EDATA0)

/** \brief  1804, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO64_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029804u)

/** Alias (User Manual Name) for CAN1_MO64_EDATA1.
* To use register names with standard convension, please use CAN1_MO64_EDATA1.
*/
#define	CAN1_EMO64DATA1	(CAN1_MO64_EDATA1)

/** \brief  1808, Message Object  Interrupt Pointer Register */
#define CAN1_MO64_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029808u)

/** Alias (User Manual Name) for CAN1_MO64_EDATA2.
* To use register names with standard convension, please use CAN1_MO64_EDATA2.
*/
#define	CAN1_EMO64DATA2	(CAN1_MO64_EDATA2)

/** \brief  180C, Message Object  Acceptance Mask Register */
#define CAN1_MO64_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002980Cu)

/** Alias (User Manual Name) for CAN1_MO64_EDATA3.
* To use register names with standard convension, please use CAN1_MO64_EDATA3.
*/
#define	CAN1_EMO64DATA3	(CAN1_MO64_EDATA3)

/** \brief  1810, Message Object  Data Register Low */
#define CAN1_MO64_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029810u)

/** Alias (User Manual Name) for CAN1_MO64_EDATA4.
* To use register names with standard convension, please use CAN1_MO64_EDATA4.
*/
#define	CAN1_EMO64DATA4	(CAN1_MO64_EDATA4)

/** \brief  1814, Message Object  Data Register High */
#define CAN1_MO64_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029814u)

/** Alias (User Manual Name) for CAN1_MO64_EDATA5.
* To use register names with standard convension, please use CAN1_MO64_EDATA5.
*/
#define	CAN1_EMO64DATA5	(CAN1_MO64_EDATA5)

/** \brief  1818, Message Object  Arbitration Register */
#define CAN1_MO64_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029818u)

/** Alias (User Manual Name) for CAN1_MO64_EDATA6.
* To use register names with standard convension, please use CAN1_MO64_EDATA6.
*/
#define	CAN1_EMO64DATA6	(CAN1_MO64_EDATA6)

/** \brief  1800, Message Object  Function Control Register */
#define CAN1_MO64_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029800u)

/** Alias (User Manual Name) for CAN1_MO64_FCR.
* To use register names with standard convension, please use CAN1_MO64_FCR.
*/
#define	CAN1_MOFCR64	(CAN1_MO64_FCR)

/** \brief  1804, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO64_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029804u)

/** Alias (User Manual Name) for CAN1_MO64_FGPR.
* To use register names with standard convension, please use CAN1_MO64_FGPR.
*/
#define	CAN1_MOFGPR64	(CAN1_MO64_FGPR)

/** \brief  1808, Message Object  Interrupt Pointer Register */
#define CAN1_MO64_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029808u)

