leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO64_IPR.
* To use register names with standard convension, please use CAN1_MO64_IPR.
*/
#define	CAN1_MOIPR64	(CAN1_MO64_IPR)

/** \brief  181C, Message Object  Control Register */
#define CAN1_MO64_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002981Cu)

/** Alias (User Manual Name) for CAN1_MO64_STAT.
* To use register names with standard convension, please use CAN1_MO64_STAT.
*/
#define	CAN1_MOSTAT64	(CAN1_MO64_STAT)

/** \brief  182C, Message Object  Acceptance Mask Register */
#define CAN1_MO65_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002982Cu)

/** Alias (User Manual Name) for CAN1_MO65_AMR.
* To use register names with standard convension, please use CAN1_MO65_AMR.
*/
#define	CAN1_MOAMR65	(CAN1_MO65_AMR)

/** \brief  1838, Message Object  Arbitration Register */
#define CAN1_MO65_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029838u)

/** Alias (User Manual Name) for CAN1_MO65_AR.
* To use register names with standard convension, please use CAN1_MO65_AR.
*/
#define	CAN1_MOAR65	(CAN1_MO65_AR)

/** \brief  183C, Message Object  Control Register */
#define CAN1_MO65_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002983Cu)

/** Alias (User Manual Name) for CAN1_MO65_CTR.
* To use register names with standard convension, please use CAN1_MO65_CTR.
*/
#define	CAN1_MOCTR65	(CAN1_MO65_CTR)

/** \brief  1834, Message Object  Data Register High */
#define CAN1_MO65_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029834u)

/** Alias (User Manual Name) for CAN1_MO65_DATAH.
* To use register names with standard convension, please use CAN1_MO65_DATAH.
*/
#define	CAN1_MODATAH65	(CAN1_MO65_DATAH)

/** \brief  1830, Message Object  Data Register Low */
#define CAN1_MO65_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029830u)

/** Alias (User Manual Name) for CAN1_MO65_DATAL.
* To use register names with standard convension, please use CAN1_MO65_DATAL.
*/
#define	CAN1_MODATAL65	(CAN1_MO65_DATAL)

/** \brief  1820, Message Object  Function Control Register */
#define CAN1_MO65_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029820u)

/** Alias (User Manual Name) for CAN1_MO65_EDATA0.
* To use register names with standard convension, please use CAN1_MO65_EDATA0.
*/
#define	CAN1_EMO65DATA0	(CAN1_MO65_EDATA0)

/** \brief  1824, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO65_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029824u)

/** Alias (User Manual Name) for CAN1_MO65_EDATA1.
* To use register names with standard convension, please use CAN1_MO65_EDATA1.
*/
#define	CAN1_EMO65DATA1	(CAN1_MO65_EDATA1)

/** \brief  1828, Message Object  Interrupt Pointer Register */
#define CAN1_MO65_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029828u)

/** Alias (User Manual Name) for CAN1_MO65_EDATA2.
* To use register names with standard convension, please use CAN1_MO65_EDATA2.
*/
#define	CAN1_EMO65DATA2	(CAN1_MO65_EDATA2)

/** \brief  182C, Message Object  Acceptance Mask Register */
#define CAN1_MO65_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002982Cu)

/** Alias (User Manual Name) for CAN1_MO65_EDATA3.
* To use register names with standard convension, please use CAN1_MO65_EDATA3.
*/
#define	CAN1_EMO65DATA3	(CAN1_MO65_EDATA3)

/** \brief  1830, Message Object  Data Register Low */
#define CAN1_MO65_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029830u)

/** Alias (User Manual Name) for CAN1_MO65_EDATA4.
* To use register names with standard convension, please use CAN1_MO65_EDATA4.
*/
#define	CAN1_EMO65DATA4	(CAN1_MO65_EDATA4)

/** \brief  1834, Message Object  Data Register High */
#define CAN1_MO65_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029834u)

/** Alias (User Manual Name) for CAN1_MO65_EDATA5.
* To use register names with standard convension, please use CAN1_MO65_EDATA5.
*/
#define	CAN1_EMO65DATA5	(CAN1_MO65_EDATA5)

/** \brief  1838, Message Object  Arbitration Register */
#define CAN1_MO65_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029838u)

/** Alias (User Manual Name) for CAN1_MO65_EDATA6.
* To use register names with standard convension, please use CAN1_MO65_EDATA6.
*/
#define	CAN1_EMO65DATA6	(CAN1_MO65_EDATA6)

/** \brief  1820, Message Object  Function Control Register */
#define CAN1_MO65_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029820u)

/** Alias (User Manual Name) for CAN1_MO65_FCR.
* To use register names with standard convension, please use CAN1_MO65_FCR.
*/
#define	CAN1_MOFCR65	(CAN1_MO65_FCR)

/** \brief  1824, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO65_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029824u)

/** Alias (User Manual Name) for CAN1_MO65_FGPR.
* To use register names with standard convension, please use CAN1_MO65_FGPR.
*/
#define	CAN1_MOFGPR65	(CAN1_MO65_FGPR)

/** \brief  1828, Message Object  Interrupt Pointer Register */
#define CAN1_MO65_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029828u)

/** Alias (User Manual Name) for CAN1_MO65_IPR.
* To use register names with standard convension, please use CAN1_MO65_IPR.
*/
#define	CAN1_MOIPR65	(CAN1_MO65_IPR)

/** \brief  183C, Message Object  Control Register */
#define CAN1_MO65_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002983Cu)

/** Alias (User Manual Name) for CAN1_MO65_STAT.
* To use register names with standard convension, please use CAN1_MO65_STAT.
*/
#define	CAN1_MOSTAT65	(CAN1_MO65_STAT)

/** \brief  184C, Message Object  Acceptance Mask Register */
#define CAN1_MO66_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002984Cu)

/** Alias (User Manual Name) for CAN1_MO66_AMR.
* To use register names with standard convension, please use CAN1_MO66_AMR.
*/
#define	CAN1_MOAMR66	(CAN1_MO66_AMR)

/** \brief  1858, Message Object  Arbitration Register */
#define CAN1_MO66_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029858u)

/** Alias (User Manual Name) for CAN1_MO66_AR.
* To use register names with standard convension, please use CAN1_MO66_AR.
*/
#define	CAN1_MOAR66	(CAN1_MO66_AR)

