leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  185C, Message Object  Control Register */
#define CAN1_MO66_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002985Cu)

/** Alias (User Manual Name) for CAN1_MO66_CTR.
* To use register names with standard convension, please use CAN1_MO66_CTR.
*/
#define	CAN1_MOCTR66	(CAN1_MO66_CTR)

/** \brief  1854, Message Object  Data Register High */
#define CAN1_MO66_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029854u)

/** Alias (User Manual Name) for CAN1_MO66_DATAH.
* To use register names with standard convension, please use CAN1_MO66_DATAH.
*/
#define	CAN1_MODATAH66	(CAN1_MO66_DATAH)

/** \brief  1850, Message Object  Data Register Low */
#define CAN1_MO66_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029850u)

/** Alias (User Manual Name) for CAN1_MO66_DATAL.
* To use register names with standard convension, please use CAN1_MO66_DATAL.
*/
#define	CAN1_MODATAL66	(CAN1_MO66_DATAL)

/** \brief  1840, Message Object  Function Control Register */
#define CAN1_MO66_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029840u)

/** Alias (User Manual Name) for CAN1_MO66_EDATA0.
* To use register names with standard convension, please use CAN1_MO66_EDATA0.
*/
#define	CAN1_EMO66DATA0	(CAN1_MO66_EDATA0)

/** \brief  1844, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO66_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029844u)

/** Alias (User Manual Name) for CAN1_MO66_EDATA1.
* To use register names with standard convension, please use CAN1_MO66_EDATA1.
*/
#define	CAN1_EMO66DATA1	(CAN1_MO66_EDATA1)

/** \brief  1848, Message Object  Interrupt Pointer Register */
#define CAN1_MO66_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029848u)

/** Alias (User Manual Name) for CAN1_MO66_EDATA2.
* To use register names with standard convension, please use CAN1_MO66_EDATA2.
*/
#define	CAN1_EMO66DATA2	(CAN1_MO66_EDATA2)

/** \brief  184C, Message Object  Acceptance Mask Register */
#define CAN1_MO66_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002984Cu)

/** Alias (User Manual Name) for CAN1_MO66_EDATA3.
* To use register names with standard convension, please use CAN1_MO66_EDATA3.
*/
#define	CAN1_EMO66DATA3	(CAN1_MO66_EDATA3)

/** \brief  1850, Message Object  Data Register Low */
#define CAN1_MO66_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029850u)

/** Alias (User Manual Name) for CAN1_MO66_EDATA4.
* To use register names with standard convension, please use CAN1_MO66_EDATA4.
*/
#define	CAN1_EMO66DATA4	(CAN1_MO66_EDATA4)

/** \brief  1854, Message Object  Data Register High */
#define CAN1_MO66_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029854u)

/** Alias (User Manual Name) for CAN1_MO66_EDATA5.
* To use register names with standard convension, please use CAN1_MO66_EDATA5.
*/
#define	CAN1_EMO66DATA5	(CAN1_MO66_EDATA5)

/** \brief  1858, Message Object  Arbitration Register */
#define CAN1_MO66_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029858u)

/** Alias (User Manual Name) for CAN1_MO66_EDATA6.
* To use register names with standard convension, please use CAN1_MO66_EDATA6.
*/
#define	CAN1_EMO66DATA6	(CAN1_MO66_EDATA6)

/** \brief  1840, Message Object  Function Control Register */
#define CAN1_MO66_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029840u)

/** Alias (User Manual Name) for CAN1_MO66_FCR.
* To use register names with standard convension, please use CAN1_MO66_FCR.
*/
#define	CAN1_MOFCR66	(CAN1_MO66_FCR)

/** \brief  1844, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO66_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029844u)

/** Alias (User Manual Name) for CAN1_MO66_FGPR.
* To use register names with standard convension, please use CAN1_MO66_FGPR.
*/
#define	CAN1_MOFGPR66	(CAN1_MO66_FGPR)

/** \brief  1848, Message Object  Interrupt Pointer Register */
#define CAN1_MO66_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029848u)

/** Alias (User Manual Name) for CAN1_MO66_IPR.
* To use register names with standard convension, please use CAN1_MO66_IPR.
*/
#define	CAN1_MOIPR66	(CAN1_MO66_IPR)

/** \brief  185C, Message Object  Control Register */
#define CAN1_MO66_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002985Cu)

/** Alias (User Manual Name) for CAN1_MO66_STAT.
* To use register names with standard convension, please use CAN1_MO66_STAT.
*/
#define	CAN1_MOSTAT66	(CAN1_MO66_STAT)

/** \brief  186C, Message Object  Acceptance Mask Register */
#define CAN1_MO67_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002986Cu)

/** Alias (User Manual Name) for CAN1_MO67_AMR.
* To use register names with standard convension, please use CAN1_MO67_AMR.
*/
#define	CAN1_MOAMR67	(CAN1_MO67_AMR)

/** \brief  1878, Message Object  Arbitration Register */
#define CAN1_MO67_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029878u)

/** Alias (User Manual Name) for CAN1_MO67_AR.
* To use register names with standard convension, please use CAN1_MO67_AR.
*/
#define	CAN1_MOAR67	(CAN1_MO67_AR)

/** \brief  187C, Message Object  Control Register */
#define CAN1_MO67_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002987Cu)

/** Alias (User Manual Name) for CAN1_MO67_CTR.
* To use register names with standard convension, please use CAN1_MO67_CTR.
*/
#define	CAN1_MOCTR67	(CAN1_MO67_CTR)

/** \brief  1874, Message Object  Data Register High */
#define CAN1_MO67_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029874u)

/** Alias (User Manual Name) for CAN1_MO67_DATAH.
* To use register names with standard convension, please use CAN1_MO67_DATAH.
*/
#define	CAN1_MODATAH67	(CAN1_MO67_DATAH)

/** \brief  1870, Message Object  Data Register Low */
#define CAN1_MO67_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029870u)

/** Alias (User Manual Name) for CAN1_MO67_DATAL.
* To use register names with standard convension, please use CAN1_MO67_DATAL.
*/
#define	CAN1_MODATAL67	(CAN1_MO67_DATAL)

/** \brief  1860, Message Object  Function Control Register */
#define CAN1_MO67_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029860u)

/** Alias (User Manual Name) for CAN1_MO67_EDATA0.
* To use register names with standard convension, please use CAN1_MO67_EDATA0.
*/
#define	CAN1_EMO67DATA0	(CAN1_MO67_EDATA0)

