leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1864, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO67_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029864u)

/** Alias (User Manual Name) for CAN1_MO67_EDATA1.
* To use register names with standard convension, please use CAN1_MO67_EDATA1.
*/
#define	CAN1_EMO67DATA1	(CAN1_MO67_EDATA1)

/** \brief  1868, Message Object  Interrupt Pointer Register */
#define CAN1_MO67_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029868u)

/** Alias (User Manual Name) for CAN1_MO67_EDATA2.
* To use register names with standard convension, please use CAN1_MO67_EDATA2.
*/
#define	CAN1_EMO67DATA2	(CAN1_MO67_EDATA2)

/** \brief  186C, Message Object  Acceptance Mask Register */
#define CAN1_MO67_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002986Cu)

/** Alias (User Manual Name) for CAN1_MO67_EDATA3.
* To use register names with standard convension, please use CAN1_MO67_EDATA3.
*/
#define	CAN1_EMO67DATA3	(CAN1_MO67_EDATA3)

/** \brief  1870, Message Object  Data Register Low */
#define CAN1_MO67_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029870u)

/** Alias (User Manual Name) for CAN1_MO67_EDATA4.
* To use register names with standard convension, please use CAN1_MO67_EDATA4.
*/
#define	CAN1_EMO67DATA4	(CAN1_MO67_EDATA4)

/** \brief  1874, Message Object  Data Register High */
#define CAN1_MO67_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029874u)

/** Alias (User Manual Name) for CAN1_MO67_EDATA5.
* To use register names with standard convension, please use CAN1_MO67_EDATA5.
*/
#define	CAN1_EMO67DATA5	(CAN1_MO67_EDATA5)

/** \brief  1878, Message Object  Arbitration Register */
#define CAN1_MO67_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029878u)

/** Alias (User Manual Name) for CAN1_MO67_EDATA6.
* To use register names with standard convension, please use CAN1_MO67_EDATA6.
*/
#define	CAN1_EMO67DATA6	(CAN1_MO67_EDATA6)

/** \brief  1860, Message Object  Function Control Register */
#define CAN1_MO67_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029860u)

/** Alias (User Manual Name) for CAN1_MO67_FCR.
* To use register names with standard convension, please use CAN1_MO67_FCR.
*/
#define	CAN1_MOFCR67	(CAN1_MO67_FCR)

/** \brief  1864, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO67_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029864u)

/** Alias (User Manual Name) for CAN1_MO67_FGPR.
* To use register names with standard convension, please use CAN1_MO67_FGPR.
*/
#define	CAN1_MOFGPR67	(CAN1_MO67_FGPR)

/** \brief  1868, Message Object  Interrupt Pointer Register */
#define CAN1_MO67_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029868u)

/** Alias (User Manual Name) for CAN1_MO67_IPR.
* To use register names with standard convension, please use CAN1_MO67_IPR.
*/
#define	CAN1_MOIPR67	(CAN1_MO67_IPR)

/** \brief  187C, Message Object  Control Register */
#define CAN1_MO67_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002987Cu)

/** Alias (User Manual Name) for CAN1_MO67_STAT.
* To use register names with standard convension, please use CAN1_MO67_STAT.
*/
#define	CAN1_MOSTAT67	(CAN1_MO67_STAT)

/** \brief  188C, Message Object  Acceptance Mask Register */
#define CAN1_MO68_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002988Cu)

/** Alias (User Manual Name) for CAN1_MO68_AMR.
* To use register names with standard convension, please use CAN1_MO68_AMR.
*/
#define	CAN1_MOAMR68	(CAN1_MO68_AMR)

/** \brief  1898, Message Object  Arbitration Register */
#define CAN1_MO68_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029898u)

/** Alias (User Manual Name) for CAN1_MO68_AR.
* To use register names with standard convension, please use CAN1_MO68_AR.
*/
#define	CAN1_MOAR68	(CAN1_MO68_AR)

/** \brief  189C, Message Object  Control Register */
#define CAN1_MO68_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002989Cu)

/** Alias (User Manual Name) for CAN1_MO68_CTR.
* To use register names with standard convension, please use CAN1_MO68_CTR.
*/
#define	CAN1_MOCTR68	(CAN1_MO68_CTR)

/** \brief  1894, Message Object  Data Register High */
#define CAN1_MO68_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029894u)

/** Alias (User Manual Name) for CAN1_MO68_DATAH.
* To use register names with standard convension, please use CAN1_MO68_DATAH.
*/
#define	CAN1_MODATAH68	(CAN1_MO68_DATAH)

/** \brief  1890, Message Object  Data Register Low */
#define CAN1_MO68_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029890u)

/** Alias (User Manual Name) for CAN1_MO68_DATAL.
* To use register names with standard convension, please use CAN1_MO68_DATAL.
*/
#define	CAN1_MODATAL68	(CAN1_MO68_DATAL)

/** \brief  1880, Message Object  Function Control Register */
#define CAN1_MO68_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029880u)

/** Alias (User Manual Name) for CAN1_MO68_EDATA0.
* To use register names with standard convension, please use CAN1_MO68_EDATA0.
*/
#define	CAN1_EMO68DATA0	(CAN1_MO68_EDATA0)

/** \brief  1884, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO68_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029884u)

/** Alias (User Manual Name) for CAN1_MO68_EDATA1.
* To use register names with standard convension, please use CAN1_MO68_EDATA1.
*/
#define	CAN1_EMO68DATA1	(CAN1_MO68_EDATA1)

/** \brief  1888, Message Object  Interrupt Pointer Register */
#define CAN1_MO68_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029888u)

/** Alias (User Manual Name) for CAN1_MO68_EDATA2.
* To use register names with standard convension, please use CAN1_MO68_EDATA2.
*/
#define	CAN1_EMO68DATA2	(CAN1_MO68_EDATA2)

/** \brief  188C, Message Object  Acceptance Mask Register */
#define CAN1_MO68_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002988Cu)

/** Alias (User Manual Name) for CAN1_MO68_EDATA3.
* To use register names with standard convension, please use CAN1_MO68_EDATA3.
*/
#define	CAN1_EMO68DATA3	(CAN1_MO68_EDATA3)

