leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1890, Message Object  Data Register Low */
#define CAN1_MO68_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029890u)

/** Alias (User Manual Name) for CAN1_MO68_EDATA4.
* To use register names with standard convension, please use CAN1_MO68_EDATA4.
*/
#define	CAN1_EMO68DATA4	(CAN1_MO68_EDATA4)

/** \brief  1894, Message Object  Data Register High */
#define CAN1_MO68_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029894u)

/** Alias (User Manual Name) for CAN1_MO68_EDATA5.
* To use register names with standard convension, please use CAN1_MO68_EDATA5.
*/
#define	CAN1_EMO68DATA5	(CAN1_MO68_EDATA5)

/** \brief  1898, Message Object  Arbitration Register */
#define CAN1_MO68_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029898u)

/** Alias (User Manual Name) for CAN1_MO68_EDATA6.
* To use register names with standard convension, please use CAN1_MO68_EDATA6.
*/
#define	CAN1_EMO68DATA6	(CAN1_MO68_EDATA6)

/** \brief  1880, Message Object  Function Control Register */
#define CAN1_MO68_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029880u)

/** Alias (User Manual Name) for CAN1_MO68_FCR.
* To use register names with standard convension, please use CAN1_MO68_FCR.
*/
#define	CAN1_MOFCR68	(CAN1_MO68_FCR)

/** \brief  1884, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO68_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029884u)

/** Alias (User Manual Name) for CAN1_MO68_FGPR.
* To use register names with standard convension, please use CAN1_MO68_FGPR.
*/
#define	CAN1_MOFGPR68	(CAN1_MO68_FGPR)

/** \brief  1888, Message Object  Interrupt Pointer Register */
#define CAN1_MO68_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029888u)

/** Alias (User Manual Name) for CAN1_MO68_IPR.
* To use register names with standard convension, please use CAN1_MO68_IPR.
*/
#define	CAN1_MOIPR68	(CAN1_MO68_IPR)

/** \brief  189C, Message Object  Control Register */
#define CAN1_MO68_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002989Cu)

/** Alias (User Manual Name) for CAN1_MO68_STAT.
* To use register names with standard convension, please use CAN1_MO68_STAT.
*/
#define	CAN1_MOSTAT68	(CAN1_MO68_STAT)

/** \brief  18AC, Message Object  Acceptance Mask Register */
#define CAN1_MO69_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00298ACu)

/** Alias (User Manual Name) for CAN1_MO69_AMR.
* To use register names with standard convension, please use CAN1_MO69_AMR.
*/
#define	CAN1_MOAMR69	(CAN1_MO69_AMR)

/** \brief  18B8, Message Object  Arbitration Register */
#define CAN1_MO69_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00298B8u)

/** Alias (User Manual Name) for CAN1_MO69_AR.
* To use register names with standard convension, please use CAN1_MO69_AR.
*/
#define	CAN1_MOAR69	(CAN1_MO69_AR)

/** \brief  18BC, Message Object  Control Register */
#define CAN1_MO69_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00298BCu)

/** Alias (User Manual Name) for CAN1_MO69_CTR.
* To use register names with standard convension, please use CAN1_MO69_CTR.
*/
#define	CAN1_MOCTR69	(CAN1_MO69_CTR)

/** \brief  18B4, Message Object  Data Register High */
#define CAN1_MO69_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00298B4u)

/** Alias (User Manual Name) for CAN1_MO69_DATAH.
* To use register names with standard convension, please use CAN1_MO69_DATAH.
*/
#define	CAN1_MODATAH69	(CAN1_MO69_DATAH)

/** \brief  18B0, Message Object  Data Register Low */
#define CAN1_MO69_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00298B0u)

/** Alias (User Manual Name) for CAN1_MO69_DATAL.
* To use register names with standard convension, please use CAN1_MO69_DATAL.
*/
#define	CAN1_MODATAL69	(CAN1_MO69_DATAL)

/** \brief  18A0, Message Object  Function Control Register */
#define CAN1_MO69_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00298A0u)

/** Alias (User Manual Name) for CAN1_MO69_EDATA0.
* To use register names with standard convension, please use CAN1_MO69_EDATA0.
*/
#define	CAN1_EMO69DATA0	(CAN1_MO69_EDATA0)

/** \brief  18A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO69_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00298A4u)

/** Alias (User Manual Name) for CAN1_MO69_EDATA1.
* To use register names with standard convension, please use CAN1_MO69_EDATA1.
*/
#define	CAN1_EMO69DATA1	(CAN1_MO69_EDATA1)

/** \brief  18A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO69_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00298A8u)

/** Alias (User Manual Name) for CAN1_MO69_EDATA2.
* To use register names with standard convension, please use CAN1_MO69_EDATA2.
*/
#define	CAN1_EMO69DATA2	(CAN1_MO69_EDATA2)

/** \brief  18AC, Message Object  Acceptance Mask Register */
#define CAN1_MO69_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00298ACu)

/** Alias (User Manual Name) for CAN1_MO69_EDATA3.
* To use register names with standard convension, please use CAN1_MO69_EDATA3.
*/
#define	CAN1_EMO69DATA3	(CAN1_MO69_EDATA3)

/** \brief  18B0, Message Object  Data Register Low */
#define CAN1_MO69_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00298B0u)

/** Alias (User Manual Name) for CAN1_MO69_EDATA4.
* To use register names with standard convension, please use CAN1_MO69_EDATA4.
*/
#define	CAN1_EMO69DATA4	(CAN1_MO69_EDATA4)

/** \brief  18B4, Message Object  Data Register High */
#define CAN1_MO69_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00298B4u)

/** Alias (User Manual Name) for CAN1_MO69_EDATA5.
* To use register names with standard convension, please use CAN1_MO69_EDATA5.
*/
#define	CAN1_EMO69DATA5	(CAN1_MO69_EDATA5)

/** \brief  18B8, Message Object  Arbitration Register */
#define CAN1_MO69_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00298B8u)

/** Alias (User Manual Name) for CAN1_MO69_EDATA6.
* To use register names with standard convension, please use CAN1_MO69_EDATA6.
*/
#define	CAN1_EMO69DATA6	(CAN1_MO69_EDATA6)

/** \brief  18A0, Message Object  Function Control Register */
#define CAN1_MO69_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00298A0u)

/** Alias (User Manual Name) for CAN1_MO69_FCR.
* To use register names with standard convension, please use CAN1_MO69_FCR.
*/
#define	CAN1_MOFCR69	(CAN1_MO69_FCR)

/** \brief  18A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO69_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00298A4u)

/** Alias (User Manual Name) for CAN1_MO69_FGPR.
* To use register names with standard convension, please use CAN1_MO69_FGPR.
*/
#define	CAN1_MOFGPR69	(CAN1_MO69_FGPR)

/** \brief  18A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO69_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00298A8u)

/** Alias (User Manual Name) for CAN1_MO69_IPR.
* To use register names with standard convension, please use CAN1_MO69_IPR.
*/
#define	CAN1_MOIPR69	(CAN1_MO69_IPR)

