leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  18BC, Message Object  Control Register */
#define CAN1_MO69_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00298BCu)

/** Alias (User Manual Name) for CAN1_MO69_STAT.
* To use register names with standard convension, please use CAN1_MO69_STAT.
*/
#define	CAN1_MOSTAT69	(CAN1_MO69_STAT)

/** \brief  10CC, Message Object  Acceptance Mask Register */
#define CAN1_MO6_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00290CCu)

/** Alias (User Manual Name) for CAN1_MO6_AMR.
* To use register names with standard convension, please use CAN1_MO6_AMR.
*/
#define	CAN1_MOAMR6	(CAN1_MO6_AMR)

/** \brief  10D8, Message Object  Arbitration Register */
#define CAN1_MO6_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00290D8u)

/** Alias (User Manual Name) for CAN1_MO6_AR.
* To use register names with standard convension, please use CAN1_MO6_AR.
*/
#define	CAN1_MOAR6	(CAN1_MO6_AR)

/** \brief  10DC, Message Object  Control Register */
#define CAN1_MO6_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00290DCu)

/** Alias (User Manual Name) for CAN1_MO6_CTR.
* To use register names with standard convension, please use CAN1_MO6_CTR.
*/
#define	CAN1_MOCTR6	(CAN1_MO6_CTR)

/** \brief  10D4, Message Object  Data Register High */
#define CAN1_MO6_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00290D4u)

/** Alias (User Manual Name) for CAN1_MO6_DATAH.
* To use register names with standard convension, please use CAN1_MO6_DATAH.
*/
#define	CAN1_MODATAH6	(CAN1_MO6_DATAH)

/** \brief  10D0, Message Object  Data Register Low */
#define CAN1_MO6_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00290D0u)

/** Alias (User Manual Name) for CAN1_MO6_DATAL.
* To use register names with standard convension, please use CAN1_MO6_DATAL.
*/
#define	CAN1_MODATAL6	(CAN1_MO6_DATAL)

/** \brief  10C0, Message Object  Function Control Register */
#define CAN1_MO6_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00290C0u)

/** Alias (User Manual Name) for CAN1_MO6_EDATA0.
* To use register names with standard convension, please use CAN1_MO6_EDATA0.
*/
#define	CAN1_EMO6DATA0	(CAN1_MO6_EDATA0)

/** \brief  10C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO6_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00290C4u)

/** Alias (User Manual Name) for CAN1_MO6_EDATA1.
* To use register names with standard convension, please use CAN1_MO6_EDATA1.
*/
#define	CAN1_EMO6DATA1	(CAN1_MO6_EDATA1)

/** \brief  10C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO6_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00290C8u)

/** Alias (User Manual Name) for CAN1_MO6_EDATA2.
* To use register names with standard convension, please use CAN1_MO6_EDATA2.
*/
#define	CAN1_EMO6DATA2	(CAN1_MO6_EDATA2)

/** \brief  10CC, Message Object  Acceptance Mask Register */
#define CAN1_MO6_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00290CCu)

/** Alias (User Manual Name) for CAN1_MO6_EDATA3.
* To use register names with standard convension, please use CAN1_MO6_EDATA3.
*/
#define	CAN1_EMO6DATA3	(CAN1_MO6_EDATA3)

/** \brief  10D0, Message Object  Data Register Low */
#define CAN1_MO6_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00290D0u)

/** Alias (User Manual Name) for CAN1_MO6_EDATA4.
* To use register names with standard convension, please use CAN1_MO6_EDATA4.
*/
#define	CAN1_EMO6DATA4	(CAN1_MO6_EDATA4)

/** \brief  10D4, Message Object  Data Register High */
#define CAN1_MO6_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00290D4u)

/** Alias (User Manual Name) for CAN1_MO6_EDATA5.
* To use register names with standard convension, please use CAN1_MO6_EDATA5.
*/
#define	CAN1_EMO6DATA5	(CAN1_MO6_EDATA5)

/** \brief  10D8, Message Object  Arbitration Register */
#define CAN1_MO6_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00290D8u)

/** Alias (User Manual Name) for CAN1_MO6_EDATA6.
* To use register names with standard convension, please use CAN1_MO6_EDATA6.
*/
#define	CAN1_EMO6DATA6	(CAN1_MO6_EDATA6)

/** \brief  10C0, Message Object  Function Control Register */
#define CAN1_MO6_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00290C0u)

/** Alias (User Manual Name) for CAN1_MO6_FCR.
* To use register names with standard convension, please use CAN1_MO6_FCR.
*/
#define	CAN1_MOFCR6	(CAN1_MO6_FCR)

/** \brief  10C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO6_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00290C4u)

/** Alias (User Manual Name) for CAN1_MO6_FGPR.
* To use register names with standard convension, please use CAN1_MO6_FGPR.
*/
#define	CAN1_MOFGPR6	(CAN1_MO6_FGPR)

/** \brief  10C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO6_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00290C8u)

/** Alias (User Manual Name) for CAN1_MO6_IPR.
* To use register names with standard convension, please use CAN1_MO6_IPR.
*/
#define	CAN1_MOIPR6	(CAN1_MO6_IPR)

/** \brief  10DC, Message Object  Control Register */
#define CAN1_MO6_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00290DCu)

/** Alias (User Manual Name) for CAN1_MO6_STAT.
* To use register names with standard convension, please use CAN1_MO6_STAT.
*/
#define	CAN1_MOSTAT6	(CAN1_MO6_STAT)

/** \brief  18CC, Message Object  Acceptance Mask Register */
#define CAN1_MO70_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00298CCu)

/** Alias (User Manual Name) for CAN1_MO70_AMR.
* To use register names with standard convension, please use CAN1_MO70_AMR.
*/
#define	CAN1_MOAMR70	(CAN1_MO70_AMR)

/** \brief  18D8, Message Object  Arbitration Register */
#define CAN1_MO70_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00298D8u)

/** Alias (User Manual Name) for CAN1_MO70_AR.
* To use register names with standard convension, please use CAN1_MO70_AR.
*/
#define	CAN1_MOAR70	(CAN1_MO70_AR)

/** \brief  18DC, Message Object  Control Register */
#define CAN1_MO70_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00298DCu)

/** Alias (User Manual Name) for CAN1_MO70_CTR.
* To use register names with standard convension, please use CAN1_MO70_CTR.
*/
#define	CAN1_MOCTR70	(CAN1_MO70_CTR)

