leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  18D4, Message Object  Data Register High */
#define CAN1_MO70_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00298D4u)

/** Alias (User Manual Name) for CAN1_MO70_DATAH.
* To use register names with standard convension, please use CAN1_MO70_DATAH.
*/
#define	CAN1_MODATAH70	(CAN1_MO70_DATAH)

/** \brief  18D0, Message Object  Data Register Low */
#define CAN1_MO70_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00298D0u)

/** Alias (User Manual Name) for CAN1_MO70_DATAL.
* To use register names with standard convension, please use CAN1_MO70_DATAL.
*/
#define	CAN1_MODATAL70	(CAN1_MO70_DATAL)

/** \brief  18C0, Message Object  Function Control Register */
#define CAN1_MO70_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00298C0u)

/** Alias (User Manual Name) for CAN1_MO70_EDATA0.
* To use register names with standard convension, please use CAN1_MO70_EDATA0.
*/
#define	CAN1_EMO70DATA0	(CAN1_MO70_EDATA0)

/** \brief  18C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO70_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00298C4u)

/** Alias (User Manual Name) for CAN1_MO70_EDATA1.
* To use register names with standard convension, please use CAN1_MO70_EDATA1.
*/
#define	CAN1_EMO70DATA1	(CAN1_MO70_EDATA1)

/** \brief  18C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO70_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00298C8u)

/** Alias (User Manual Name) for CAN1_MO70_EDATA2.
* To use register names with standard convension, please use CAN1_MO70_EDATA2.
*/
#define	CAN1_EMO70DATA2	(CAN1_MO70_EDATA2)

/** \brief  18CC, Message Object  Acceptance Mask Register */
#define CAN1_MO70_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00298CCu)

/** Alias (User Manual Name) for CAN1_MO70_EDATA3.
* To use register names with standard convension, please use CAN1_MO70_EDATA3.
*/
#define	CAN1_EMO70DATA3	(CAN1_MO70_EDATA3)

/** \brief  18D0, Message Object  Data Register Low */
#define CAN1_MO70_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00298D0u)

/** Alias (User Manual Name) for CAN1_MO70_EDATA4.
* To use register names with standard convension, please use CAN1_MO70_EDATA4.
*/
#define	CAN1_EMO70DATA4	(CAN1_MO70_EDATA4)

/** \brief  18D4, Message Object  Data Register High */
#define CAN1_MO70_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00298D4u)

/** Alias (User Manual Name) for CAN1_MO70_EDATA5.
* To use register names with standard convension, please use CAN1_MO70_EDATA5.
*/
#define	CAN1_EMO70DATA5	(CAN1_MO70_EDATA5)

/** \brief  18D8, Message Object  Arbitration Register */
#define CAN1_MO70_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00298D8u)

/** Alias (User Manual Name) for CAN1_MO70_EDATA6.
* To use register names with standard convension, please use CAN1_MO70_EDATA6.
*/
#define	CAN1_EMO70DATA6	(CAN1_MO70_EDATA6)

/** \brief  18C0, Message Object  Function Control Register */
#define CAN1_MO70_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00298C0u)

/** Alias (User Manual Name) for CAN1_MO70_FCR.
* To use register names with standard convension, please use CAN1_MO70_FCR.
*/
#define	CAN1_MOFCR70	(CAN1_MO70_FCR)

/** \brief  18C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO70_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00298C4u)

/** Alias (User Manual Name) for CAN1_MO70_FGPR.
* To use register names with standard convension, please use CAN1_MO70_FGPR.
*/
#define	CAN1_MOFGPR70	(CAN1_MO70_FGPR)

/** \brief  18C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO70_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00298C8u)

/** Alias (User Manual Name) for CAN1_MO70_IPR.
* To use register names with standard convension, please use CAN1_MO70_IPR.
*/
#define	CAN1_MOIPR70	(CAN1_MO70_IPR)

/** \brief  18DC, Message Object  Control Register */
#define CAN1_MO70_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00298DCu)

/** Alias (User Manual Name) for CAN1_MO70_STAT.
* To use register names with standard convension, please use CAN1_MO70_STAT.
*/
#define	CAN1_MOSTAT70	(CAN1_MO70_STAT)

/** \brief  18EC, Message Object  Acceptance Mask Register */
#define CAN1_MO71_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00298ECu)

/** Alias (User Manual Name) for CAN1_MO71_AMR.
* To use register names with standard convension, please use CAN1_MO71_AMR.
*/
#define	CAN1_MOAMR71	(CAN1_MO71_AMR)

/** \brief  18F8, Message Object  Arbitration Register */
#define CAN1_MO71_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00298F8u)

/** Alias (User Manual Name) for CAN1_MO71_AR.
* To use register names with standard convension, please use CAN1_MO71_AR.
*/
#define	CAN1_MOAR71	(CAN1_MO71_AR)

/** \brief  18FC, Message Object  Control Register */
#define CAN1_MO71_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00298FCu)

/** Alias (User Manual Name) for CAN1_MO71_CTR.
* To use register names with standard convension, please use CAN1_MO71_CTR.
*/
#define	CAN1_MOCTR71	(CAN1_MO71_CTR)

/** \brief  18F4, Message Object  Data Register High */
#define CAN1_MO71_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00298F4u)

/** Alias (User Manual Name) for CAN1_MO71_DATAH.
* To use register names with standard convension, please use CAN1_MO71_DATAH.
*/
#define	CAN1_MODATAH71	(CAN1_MO71_DATAH)

/** \brief  18F0, Message Object  Data Register Low */
#define CAN1_MO71_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00298F0u)

/** Alias (User Manual Name) for CAN1_MO71_DATAL.
* To use register names with standard convension, please use CAN1_MO71_DATAL.
*/
#define	CAN1_MODATAL71	(CAN1_MO71_DATAL)

/** \brief  18E0, Message Object  Function Control Register */
#define CAN1_MO71_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00298E0u)

/** Alias (User Manual Name) for CAN1_MO71_EDATA0.
* To use register names with standard convension, please use CAN1_MO71_EDATA0.
*/
#define	CAN1_EMO71DATA0	(CAN1_MO71_EDATA0)

