leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  18E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO71_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00298E4u)

/** Alias (User Manual Name) for CAN1_MO71_EDATA1.
* To use register names with standard convension, please use CAN1_MO71_EDATA1.
*/
#define	CAN1_EMO71DATA1	(CAN1_MO71_EDATA1)

/** \brief  18E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO71_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00298E8u)

/** Alias (User Manual Name) for CAN1_MO71_EDATA2.
* To use register names with standard convension, please use CAN1_MO71_EDATA2.
*/
#define	CAN1_EMO71DATA2	(CAN1_MO71_EDATA2)

/** \brief  18EC, Message Object  Acceptance Mask Register */
#define CAN1_MO71_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00298ECu)

/** Alias (User Manual Name) for CAN1_MO71_EDATA3.
* To use register names with standard convension, please use CAN1_MO71_EDATA3.
*/
#define	CAN1_EMO71DATA3	(CAN1_MO71_EDATA3)

/** \brief  18F0, Message Object  Data Register Low */
#define CAN1_MO71_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00298F0u)

/** Alias (User Manual Name) for CAN1_MO71_EDATA4.
* To use register names with standard convension, please use CAN1_MO71_EDATA4.
*/
#define	CAN1_EMO71DATA4	(CAN1_MO71_EDATA4)

/** \brief  18F4, Message Object  Data Register High */
#define CAN1_MO71_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00298F4u)

/** Alias (User Manual Name) for CAN1_MO71_EDATA5.
* To use register names with standard convension, please use CAN1_MO71_EDATA5.
*/
#define	CAN1_EMO71DATA5	(CAN1_MO71_EDATA5)

/** \brief  18F8, Message Object  Arbitration Register */
#define CAN1_MO71_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00298F8u)

/** Alias (User Manual Name) for CAN1_MO71_EDATA6.
* To use register names with standard convension, please use CAN1_MO71_EDATA6.
*/
#define	CAN1_EMO71DATA6	(CAN1_MO71_EDATA6)

/** \brief  18E0, Message Object  Function Control Register */
#define CAN1_MO71_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00298E0u)

/** Alias (User Manual Name) for CAN1_MO71_FCR.
* To use register names with standard convension, please use CAN1_MO71_FCR.
*/
#define	CAN1_MOFCR71	(CAN1_MO71_FCR)

/** \brief  18E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO71_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00298E4u)

/** Alias (User Manual Name) for CAN1_MO71_FGPR.
* To use register names with standard convension, please use CAN1_MO71_FGPR.
*/
#define	CAN1_MOFGPR71	(CAN1_MO71_FGPR)

/** \brief  18E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO71_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00298E8u)

/** Alias (User Manual Name) for CAN1_MO71_IPR.
* To use register names with standard convension, please use CAN1_MO71_IPR.
*/
#define	CAN1_MOIPR71	(CAN1_MO71_IPR)

/** \brief  18FC, Message Object  Control Register */
#define CAN1_MO71_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00298FCu)

/** Alias (User Manual Name) for CAN1_MO71_STAT.
* To use register names with standard convension, please use CAN1_MO71_STAT.
*/
#define	CAN1_MOSTAT71	(CAN1_MO71_STAT)

/** \brief  190C, Message Object  Acceptance Mask Register */
#define CAN1_MO72_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002990Cu)

/** Alias (User Manual Name) for CAN1_MO72_AMR.
* To use register names with standard convension, please use CAN1_MO72_AMR.
*/
#define	CAN1_MOAMR72	(CAN1_MO72_AMR)

/** \brief  1918, Message Object  Arbitration Register */
#define CAN1_MO72_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029918u)

/** Alias (User Manual Name) for CAN1_MO72_AR.
* To use register names with standard convension, please use CAN1_MO72_AR.
*/
#define	CAN1_MOAR72	(CAN1_MO72_AR)

/** \brief  191C, Message Object  Control Register */
#define CAN1_MO72_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002991Cu)

/** Alias (User Manual Name) for CAN1_MO72_CTR.
* To use register names with standard convension, please use CAN1_MO72_CTR.
*/
#define	CAN1_MOCTR72	(CAN1_MO72_CTR)

/** \brief  1914, Message Object  Data Register High */
#define CAN1_MO72_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029914u)

/** Alias (User Manual Name) for CAN1_MO72_DATAH.
* To use register names with standard convension, please use CAN1_MO72_DATAH.
*/
#define	CAN1_MODATAH72	(CAN1_MO72_DATAH)

/** \brief  1910, Message Object  Data Register Low */
#define CAN1_MO72_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029910u)

/** Alias (User Manual Name) for CAN1_MO72_DATAL.
* To use register names with standard convension, please use CAN1_MO72_DATAL.
*/
#define	CAN1_MODATAL72	(CAN1_MO72_DATAL)

/** \brief  1900, Message Object  Function Control Register */
#define CAN1_MO72_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029900u)

/** Alias (User Manual Name) for CAN1_MO72_EDATA0.
* To use register names with standard convension, please use CAN1_MO72_EDATA0.
*/
#define	CAN1_EMO72DATA0	(CAN1_MO72_EDATA0)

/** \brief  1904, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO72_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029904u)

/** Alias (User Manual Name) for CAN1_MO72_EDATA1.
* To use register names with standard convension, please use CAN1_MO72_EDATA1.
*/
#define	CAN1_EMO72DATA1	(CAN1_MO72_EDATA1)

/** \brief  1908, Message Object  Interrupt Pointer Register */
#define CAN1_MO72_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029908u)

/** Alias (User Manual Name) for CAN1_MO72_EDATA2.
* To use register names with standard convension, please use CAN1_MO72_EDATA2.
*/
#define	CAN1_EMO72DATA2	(CAN1_MO72_EDATA2)

/** \brief  190C, Message Object  Acceptance Mask Register */
#define CAN1_MO72_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002990Cu)

/** Alias (User Manual Name) for CAN1_MO72_EDATA3.
* To use register names with standard convension, please use CAN1_MO72_EDATA3.
*/
#define	CAN1_EMO72DATA3	(CAN1_MO72_EDATA3)

/** \brief  1910, Message Object  Data Register Low */
#define CAN1_MO72_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029910u)

/** Alias (User Manual Name) for CAN1_MO72_EDATA4.
* To use register names with standard convension, please use CAN1_MO72_EDATA4.
*/
#define	CAN1_EMO72DATA4	(CAN1_MO72_EDATA4)

