leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO75_EDATA2.
* To use register names with standard convension, please use CAN1_MO75_EDATA2.
*/
#define	CAN1_EMO75DATA2	(CAN1_MO75_EDATA2)

/** \brief  196C, Message Object  Acceptance Mask Register */
#define CAN1_MO75_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002996Cu)

/** Alias (User Manual Name) for CAN1_MO75_EDATA3.
* To use register names with standard convension, please use CAN1_MO75_EDATA3.
*/
#define	CAN1_EMO75DATA3	(CAN1_MO75_EDATA3)

/** \brief  1970, Message Object  Data Register Low */
#define CAN1_MO75_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029970u)

/** Alias (User Manual Name) for CAN1_MO75_EDATA4.
* To use register names with standard convension, please use CAN1_MO75_EDATA4.
*/
#define	CAN1_EMO75DATA4	(CAN1_MO75_EDATA4)

/** \brief  1974, Message Object  Data Register High */
#define CAN1_MO75_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029974u)

/** Alias (User Manual Name) for CAN1_MO75_EDATA5.
* To use register names with standard convension, please use CAN1_MO75_EDATA5.
*/
#define	CAN1_EMO75DATA5	(CAN1_MO75_EDATA5)

/** \brief  1978, Message Object  Arbitration Register */
#define CAN1_MO75_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029978u)

/** Alias (User Manual Name) for CAN1_MO75_EDATA6.
* To use register names with standard convension, please use CAN1_MO75_EDATA6.
*/
#define	CAN1_EMO75DATA6	(CAN1_MO75_EDATA6)

/** \brief  1960, Message Object  Function Control Register */
#define CAN1_MO75_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029960u)

/** Alias (User Manual Name) for CAN1_MO75_FCR.
* To use register names with standard convension, please use CAN1_MO75_FCR.
*/
#define	CAN1_MOFCR75	(CAN1_MO75_FCR)

/** \brief  1964, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO75_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029964u)

/** Alias (User Manual Name) for CAN1_MO75_FGPR.
* To use register names with standard convension, please use CAN1_MO75_FGPR.
*/
#define	CAN1_MOFGPR75	(CAN1_MO75_FGPR)

/** \brief  1968, Message Object  Interrupt Pointer Register */
#define CAN1_MO75_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029968u)

/** Alias (User Manual Name) for CAN1_MO75_IPR.
* To use register names with standard convension, please use CAN1_MO75_IPR.
*/
#define	CAN1_MOIPR75	(CAN1_MO75_IPR)

/** \brief  197C, Message Object  Control Register */
#define CAN1_MO75_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002997Cu)

/** Alias (User Manual Name) for CAN1_MO75_STAT.
* To use register names with standard convension, please use CAN1_MO75_STAT.
*/
#define	CAN1_MOSTAT75	(CAN1_MO75_STAT)

/** \brief  198C, Message Object  Acceptance Mask Register */
#define CAN1_MO76_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002998Cu)

/** Alias (User Manual Name) for CAN1_MO76_AMR.
* To use register names with standard convension, please use CAN1_MO76_AMR.
*/
#define	CAN1_MOAMR76	(CAN1_MO76_AMR)

/** \brief  1998, Message Object  Arbitration Register */
#define CAN1_MO76_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029998u)

/** Alias (User Manual Name) for CAN1_MO76_AR.
* To use register names with standard convension, please use CAN1_MO76_AR.
*/
#define	CAN1_MOAR76	(CAN1_MO76_AR)

/** \brief  199C, Message Object  Control Register */
#define CAN1_MO76_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002999Cu)

/** Alias (User Manual Name) for CAN1_MO76_CTR.
* To use register names with standard convension, please use CAN1_MO76_CTR.
*/
#define	CAN1_MOCTR76	(CAN1_MO76_CTR)

/** \brief  1994, Message Object  Data Register High */
#define CAN1_MO76_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029994u)

/** Alias (User Manual Name) for CAN1_MO76_DATAH.
* To use register names with standard convension, please use CAN1_MO76_DATAH.
*/
#define	CAN1_MODATAH76	(CAN1_MO76_DATAH)

/** \brief  1990, Message Object  Data Register Low */
#define CAN1_MO76_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029990u)

/** Alias (User Manual Name) for CAN1_MO76_DATAL.
* To use register names with standard convension, please use CAN1_MO76_DATAL.
*/
#define	CAN1_MODATAL76	(CAN1_MO76_DATAL)

/** \brief  1980, Message Object  Function Control Register */
#define CAN1_MO76_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029980u)

/** Alias (User Manual Name) for CAN1_MO76_EDATA0.
* To use register names with standard convension, please use CAN1_MO76_EDATA0.
*/
#define	CAN1_EMO76DATA0	(CAN1_MO76_EDATA0)

/** \brief  1984, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO76_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029984u)

/** Alias (User Manual Name) for CAN1_MO76_EDATA1.
* To use register names with standard convension, please use CAN1_MO76_EDATA1.
*/
#define	CAN1_EMO76DATA1	(CAN1_MO76_EDATA1)

/** \brief  1988, Message Object  Interrupt Pointer Register */
#define CAN1_MO76_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029988u)

/** Alias (User Manual Name) for CAN1_MO76_EDATA2.
* To use register names with standard convension, please use CAN1_MO76_EDATA2.
*/
#define	CAN1_EMO76DATA2	(CAN1_MO76_EDATA2)

/** \brief  198C, Message Object  Acceptance Mask Register */
#define CAN1_MO76_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002998Cu)

/** Alias (User Manual Name) for CAN1_MO76_EDATA3.
* To use register names with standard convension, please use CAN1_MO76_EDATA3.
*/
#define	CAN1_EMO76DATA3	(CAN1_MO76_EDATA3)

/** \brief  1990, Message Object  Data Register Low */
#define CAN1_MO76_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029990u)

/** Alias (User Manual Name) for CAN1_MO76_EDATA4.
* To use register names with standard convension, please use CAN1_MO76_EDATA4.
*/
#define	CAN1_EMO76DATA4	(CAN1_MO76_EDATA4)

/** \brief  1994, Message Object  Data Register High */
#define CAN1_MO76_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029994u)

/** Alias (User Manual Name) for CAN1_MO76_EDATA5.
* To use register names with standard convension, please use CAN1_MO76_EDATA5.
*/
#define	CAN1_EMO76DATA5	(CAN1_MO76_EDATA5)

/** \brief  1998, Message Object  Arbitration Register */
#define CAN1_MO76_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029998u)

/** Alias (User Manual Name) for CAN1_MO76_EDATA6.
* To use register names with standard convension, please use CAN1_MO76_EDATA6.
*/
#define	CAN1_EMO76DATA6	(CAN1_MO76_EDATA6)

