leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1980, Message Object  Function Control Register */
#define CAN1_MO76_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029980u)

/** Alias (User Manual Name) for CAN1_MO76_FCR.
* To use register names with standard convension, please use CAN1_MO76_FCR.
*/
#define	CAN1_MOFCR76	(CAN1_MO76_FCR)

/** \brief  1984, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO76_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029984u)

/** Alias (User Manual Name) for CAN1_MO76_FGPR.
* To use register names with standard convension, please use CAN1_MO76_FGPR.
*/
#define	CAN1_MOFGPR76	(CAN1_MO76_FGPR)

/** \brief  1988, Message Object  Interrupt Pointer Register */
#define CAN1_MO76_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029988u)

/** Alias (User Manual Name) for CAN1_MO76_IPR.
* To use register names with standard convension, please use CAN1_MO76_IPR.
*/
#define	CAN1_MOIPR76	(CAN1_MO76_IPR)

/** \brief  199C, Message Object  Control Register */
#define CAN1_MO76_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002999Cu)

/** Alias (User Manual Name) for CAN1_MO76_STAT.
* To use register names with standard convension, please use CAN1_MO76_STAT.
*/
#define	CAN1_MOSTAT76	(CAN1_MO76_STAT)

/** \brief  19AC, Message Object  Acceptance Mask Register */
#define CAN1_MO77_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00299ACu)

/** Alias (User Manual Name) for CAN1_MO77_AMR.
* To use register names with standard convension, please use CAN1_MO77_AMR.
*/
#define	CAN1_MOAMR77	(CAN1_MO77_AMR)

/** \brief  19B8, Message Object  Arbitration Register */
#define CAN1_MO77_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00299B8u)

/** Alias (User Manual Name) for CAN1_MO77_AR.
* To use register names with standard convension, please use CAN1_MO77_AR.
*/
#define	CAN1_MOAR77	(CAN1_MO77_AR)

/** \brief  19BC, Message Object  Control Register */
#define CAN1_MO77_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00299BCu)

/** Alias (User Manual Name) for CAN1_MO77_CTR.
* To use register names with standard convension, please use CAN1_MO77_CTR.
*/
#define	CAN1_MOCTR77	(CAN1_MO77_CTR)

/** \brief  19B4, Message Object  Data Register High */
#define CAN1_MO77_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00299B4u)

/** Alias (User Manual Name) for CAN1_MO77_DATAH.
* To use register names with standard convension, please use CAN1_MO77_DATAH.
*/
#define	CAN1_MODATAH77	(CAN1_MO77_DATAH)

/** \brief  19B0, Message Object  Data Register Low */
#define CAN1_MO77_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00299B0u)

/** Alias (User Manual Name) for CAN1_MO77_DATAL.
* To use register names with standard convension, please use CAN1_MO77_DATAL.
*/
#define	CAN1_MODATAL77	(CAN1_MO77_DATAL)

/** \brief  19A0, Message Object  Function Control Register */
#define CAN1_MO77_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00299A0u)

/** Alias (User Manual Name) for CAN1_MO77_EDATA0.
* To use register names with standard convension, please use CAN1_MO77_EDATA0.
*/
#define	CAN1_EMO77DATA0	(CAN1_MO77_EDATA0)

/** \brief  19A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO77_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00299A4u)

/** Alias (User Manual Name) for CAN1_MO77_EDATA1.
* To use register names with standard convension, please use CAN1_MO77_EDATA1.
*/
#define	CAN1_EMO77DATA1	(CAN1_MO77_EDATA1)

/** \brief  19A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO77_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00299A8u)

/** Alias (User Manual Name) for CAN1_MO77_EDATA2.
* To use register names with standard convension, please use CAN1_MO77_EDATA2.
*/
#define	CAN1_EMO77DATA2	(CAN1_MO77_EDATA2)

/** \brief  19AC, Message Object  Acceptance Mask Register */
#define CAN1_MO77_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00299ACu)

/** Alias (User Manual Name) for CAN1_MO77_EDATA3.
* To use register names with standard convension, please use CAN1_MO77_EDATA3.
*/
#define	CAN1_EMO77DATA3	(CAN1_MO77_EDATA3)

/** \brief  19B0, Message Object  Data Register Low */
#define CAN1_MO77_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00299B0u)

/** Alias (User Manual Name) for CAN1_MO77_EDATA4.
* To use register names with standard convension, please use CAN1_MO77_EDATA4.
*/
#define	CAN1_EMO77DATA4	(CAN1_MO77_EDATA4)

/** \brief  19B4, Message Object  Data Register High */
#define CAN1_MO77_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00299B4u)

/** Alias (User Manual Name) for CAN1_MO77_EDATA5.
* To use register names with standard convension, please use CAN1_MO77_EDATA5.
*/
#define	CAN1_EMO77DATA5	(CAN1_MO77_EDATA5)

/** \brief  19B8, Message Object  Arbitration Register */
#define CAN1_MO77_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00299B8u)

/** Alias (User Manual Name) for CAN1_MO77_EDATA6.
* To use register names with standard convension, please use CAN1_MO77_EDATA6.
*/
#define	CAN1_EMO77DATA6	(CAN1_MO77_EDATA6)

/** \brief  19A0, Message Object  Function Control Register */
#define CAN1_MO77_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00299A0u)

/** Alias (User Manual Name) for CAN1_MO77_FCR.
* To use register names with standard convension, please use CAN1_MO77_FCR.
*/
#define	CAN1_MOFCR77	(CAN1_MO77_FCR)

/** \brief  19A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO77_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00299A4u)

/** Alias (User Manual Name) for CAN1_MO77_FGPR.
* To use register names with standard convension, please use CAN1_MO77_FGPR.
*/
#define	CAN1_MOFGPR77	(CAN1_MO77_FGPR)

/** \brief  19A8, Message Object  Interrupt Pointer Register */
#define CAN1_MO77_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00299A8u)

/** Alias (User Manual Name) for CAN1_MO77_IPR.
* To use register names with standard convension, please use CAN1_MO77_IPR.
*/
#define	CAN1_MOIPR77	(CAN1_MO77_IPR)

/** \brief  19BC, Message Object  Control Register */
#define CAN1_MO77_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00299BCu)

/** Alias (User Manual Name) for CAN1_MO77_STAT.
* To use register names with standard convension, please use CAN1_MO77_STAT.
*/
#define	CAN1_MOSTAT77	(CAN1_MO77_STAT)

/** \brief  19CC, Message Object  Acceptance Mask Register */
#define CAN1_MO78_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00299CCu)

/** Alias (User Manual Name) for CAN1_MO78_AMR.
* To use register names with standard convension, please use CAN1_MO78_AMR.
*/
#define	CAN1_MOAMR78	(CAN1_MO78_AMR)

/** \brief  19D8, Message Object  Arbitration Register */
#define CAN1_MO78_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00299D8u)

/** Alias (User Manual Name) for CAN1_MO78_AR.
* To use register names with standard convension, please use CAN1_MO78_AR.
*/
#define	CAN1_MOAR78	(CAN1_MO78_AR)

