leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  19DC, Message Object  Control Register */
#define CAN1_MO78_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00299DCu)

/** Alias (User Manual Name) for CAN1_MO78_CTR.
* To use register names with standard convension, please use CAN1_MO78_CTR.
*/
#define	CAN1_MOCTR78	(CAN1_MO78_CTR)

/** \brief  19D4, Message Object  Data Register High */
#define CAN1_MO78_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00299D4u)

/** Alias (User Manual Name) for CAN1_MO78_DATAH.
* To use register names with standard convension, please use CAN1_MO78_DATAH.
*/
#define	CAN1_MODATAH78	(CAN1_MO78_DATAH)

/** \brief  19D0, Message Object  Data Register Low */
#define CAN1_MO78_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00299D0u)

/** Alias (User Manual Name) for CAN1_MO78_DATAL.
* To use register names with standard convension, please use CAN1_MO78_DATAL.
*/
#define	CAN1_MODATAL78	(CAN1_MO78_DATAL)

/** \brief  19C0, Message Object  Function Control Register */
#define CAN1_MO78_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00299C0u)

/** Alias (User Manual Name) for CAN1_MO78_EDATA0.
* To use register names with standard convension, please use CAN1_MO78_EDATA0.
*/
#define	CAN1_EMO78DATA0	(CAN1_MO78_EDATA0)

/** \brief  19C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO78_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00299C4u)

/** Alias (User Manual Name) for CAN1_MO78_EDATA1.
* To use register names with standard convension, please use CAN1_MO78_EDATA1.
*/
#define	CAN1_EMO78DATA1	(CAN1_MO78_EDATA1)

/** \brief  19C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO78_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00299C8u)

/** Alias (User Manual Name) for CAN1_MO78_EDATA2.
* To use register names with standard convension, please use CAN1_MO78_EDATA2.
*/
#define	CAN1_EMO78DATA2	(CAN1_MO78_EDATA2)

/** \brief  19CC, Message Object  Acceptance Mask Register */
#define CAN1_MO78_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00299CCu)

/** Alias (User Manual Name) for CAN1_MO78_EDATA3.
* To use register names with standard convension, please use CAN1_MO78_EDATA3.
*/
#define	CAN1_EMO78DATA3	(CAN1_MO78_EDATA3)

/** \brief  19D0, Message Object  Data Register Low */
#define CAN1_MO78_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00299D0u)

/** Alias (User Manual Name) for CAN1_MO78_EDATA4.
* To use register names with standard convension, please use CAN1_MO78_EDATA4.
*/
#define	CAN1_EMO78DATA4	(CAN1_MO78_EDATA4)

/** \brief  19D4, Message Object  Data Register High */
#define CAN1_MO78_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00299D4u)

/** Alias (User Manual Name) for CAN1_MO78_EDATA5.
* To use register names with standard convension, please use CAN1_MO78_EDATA5.
*/
#define	CAN1_EMO78DATA5	(CAN1_MO78_EDATA5)

/** \brief  19D8, Message Object  Arbitration Register */
#define CAN1_MO78_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00299D8u)

/** Alias (User Manual Name) for CAN1_MO78_EDATA6.
* To use register names with standard convension, please use CAN1_MO78_EDATA6.
*/
#define	CAN1_EMO78DATA6	(CAN1_MO78_EDATA6)

/** \brief  19C0, Message Object  Function Control Register */
#define CAN1_MO78_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00299C0u)

/** Alias (User Manual Name) for CAN1_MO78_FCR.
* To use register names with standard convension, please use CAN1_MO78_FCR.
*/
#define	CAN1_MOFCR78	(CAN1_MO78_FCR)

/** \brief  19C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO78_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00299C4u)

/** Alias (User Manual Name) for CAN1_MO78_FGPR.
* To use register names with standard convension, please use CAN1_MO78_FGPR.
*/
#define	CAN1_MOFGPR78	(CAN1_MO78_FGPR)

/** \brief  19C8, Message Object  Interrupt Pointer Register */
#define CAN1_MO78_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00299C8u)

/** Alias (User Manual Name) for CAN1_MO78_IPR.
* To use register names with standard convension, please use CAN1_MO78_IPR.
*/
#define	CAN1_MOIPR78	(CAN1_MO78_IPR)

/** \brief  19DC, Message Object  Control Register */
#define CAN1_MO78_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00299DCu)

/** Alias (User Manual Name) for CAN1_MO78_STAT.
* To use register names with standard convension, please use CAN1_MO78_STAT.
*/
#define	CAN1_MOSTAT78	(CAN1_MO78_STAT)

/** \brief  19EC, Message Object  Acceptance Mask Register */
#define CAN1_MO79_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00299ECu)

/** Alias (User Manual Name) for CAN1_MO79_AMR.
* To use register names with standard convension, please use CAN1_MO79_AMR.
*/
#define	CAN1_MOAMR79	(CAN1_MO79_AMR)

/** \brief  19F8, Message Object  Arbitration Register */
#define CAN1_MO79_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00299F8u)

/** Alias (User Manual Name) for CAN1_MO79_AR.
* To use register names with standard convension, please use CAN1_MO79_AR.
*/
#define	CAN1_MOAR79	(CAN1_MO79_AR)

/** \brief  19FC, Message Object  Control Register */
#define CAN1_MO79_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00299FCu)

/** Alias (User Manual Name) for CAN1_MO79_CTR.
* To use register names with standard convension, please use CAN1_MO79_CTR.
*/
#define	CAN1_MOCTR79	(CAN1_MO79_CTR)

/** \brief  19F4, Message Object  Data Register High */
#define CAN1_MO79_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00299F4u)

/** Alias (User Manual Name) for CAN1_MO79_DATAH.
* To use register names with standard convension, please use CAN1_MO79_DATAH.
*/
#define	CAN1_MODATAH79	(CAN1_MO79_DATAH)

/** \brief  19F0, Message Object  Data Register Low */
#define CAN1_MO79_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00299F0u)

/** Alias (User Manual Name) for CAN1_MO79_DATAL.
* To use register names with standard convension, please use CAN1_MO79_DATAL.
*/
#define	CAN1_MODATAL79	(CAN1_MO79_DATAL)

/** \brief  19E0, Message Object  Function Control Register */
#define CAN1_MO79_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00299E0u)

/** Alias (User Manual Name) for CAN1_MO79_EDATA0.
* To use register names with standard convension, please use CAN1_MO79_EDATA0.
*/
#define	CAN1_EMO79DATA0	(CAN1_MO79_EDATA0)

/** \brief  19E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO79_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00299E4u)

/** Alias (User Manual Name) for CAN1_MO79_EDATA1.
* To use register names with standard convension, please use CAN1_MO79_EDATA1.
*/
#define	CAN1_EMO79DATA1	(CAN1_MO79_EDATA1)

/** \brief  19E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO79_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00299E8u)

