leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO79_EDATA2.
* To use register names with standard convension, please use CAN1_MO79_EDATA2.
*/
#define	CAN1_EMO79DATA2	(CAN1_MO79_EDATA2)

/** \brief  19EC, Message Object  Acceptance Mask Register */
#define CAN1_MO79_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00299ECu)

/** Alias (User Manual Name) for CAN1_MO79_EDATA3.
* To use register names with standard convension, please use CAN1_MO79_EDATA3.
*/
#define	CAN1_EMO79DATA3	(CAN1_MO79_EDATA3)

/** \brief  19F0, Message Object  Data Register Low */
#define CAN1_MO79_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00299F0u)

/** Alias (User Manual Name) for CAN1_MO79_EDATA4.
* To use register names with standard convension, please use CAN1_MO79_EDATA4.
*/
#define	CAN1_EMO79DATA4	(CAN1_MO79_EDATA4)

/** \brief  19F4, Message Object  Data Register High */
#define CAN1_MO79_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00299F4u)

/** Alias (User Manual Name) for CAN1_MO79_EDATA5.
* To use register names with standard convension, please use CAN1_MO79_EDATA5.
*/
#define	CAN1_EMO79DATA5	(CAN1_MO79_EDATA5)

/** \brief  19F8, Message Object  Arbitration Register */
#define CAN1_MO79_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00299F8u)

/** Alias (User Manual Name) for CAN1_MO79_EDATA6.
* To use register names with standard convension, please use CAN1_MO79_EDATA6.
*/
#define	CAN1_EMO79DATA6	(CAN1_MO79_EDATA6)

/** \brief  19E0, Message Object  Function Control Register */
#define CAN1_MO79_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00299E0u)

/** Alias (User Manual Name) for CAN1_MO79_FCR.
* To use register names with standard convension, please use CAN1_MO79_FCR.
*/
#define	CAN1_MOFCR79	(CAN1_MO79_FCR)

/** \brief  19E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO79_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00299E4u)

/** Alias (User Manual Name) for CAN1_MO79_FGPR.
* To use register names with standard convension, please use CAN1_MO79_FGPR.
*/
#define	CAN1_MOFGPR79	(CAN1_MO79_FGPR)

/** \brief  19E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO79_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00299E8u)

/** Alias (User Manual Name) for CAN1_MO79_IPR.
* To use register names with standard convension, please use CAN1_MO79_IPR.
*/
#define	CAN1_MOIPR79	(CAN1_MO79_IPR)

/** \brief  19FC, Message Object  Control Register */
#define CAN1_MO79_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00299FCu)

/** Alias (User Manual Name) for CAN1_MO79_STAT.
* To use register names with standard convension, please use CAN1_MO79_STAT.
*/
#define	CAN1_MOSTAT79	(CAN1_MO79_STAT)

/** \brief  10EC, Message Object  Acceptance Mask Register */
#define CAN1_MO7_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00290ECu)

/** Alias (User Manual Name) for CAN1_MO7_AMR.
* To use register names with standard convension, please use CAN1_MO7_AMR.
*/
#define	CAN1_MOAMR7	(CAN1_MO7_AMR)

/** \brief  10F8, Message Object  Arbitration Register */
#define CAN1_MO7_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00290F8u)

/** Alias (User Manual Name) for CAN1_MO7_AR.
* To use register names with standard convension, please use CAN1_MO7_AR.
*/
#define	CAN1_MOAR7	(CAN1_MO7_AR)

/** \brief  10FC, Message Object  Control Register */
#define CAN1_MO7_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00290FCu)

/** Alias (User Manual Name) for CAN1_MO7_CTR.
* To use register names with standard convension, please use CAN1_MO7_CTR.
*/
#define	CAN1_MOCTR7	(CAN1_MO7_CTR)

/** \brief  10F4, Message Object  Data Register High */
#define CAN1_MO7_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00290F4u)

/** Alias (User Manual Name) for CAN1_MO7_DATAH.
* To use register names with standard convension, please use CAN1_MO7_DATAH.
*/
#define	CAN1_MODATAH7	(CAN1_MO7_DATAH)

/** \brief  10F0, Message Object  Data Register Low */
#define CAN1_MO7_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00290F0u)

/** Alias (User Manual Name) for CAN1_MO7_DATAL.
* To use register names with standard convension, please use CAN1_MO7_DATAL.
*/
#define	CAN1_MODATAL7	(CAN1_MO7_DATAL)

/** \brief  10E0, Message Object  Function Control Register */
#define CAN1_MO7_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00290E0u)

/** Alias (User Manual Name) for CAN1_MO7_EDATA0.
* To use register names with standard convension, please use CAN1_MO7_EDATA0.
*/
#define	CAN1_EMO7DATA0	(CAN1_MO7_EDATA0)

/** \brief  10E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO7_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00290E4u)

/** Alias (User Manual Name) for CAN1_MO7_EDATA1.
* To use register names with standard convension, please use CAN1_MO7_EDATA1.
*/
#define	CAN1_EMO7DATA1	(CAN1_MO7_EDATA1)

/** \brief  10E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO7_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00290E8u)

/** Alias (User Manual Name) for CAN1_MO7_EDATA2.
* To use register names with standard convension, please use CAN1_MO7_EDATA2.
*/
#define	CAN1_EMO7DATA2	(CAN1_MO7_EDATA2)

/** \brief  10EC, Message Object  Acceptance Mask Register */
#define CAN1_MO7_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00290ECu)

/** Alias (User Manual Name) for CAN1_MO7_EDATA3.
* To use register names with standard convension, please use CAN1_MO7_EDATA3.
*/
#define	CAN1_EMO7DATA3	(CAN1_MO7_EDATA3)

/** \brief  10F0, Message Object  Data Register Low */
#define CAN1_MO7_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00290F0u)

/** Alias (User Manual Name) for CAN1_MO7_EDATA4.
* To use register names with standard convension, please use CAN1_MO7_EDATA4.
*/
#define	CAN1_EMO7DATA4	(CAN1_MO7_EDATA4)

/** \brief  10F4, Message Object  Data Register High */
#define CAN1_MO7_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00290F4u)

/** Alias (User Manual Name) for CAN1_MO7_EDATA5.
* To use register names with standard convension, please use CAN1_MO7_EDATA5.
*/
#define	CAN1_EMO7DATA5	(CAN1_MO7_EDATA5)

/** \brief  10F8, Message Object  Arbitration Register */
#define CAN1_MO7_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00290F8u)

/** Alias (User Manual Name) for CAN1_MO7_EDATA6.
* To use register names with standard convension, please use CAN1_MO7_EDATA6.
*/
#define	CAN1_EMO7DATA6	(CAN1_MO7_EDATA6)

/** \brief  10E0, Message Object  Function Control Register */
#define CAN1_MO7_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00290E0u)

