leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO7_FCR.
* To use register names with standard convension, please use CAN1_MO7_FCR.
*/
#define	CAN1_MOFCR7	(CAN1_MO7_FCR)

/** \brief  10E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO7_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00290E4u)

/** Alias (User Manual Name) for CAN1_MO7_FGPR.
* To use register names with standard convension, please use CAN1_MO7_FGPR.
*/
#define	CAN1_MOFGPR7	(CAN1_MO7_FGPR)

/** \brief  10E8, Message Object  Interrupt Pointer Register */
#define CAN1_MO7_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00290E8u)

/** Alias (User Manual Name) for CAN1_MO7_IPR.
* To use register names with standard convension, please use CAN1_MO7_IPR.
*/
#define	CAN1_MOIPR7	(CAN1_MO7_IPR)

/** \brief  10FC, Message Object  Control Register */
#define CAN1_MO7_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00290FCu)

/** Alias (User Manual Name) for CAN1_MO7_STAT.
* To use register names with standard convension, please use CAN1_MO7_STAT.
*/
#define	CAN1_MOSTAT7	(CAN1_MO7_STAT)

/** \brief  1A0C, Message Object  Acceptance Mask Register */
#define CAN1_MO80_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A0Cu)

/** Alias (User Manual Name) for CAN1_MO80_AMR.
* To use register names with standard convension, please use CAN1_MO80_AMR.
*/
#define	CAN1_MOAMR80	(CAN1_MO80_AMR)

/** \brief  1A18, Message Object  Arbitration Register */
#define CAN1_MO80_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029A18u)

/** Alias (User Manual Name) for CAN1_MO80_AR.
* To use register names with standard convension, please use CAN1_MO80_AR.
*/
#define	CAN1_MOAR80	(CAN1_MO80_AR)

/** \brief  1A1C, Message Object  Control Register */
#define CAN1_MO80_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029A1Cu)

/** Alias (User Manual Name) for CAN1_MO80_CTR.
* To use register names with standard convension, please use CAN1_MO80_CTR.
*/
#define	CAN1_MOCTR80	(CAN1_MO80_CTR)

/** \brief  1A14, Message Object  Data Register High */
#define CAN1_MO80_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029A14u)

/** Alias (User Manual Name) for CAN1_MO80_DATAH.
* To use register names with standard convension, please use CAN1_MO80_DATAH.
*/
#define	CAN1_MODATAH80	(CAN1_MO80_DATAH)

/** \brief  1A10, Message Object  Data Register Low */
#define CAN1_MO80_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029A10u)

/** Alias (User Manual Name) for CAN1_MO80_DATAL.
* To use register names with standard convension, please use CAN1_MO80_DATAL.
*/
#define	CAN1_MODATAL80	(CAN1_MO80_DATAL)

/** \brief  1A00, Message Object  Function Control Register */
#define CAN1_MO80_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029A00u)

/** Alias (User Manual Name) for CAN1_MO80_EDATA0.
* To use register names with standard convension, please use CAN1_MO80_EDATA0.
*/
#define	CAN1_EMO80DATA0	(CAN1_MO80_EDATA0)

/** \brief  1A04, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO80_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029A04u)

/** Alias (User Manual Name) for CAN1_MO80_EDATA1.
* To use register names with standard convension, please use CAN1_MO80_EDATA1.
*/
#define	CAN1_EMO80DATA1	(CAN1_MO80_EDATA1)

/** \brief  1A08, Message Object  Interrupt Pointer Register */
#define CAN1_MO80_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029A08u)

/** Alias (User Manual Name) for CAN1_MO80_EDATA2.
* To use register names with standard convension, please use CAN1_MO80_EDATA2.
*/
#define	CAN1_EMO80DATA2	(CAN1_MO80_EDATA2)

/** \brief  1A0C, Message Object  Acceptance Mask Register */
#define CAN1_MO80_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029A0Cu)

/** Alias (User Manual Name) for CAN1_MO80_EDATA3.
* To use register names with standard convension, please use CAN1_MO80_EDATA3.
*/
#define	CAN1_EMO80DATA3	(CAN1_MO80_EDATA3)

/** \brief  1A10, Message Object  Data Register Low */
#define CAN1_MO80_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029A10u)

/** Alias (User Manual Name) for CAN1_MO80_EDATA4.
* To use register names with standard convension, please use CAN1_MO80_EDATA4.
*/
#define	CAN1_EMO80DATA4	(CAN1_MO80_EDATA4)

/** \brief  1A14, Message Object  Data Register High */
#define CAN1_MO80_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029A14u)

/** Alias (User Manual Name) for CAN1_MO80_EDATA5.
* To use register names with standard convension, please use CAN1_MO80_EDATA5.
*/
#define	CAN1_EMO80DATA5	(CAN1_MO80_EDATA5)

/** \brief  1A18, Message Object  Arbitration Register */
#define CAN1_MO80_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029A18u)

/** Alias (User Manual Name) for CAN1_MO80_EDATA6.
* To use register names with standard convension, please use CAN1_MO80_EDATA6.
*/
#define	CAN1_EMO80DATA6	(CAN1_MO80_EDATA6)

/** \brief  1A00, Message Object  Function Control Register */
#define CAN1_MO80_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A00u)

/** Alias (User Manual Name) for CAN1_MO80_FCR.
* To use register names with standard convension, please use CAN1_MO80_FCR.
*/
#define	CAN1_MOFCR80	(CAN1_MO80_FCR)

/** \brief  1A04, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO80_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029A04u)

/** Alias (User Manual Name) for CAN1_MO80_FGPR.
* To use register names with standard convension, please use CAN1_MO80_FGPR.
*/
#define	CAN1_MOFGPR80	(CAN1_MO80_FGPR)

/** \brief  1A08, Message Object  Interrupt Pointer Register */
#define CAN1_MO80_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029A08u)

/** Alias (User Manual Name) for CAN1_MO80_IPR.
* To use register names with standard convension, please use CAN1_MO80_IPR.
*/
#define	CAN1_MOIPR80	(CAN1_MO80_IPR)

/** \brief  1A1C, Message Object  Control Register */
#define CAN1_MO80_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029A1Cu)

/** Alias (User Manual Name) for CAN1_MO80_STAT.
* To use register names with standard convension, please use CAN1_MO80_STAT.
*/
#define	CAN1_MOSTAT80	(CAN1_MO80_STAT)

/** \brief  1A2C, Message Object  Acceptance Mask Register */
#define CAN1_MO81_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A2Cu)

/** Alias (User Manual Name) for CAN1_MO81_AMR.
* To use register names with standard convension, please use CAN1_MO81_AMR.
*/
#define	CAN1_MOAMR81	(CAN1_MO81_AMR)

