leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1A48, Message Object  Interrupt Pointer Register */
#define CAN1_MO82_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029A48u)

/** Alias (User Manual Name) for CAN1_MO82_EDATA2.
* To use register names with standard convension, please use CAN1_MO82_EDATA2.
*/
#define	CAN1_EMO82DATA2	(CAN1_MO82_EDATA2)

/** \brief  1A4C, Message Object  Acceptance Mask Register */
#define CAN1_MO82_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029A4Cu)

/** Alias (User Manual Name) for CAN1_MO82_EDATA3.
* To use register names with standard convension, please use CAN1_MO82_EDATA3.
*/
#define	CAN1_EMO82DATA3	(CAN1_MO82_EDATA3)

/** \brief  1A50, Message Object  Data Register Low */
#define CAN1_MO82_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029A50u)

/** Alias (User Manual Name) for CAN1_MO82_EDATA4.
* To use register names with standard convension, please use CAN1_MO82_EDATA4.
*/
#define	CAN1_EMO82DATA4	(CAN1_MO82_EDATA4)

/** \brief  1A54, Message Object  Data Register High */
#define CAN1_MO82_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029A54u)

/** Alias (User Manual Name) for CAN1_MO82_EDATA5.
* To use register names with standard convension, please use CAN1_MO82_EDATA5.
*/
#define	CAN1_EMO82DATA5	(CAN1_MO82_EDATA5)

/** \brief  1A58, Message Object  Arbitration Register */
#define CAN1_MO82_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029A58u)

/** Alias (User Manual Name) for CAN1_MO82_EDATA6.
* To use register names with standard convension, please use CAN1_MO82_EDATA6.
*/
#define	CAN1_EMO82DATA6	(CAN1_MO82_EDATA6)

/** \brief  1A40, Message Object  Function Control Register */
#define CAN1_MO82_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A40u)

/** Alias (User Manual Name) for CAN1_MO82_FCR.
* To use register names with standard convension, please use CAN1_MO82_FCR.
*/
#define	CAN1_MOFCR82	(CAN1_MO82_FCR)

/** \brief  1A44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO82_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029A44u)

/** Alias (User Manual Name) for CAN1_MO82_FGPR.
* To use register names with standard convension, please use CAN1_MO82_FGPR.
*/
#define	CAN1_MOFGPR82	(CAN1_MO82_FGPR)

/** \brief  1A48, Message Object  Interrupt Pointer Register */
#define CAN1_MO82_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029A48u)

/** Alias (User Manual Name) for CAN1_MO82_IPR.
* To use register names with standard convension, please use CAN1_MO82_IPR.
*/
#define	CAN1_MOIPR82	(CAN1_MO82_IPR)

/** \brief  1A5C, Message Object  Control Register */
#define CAN1_MO82_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029A5Cu)

/** Alias (User Manual Name) for CAN1_MO82_STAT.
* To use register names with standard convension, please use CAN1_MO82_STAT.
*/
#define	CAN1_MOSTAT82	(CAN1_MO82_STAT)

/** \brief  1A6C, Message Object  Acceptance Mask Register */
#define CAN1_MO83_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A6Cu)

/** Alias (User Manual Name) for CAN1_MO83_AMR.
* To use register names with standard convension, please use CAN1_MO83_AMR.
*/
#define	CAN1_MOAMR83	(CAN1_MO83_AMR)

/** \brief  1A78, Message Object  Arbitration Register */
#define CAN1_MO83_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029A78u)

/** Alias (User Manual Name) for CAN1_MO83_AR.
* To use register names with standard convension, please use CAN1_MO83_AR.
*/
#define	CAN1_MOAR83	(CAN1_MO83_AR)

/** \brief  1A7C, Message Object  Control Register */
#define CAN1_MO83_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029A7Cu)

/** Alias (User Manual Name) for CAN1_MO83_CTR.
* To use register names with standard convension, please use CAN1_MO83_CTR.
*/
#define	CAN1_MOCTR83	(CAN1_MO83_CTR)

/** \brief  1A74, Message Object  Data Register High */
#define CAN1_MO83_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029A74u)

/** Alias (User Manual Name) for CAN1_MO83_DATAH.
* To use register names with standard convension, please use CAN1_MO83_DATAH.
*/
#define	CAN1_MODATAH83	(CAN1_MO83_DATAH)

/** \brief  1A70, Message Object  Data Register Low */
#define CAN1_MO83_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029A70u)

/** Alias (User Manual Name) for CAN1_MO83_DATAL.
* To use register names with standard convension, please use CAN1_MO83_DATAL.
*/
#define	CAN1_MODATAL83	(CAN1_MO83_DATAL)

/** \brief  1A60, Message Object  Function Control Register */
#define CAN1_MO83_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029A60u)

/** Alias (User Manual Name) for CAN1_MO83_EDATA0.
* To use register names with standard convension, please use CAN1_MO83_EDATA0.
*/
#define	CAN1_EMO83DATA0	(CAN1_MO83_EDATA0)

/** \brief  1A64, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO83_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029A64u)

/** Alias (User Manual Name) for CAN1_MO83_EDATA1.
* To use register names with standard convension, please use CAN1_MO83_EDATA1.
*/
#define	CAN1_EMO83DATA1	(CAN1_MO83_EDATA1)

/** \brief  1A68, Message Object  Interrupt Pointer Register */
#define CAN1_MO83_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029A68u)

/** Alias (User Manual Name) for CAN1_MO83_EDATA2.
* To use register names with standard convension, please use CAN1_MO83_EDATA2.
*/
#define	CAN1_EMO83DATA2	(CAN1_MO83_EDATA2)

/** \brief  1A6C, Message Object  Acceptance Mask Register */
#define CAN1_MO83_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029A6Cu)

/** Alias (User Manual Name) for CAN1_MO83_EDATA3.
* To use register names with standard convension, please use CAN1_MO83_EDATA3.
*/
#define	CAN1_EMO83DATA3	(CAN1_MO83_EDATA3)

/** \brief  1A70, Message Object  Data Register Low */
#define CAN1_MO83_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029A70u)

/** Alias (User Manual Name) for CAN1_MO83_EDATA4.
* To use register names with standard convension, please use CAN1_MO83_EDATA4.
*/
#define	CAN1_EMO83DATA4	(CAN1_MO83_EDATA4)

