leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1A74, Message Object  Data Register High */
#define CAN1_MO83_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029A74u)

/** Alias (User Manual Name) for CAN1_MO83_EDATA5.
* To use register names with standard convension, please use CAN1_MO83_EDATA5.
*/
#define	CAN1_EMO83DATA5	(CAN1_MO83_EDATA5)

/** \brief  1A78, Message Object  Arbitration Register */
#define CAN1_MO83_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029A78u)

/** Alias (User Manual Name) for CAN1_MO83_EDATA6.
* To use register names with standard convension, please use CAN1_MO83_EDATA6.
*/
#define	CAN1_EMO83DATA6	(CAN1_MO83_EDATA6)

/** \brief  1A60, Message Object  Function Control Register */
#define CAN1_MO83_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A60u)

/** Alias (User Manual Name) for CAN1_MO83_FCR.
* To use register names with standard convension, please use CAN1_MO83_FCR.
*/
#define	CAN1_MOFCR83	(CAN1_MO83_FCR)

/** \brief  1A64, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO83_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029A64u)

/** Alias (User Manual Name) for CAN1_MO83_FGPR.
* To use register names with standard convension, please use CAN1_MO83_FGPR.
*/
#define	CAN1_MOFGPR83	(CAN1_MO83_FGPR)

/** \brief  1A68, Message Object  Interrupt Pointer Register */
#define CAN1_MO83_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029A68u)

/** Alias (User Manual Name) for CAN1_MO83_IPR.
* To use register names with standard convension, please use CAN1_MO83_IPR.
*/
#define	CAN1_MOIPR83	(CAN1_MO83_IPR)

/** \brief  1A7C, Message Object  Control Register */
#define CAN1_MO83_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029A7Cu)

/** Alias (User Manual Name) for CAN1_MO83_STAT.
* To use register names with standard convension, please use CAN1_MO83_STAT.
*/
#define	CAN1_MOSTAT83	(CAN1_MO83_STAT)

/** \brief  1A8C, Message Object  Acceptance Mask Register */
#define CAN1_MO84_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A8Cu)

/** Alias (User Manual Name) for CAN1_MO84_AMR.
* To use register names with standard convension, please use CAN1_MO84_AMR.
*/
#define	CAN1_MOAMR84	(CAN1_MO84_AMR)

/** \brief  1A98, Message Object  Arbitration Register */
#define CAN1_MO84_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029A98u)

/** Alias (User Manual Name) for CAN1_MO84_AR.
* To use register names with standard convension, please use CAN1_MO84_AR.
*/
#define	CAN1_MOAR84	(CAN1_MO84_AR)

/** \brief  1A9C, Message Object  Control Register */
#define CAN1_MO84_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029A9Cu)

/** Alias (User Manual Name) for CAN1_MO84_CTR.
* To use register names with standard convension, please use CAN1_MO84_CTR.
*/
#define	CAN1_MOCTR84	(CAN1_MO84_CTR)

/** \brief  1A94, Message Object  Data Register High */
#define CAN1_MO84_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029A94u)

/** Alias (User Manual Name) for CAN1_MO84_DATAH.
* To use register names with standard convension, please use CAN1_MO84_DATAH.
*/
#define	CAN1_MODATAH84	(CAN1_MO84_DATAH)

/** \brief  1A90, Message Object  Data Register Low */
#define CAN1_MO84_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029A90u)

/** Alias (User Manual Name) for CAN1_MO84_DATAL.
* To use register names with standard convension, please use CAN1_MO84_DATAL.
*/
#define	CAN1_MODATAL84	(CAN1_MO84_DATAL)

/** \brief  1A80, Message Object  Function Control Register */
#define CAN1_MO84_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029A80u)

/** Alias (User Manual Name) for CAN1_MO84_EDATA0.
* To use register names with standard convension, please use CAN1_MO84_EDATA0.
*/
#define	CAN1_EMO84DATA0	(CAN1_MO84_EDATA0)

/** \brief  1A84, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO84_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029A84u)

/** Alias (User Manual Name) for CAN1_MO84_EDATA1.
* To use register names with standard convension, please use CAN1_MO84_EDATA1.
*/
#define	CAN1_EMO84DATA1	(CAN1_MO84_EDATA1)

/** \brief  1A88, Message Object  Interrupt Pointer Register */
#define CAN1_MO84_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029A88u)

/** Alias (User Manual Name) for CAN1_MO84_EDATA2.
* To use register names with standard convension, please use CAN1_MO84_EDATA2.
*/
#define	CAN1_EMO84DATA2	(CAN1_MO84_EDATA2)

/** \brief  1A8C, Message Object  Acceptance Mask Register */
#define CAN1_MO84_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029A8Cu)

/** Alias (User Manual Name) for CAN1_MO84_EDATA3.
* To use register names with standard convension, please use CAN1_MO84_EDATA3.
*/
#define	CAN1_EMO84DATA3	(CAN1_MO84_EDATA3)

/** \brief  1A90, Message Object  Data Register Low */
#define CAN1_MO84_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029A90u)

/** Alias (User Manual Name) for CAN1_MO84_EDATA4.
* To use register names with standard convension, please use CAN1_MO84_EDATA4.
*/
#define	CAN1_EMO84DATA4	(CAN1_MO84_EDATA4)

/** \brief  1A94, Message Object  Data Register High */
#define CAN1_MO84_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029A94u)

/** Alias (User Manual Name) for CAN1_MO84_EDATA5.
* To use register names with standard convension, please use CAN1_MO84_EDATA5.
*/
#define	CAN1_EMO84DATA5	(CAN1_MO84_EDATA5)

/** \brief  1A98, Message Object  Arbitration Register */
#define CAN1_MO84_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029A98u)

/** Alias (User Manual Name) for CAN1_MO84_EDATA6.
* To use register names with standard convension, please use CAN1_MO84_EDATA6.
*/
#define	CAN1_EMO84DATA6	(CAN1_MO84_EDATA6)

/** \brief  1A80, Message Object  Function Control Register */
#define CAN1_MO84_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A80u)

/** Alias (User Manual Name) for CAN1_MO84_FCR.
* To use register names with standard convension, please use CAN1_MO84_FCR.
*/
#define	CAN1_MOFCR84	(CAN1_MO84_FCR)

