leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1AD8, Message Object  Arbitration Register */
#define CAN1_MO86_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029AD8u)

/** Alias (User Manual Name) for CAN1_MO86_AR.
* To use register names with standard convension, please use CAN1_MO86_AR.
*/
#define	CAN1_MOAR86	(CAN1_MO86_AR)

/** \brief  1ADC, Message Object  Control Register */
#define CAN1_MO86_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029ADCu)

/** Alias (User Manual Name) for CAN1_MO86_CTR.
* To use register names with standard convension, please use CAN1_MO86_CTR.
*/
#define	CAN1_MOCTR86	(CAN1_MO86_CTR)

/** \brief  1AD4, Message Object  Data Register High */
#define CAN1_MO86_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029AD4u)

/** Alias (User Manual Name) for CAN1_MO86_DATAH.
* To use register names with standard convension, please use CAN1_MO86_DATAH.
*/
#define	CAN1_MODATAH86	(CAN1_MO86_DATAH)

/** \brief  1AD0, Message Object  Data Register Low */
#define CAN1_MO86_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029AD0u)

/** Alias (User Manual Name) for CAN1_MO86_DATAL.
* To use register names with standard convension, please use CAN1_MO86_DATAL.
*/
#define	CAN1_MODATAL86	(CAN1_MO86_DATAL)

/** \brief  1AC0, Message Object  Function Control Register */
#define CAN1_MO86_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029AC0u)

/** Alias (User Manual Name) for CAN1_MO86_EDATA0.
* To use register names with standard convension, please use CAN1_MO86_EDATA0.
*/
#define	CAN1_EMO86DATA0	(CAN1_MO86_EDATA0)

/** \brief  1AC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO86_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029AC4u)

/** Alias (User Manual Name) for CAN1_MO86_EDATA1.
* To use register names with standard convension, please use CAN1_MO86_EDATA1.
*/
#define	CAN1_EMO86DATA1	(CAN1_MO86_EDATA1)

/** \brief  1AC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO86_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029AC8u)

/** Alias (User Manual Name) for CAN1_MO86_EDATA2.
* To use register names with standard convension, please use CAN1_MO86_EDATA2.
*/
#define	CAN1_EMO86DATA2	(CAN1_MO86_EDATA2)

/** \brief  1ACC, Message Object  Acceptance Mask Register */
#define CAN1_MO86_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029ACCu)

/** Alias (User Manual Name) for CAN1_MO86_EDATA3.
* To use register names with standard convension, please use CAN1_MO86_EDATA3.
*/
#define	CAN1_EMO86DATA3	(CAN1_MO86_EDATA3)

/** \brief  1AD0, Message Object  Data Register Low */
#define CAN1_MO86_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029AD0u)

/** Alias (User Manual Name) for CAN1_MO86_EDATA4.
* To use register names with standard convension, please use CAN1_MO86_EDATA4.
*/
#define	CAN1_EMO86DATA4	(CAN1_MO86_EDATA4)

/** \brief  1AD4, Message Object  Data Register High */
#define CAN1_MO86_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029AD4u)

/** Alias (User Manual Name) for CAN1_MO86_EDATA5.
* To use register names with standard convension, please use CAN1_MO86_EDATA5.
*/
#define	CAN1_EMO86DATA5	(CAN1_MO86_EDATA5)

/** \brief  1AD8, Message Object  Arbitration Register */
#define CAN1_MO86_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029AD8u)

/** Alias (User Manual Name) for CAN1_MO86_EDATA6.
* To use register names with standard convension, please use CAN1_MO86_EDATA6.
*/
#define	CAN1_EMO86DATA6	(CAN1_MO86_EDATA6)

/** \brief  1AC0, Message Object  Function Control Register */
#define CAN1_MO86_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029AC0u)

/** Alias (User Manual Name) for CAN1_MO86_FCR.
* To use register names with standard convension, please use CAN1_MO86_FCR.
*/
#define	CAN1_MOFCR86	(CAN1_MO86_FCR)

/** \brief  1AC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO86_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029AC4u)

/** Alias (User Manual Name) for CAN1_MO86_FGPR.
* To use register names with standard convension, please use CAN1_MO86_FGPR.
*/
#define	CAN1_MOFGPR86	(CAN1_MO86_FGPR)

/** \brief  1AC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO86_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029AC8u)

/** Alias (User Manual Name) for CAN1_MO86_IPR.
* To use register names with standard convension, please use CAN1_MO86_IPR.
*/
#define	CAN1_MOIPR86	(CAN1_MO86_IPR)

/** \brief  1ADC, Message Object  Control Register */
#define CAN1_MO86_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029ADCu)

/** Alias (User Manual Name) for CAN1_MO86_STAT.
* To use register names with standard convension, please use CAN1_MO86_STAT.
*/
#define	CAN1_MOSTAT86	(CAN1_MO86_STAT)

/** \brief  1AEC, Message Object  Acceptance Mask Register */
#define CAN1_MO87_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029AECu)

/** Alias (User Manual Name) for CAN1_MO87_AMR.
* To use register names with standard convension, please use CAN1_MO87_AMR.
*/
#define	CAN1_MOAMR87	(CAN1_MO87_AMR)

/** \brief  1AF8, Message Object  Arbitration Register */
#define CAN1_MO87_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029AF8u)

/** Alias (User Manual Name) for CAN1_MO87_AR.
* To use register names with standard convension, please use CAN1_MO87_AR.
*/
#define	CAN1_MOAR87	(CAN1_MO87_AR)

/** \brief  1AFC, Message Object  Control Register */
#define CAN1_MO87_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029AFCu)

/** Alias (User Manual Name) for CAN1_MO87_CTR.
* To use register names with standard convension, please use CAN1_MO87_CTR.
*/
#define	CAN1_MOCTR87	(CAN1_MO87_CTR)

/** \brief  1AF4, Message Object  Data Register High */
#define CAN1_MO87_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029AF4u)

/** Alias (User Manual Name) for CAN1_MO87_DATAH.
* To use register names with standard convension, please use CAN1_MO87_DATAH.
*/
#define	CAN1_MODATAH87	(CAN1_MO87_DATAH)

/** \brief  1AF0, Message Object  Data Register Low */
#define CAN1_MO87_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029AF0u)

/** Alias (User Manual Name) for CAN1_MO87_DATAL.
* To use register names with standard convension, please use CAN1_MO87_DATAL.
*/
#define	CAN1_MODATAL87	(CAN1_MO87_DATAL)

/** \brief  1AE0, Message Object  Function Control Register */
#define CAN1_MO87_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029AE0u)

/** Alias (User Manual Name) for CAN1_MO87_EDATA0.
* To use register names with standard convension, please use CAN1_MO87_EDATA0.
*/
#define	CAN1_EMO87DATA0	(CAN1_MO87_EDATA0)

/** \brief  1AE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO87_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029AE4u)

