leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO87_EDATA1.
* To use register names with standard convension, please use CAN1_MO87_EDATA1.
*/
#define	CAN1_EMO87DATA1	(CAN1_MO87_EDATA1)

/** \brief  1AE8, Message Object  Interrupt Pointer Register */
#define CAN1_MO87_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029AE8u)

/** Alias (User Manual Name) for CAN1_MO87_EDATA2.
* To use register names with standard convension, please use CAN1_MO87_EDATA2.
*/
#define	CAN1_EMO87DATA2	(CAN1_MO87_EDATA2)

/** \brief  1AEC, Message Object  Acceptance Mask Register */
#define CAN1_MO87_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029AECu)

/** Alias (User Manual Name) for CAN1_MO87_EDATA3.
* To use register names with standard convension, please use CAN1_MO87_EDATA3.
*/
#define	CAN1_EMO87DATA3	(CAN1_MO87_EDATA3)

/** \brief  1AF0, Message Object  Data Register Low */
#define CAN1_MO87_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029AF0u)

/** Alias (User Manual Name) for CAN1_MO87_EDATA4.
* To use register names with standard convension, please use CAN1_MO87_EDATA4.
*/
#define	CAN1_EMO87DATA4	(CAN1_MO87_EDATA4)

/** \brief  1AF4, Message Object  Data Register High */
#define CAN1_MO87_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029AF4u)

/** Alias (User Manual Name) for CAN1_MO87_EDATA5.
* To use register names with standard convension, please use CAN1_MO87_EDATA5.
*/
#define	CAN1_EMO87DATA5	(CAN1_MO87_EDATA5)

/** \brief  1AF8, Message Object  Arbitration Register */
#define CAN1_MO87_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029AF8u)

/** Alias (User Manual Name) for CAN1_MO87_EDATA6.
* To use register names with standard convension, please use CAN1_MO87_EDATA6.
*/
#define	CAN1_EMO87DATA6	(CAN1_MO87_EDATA6)

/** \brief  1AE0, Message Object  Function Control Register */
#define CAN1_MO87_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029AE0u)

/** Alias (User Manual Name) for CAN1_MO87_FCR.
* To use register names with standard convension, please use CAN1_MO87_FCR.
*/
#define	CAN1_MOFCR87	(CAN1_MO87_FCR)

/** \brief  1AE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO87_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029AE4u)

/** Alias (User Manual Name) for CAN1_MO87_FGPR.
* To use register names with standard convension, please use CAN1_MO87_FGPR.
*/
#define	CAN1_MOFGPR87	(CAN1_MO87_FGPR)

/** \brief  1AE8, Message Object  Interrupt Pointer Register */
#define CAN1_MO87_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029AE8u)

/** Alias (User Manual Name) for CAN1_MO87_IPR.
* To use register names with standard convension, please use CAN1_MO87_IPR.
*/
#define	CAN1_MOIPR87	(CAN1_MO87_IPR)

/** \brief  1AFC, Message Object  Control Register */
#define CAN1_MO87_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029AFCu)

/** Alias (User Manual Name) for CAN1_MO87_STAT.
* To use register names with standard convension, please use CAN1_MO87_STAT.
*/
#define	CAN1_MOSTAT87	(CAN1_MO87_STAT)

/** \brief  1B0C, Message Object  Acceptance Mask Register */
#define CAN1_MO88_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029B0Cu)

/** Alias (User Manual Name) for CAN1_MO88_AMR.
* To use register names with standard convension, please use CAN1_MO88_AMR.
*/
#define	CAN1_MOAMR88	(CAN1_MO88_AMR)

/** \brief  1B18, Message Object  Arbitration Register */
#define CAN1_MO88_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029B18u)

/** Alias (User Manual Name) for CAN1_MO88_AR.
* To use register names with standard convension, please use CAN1_MO88_AR.
*/
#define	CAN1_MOAR88	(CAN1_MO88_AR)

/** \brief  1B1C, Message Object  Control Register */
#define CAN1_MO88_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029B1Cu)

/** Alias (User Manual Name) for CAN1_MO88_CTR.
* To use register names with standard convension, please use CAN1_MO88_CTR.
*/
#define	CAN1_MOCTR88	(CAN1_MO88_CTR)

/** \brief  1B14, Message Object  Data Register High */
#define CAN1_MO88_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029B14u)

/** Alias (User Manual Name) for CAN1_MO88_DATAH.
* To use register names with standard convension, please use CAN1_MO88_DATAH.
*/
#define	CAN1_MODATAH88	(CAN1_MO88_DATAH)

/** \brief  1B10, Message Object  Data Register Low */
#define CAN1_MO88_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029B10u)

/** Alias (User Manual Name) for CAN1_MO88_DATAL.
* To use register names with standard convension, please use CAN1_MO88_DATAL.
*/
#define	CAN1_MODATAL88	(CAN1_MO88_DATAL)

/** \brief  1B00, Message Object  Function Control Register */
#define CAN1_MO88_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029B00u)

/** Alias (User Manual Name) for CAN1_MO88_EDATA0.
* To use register names with standard convension, please use CAN1_MO88_EDATA0.
*/
#define	CAN1_EMO88DATA0	(CAN1_MO88_EDATA0)

/** \brief  1B04, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO88_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029B04u)

/** Alias (User Manual Name) for CAN1_MO88_EDATA1.
* To use register names with standard convension, please use CAN1_MO88_EDATA1.
*/
#define	CAN1_EMO88DATA1	(CAN1_MO88_EDATA1)

/** \brief  1B08, Message Object  Interrupt Pointer Register */
#define CAN1_MO88_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029B08u)

/** Alias (User Manual Name) for CAN1_MO88_EDATA2.
* To use register names with standard convension, please use CAN1_MO88_EDATA2.
*/
#define	CAN1_EMO88DATA2	(CAN1_MO88_EDATA2)

/** \brief  1B0C, Message Object  Acceptance Mask Register */
#define CAN1_MO88_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029B0Cu)

/** Alias (User Manual Name) for CAN1_MO88_EDATA3.
* To use register names with standard convension, please use CAN1_MO88_EDATA3.
*/
#define	CAN1_EMO88DATA3	(CAN1_MO88_EDATA3)

/** \brief  1B10, Message Object  Data Register Low */
#define CAN1_MO88_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029B10u)

