leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO89_FCR.
* To use register names with standard convension, please use CAN1_MO89_FCR.
*/
#define	CAN1_MOFCR89	(CAN1_MO89_FCR)

/** \brief  1B24, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO89_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029B24u)

/** Alias (User Manual Name) for CAN1_MO89_FGPR.
* To use register names with standard convension, please use CAN1_MO89_FGPR.
*/
#define	CAN1_MOFGPR89	(CAN1_MO89_FGPR)

/** \brief  1B28, Message Object  Interrupt Pointer Register */
#define CAN1_MO89_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029B28u)

/** Alias (User Manual Name) for CAN1_MO89_IPR.
* To use register names with standard convension, please use CAN1_MO89_IPR.
*/
#define	CAN1_MOIPR89	(CAN1_MO89_IPR)

/** \brief  1B3C, Message Object  Control Register */
#define CAN1_MO89_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029B3Cu)

/** Alias (User Manual Name) for CAN1_MO89_STAT.
* To use register names with standard convension, please use CAN1_MO89_STAT.
*/
#define	CAN1_MOSTAT89	(CAN1_MO89_STAT)

/** \brief  110C, Message Object  Acceptance Mask Register */
#define CAN1_MO8_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002910Cu)

/** Alias (User Manual Name) for CAN1_MO8_AMR.
* To use register names with standard convension, please use CAN1_MO8_AMR.
*/
#define	CAN1_MOAMR8	(CAN1_MO8_AMR)

/** \brief  1118, Message Object  Arbitration Register */
#define CAN1_MO8_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029118u)

/** Alias (User Manual Name) for CAN1_MO8_AR.
* To use register names with standard convension, please use CAN1_MO8_AR.
*/
#define	CAN1_MOAR8	(CAN1_MO8_AR)

/** \brief  111C, Message Object  Control Register */
#define CAN1_MO8_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002911Cu)

/** Alias (User Manual Name) for CAN1_MO8_CTR.
* To use register names with standard convension, please use CAN1_MO8_CTR.
*/
#define	CAN1_MOCTR8	(CAN1_MO8_CTR)

/** \brief  1114, Message Object  Data Register High */
#define CAN1_MO8_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029114u)

/** Alias (User Manual Name) for CAN1_MO8_DATAH.
* To use register names with standard convension, please use CAN1_MO8_DATAH.
*/
#define	CAN1_MODATAH8	(CAN1_MO8_DATAH)

/** \brief  1110, Message Object  Data Register Low */
#define CAN1_MO8_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029110u)

/** Alias (User Manual Name) for CAN1_MO8_DATAL.
* To use register names with standard convension, please use CAN1_MO8_DATAL.
*/
#define	CAN1_MODATAL8	(CAN1_MO8_DATAL)

/** \brief  1100, Message Object  Function Control Register */
#define CAN1_MO8_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029100u)

/** Alias (User Manual Name) for CAN1_MO8_EDATA0.
* To use register names with standard convension, please use CAN1_MO8_EDATA0.
*/
#define	CAN1_EMO8DATA0	(CAN1_MO8_EDATA0)

/** \brief  1104, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO8_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029104u)

/** Alias (User Manual Name) for CAN1_MO8_EDATA1.
* To use register names with standard convension, please use CAN1_MO8_EDATA1.
*/
#define	CAN1_EMO8DATA1	(CAN1_MO8_EDATA1)

/** \brief  1108, Message Object  Interrupt Pointer Register */
#define CAN1_MO8_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029108u)

/** Alias (User Manual Name) for CAN1_MO8_EDATA2.
* To use register names with standard convension, please use CAN1_MO8_EDATA2.
*/
#define	CAN1_EMO8DATA2	(CAN1_MO8_EDATA2)

/** \brief  110C, Message Object  Acceptance Mask Register */
#define CAN1_MO8_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002910Cu)

/** Alias (User Manual Name) for CAN1_MO8_EDATA3.
* To use register names with standard convension, please use CAN1_MO8_EDATA3.
*/
#define	CAN1_EMO8DATA3	(CAN1_MO8_EDATA3)

/** \brief  1110, Message Object  Data Register Low */
#define CAN1_MO8_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029110u)

/** Alias (User Manual Name) for CAN1_MO8_EDATA4.
* To use register names with standard convension, please use CAN1_MO8_EDATA4.
*/
#define	CAN1_EMO8DATA4	(CAN1_MO8_EDATA4)

/** \brief  1114, Message Object  Data Register High */
#define CAN1_MO8_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029114u)

/** Alias (User Manual Name) for CAN1_MO8_EDATA5.
* To use register names with standard convension, please use CAN1_MO8_EDATA5.
*/
#define	CAN1_EMO8DATA5	(CAN1_MO8_EDATA5)

/** \brief  1118, Message Object  Arbitration Register */
#define CAN1_MO8_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029118u)

/** Alias (User Manual Name) for CAN1_MO8_EDATA6.
* To use register names with standard convension, please use CAN1_MO8_EDATA6.
*/
#define	CAN1_EMO8DATA6	(CAN1_MO8_EDATA6)

/** \brief  1100, Message Object  Function Control Register */
#define CAN1_MO8_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029100u)

/** Alias (User Manual Name) for CAN1_MO8_FCR.
* To use register names with standard convension, please use CAN1_MO8_FCR.
*/
#define	CAN1_MOFCR8	(CAN1_MO8_FCR)

/** \brief  1104, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO8_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029104u)

/** Alias (User Manual Name) for CAN1_MO8_FGPR.
* To use register names with standard convension, please use CAN1_MO8_FGPR.
*/
#define	CAN1_MOFGPR8	(CAN1_MO8_FGPR)

/** \brief  1108, Message Object  Interrupt Pointer Register */
#define CAN1_MO8_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029108u)

/** Alias (User Manual Name) for CAN1_MO8_IPR.
* To use register names with standard convension, please use CAN1_MO8_IPR.
*/
#define	CAN1_MOIPR8	(CAN1_MO8_IPR)

/** \brief  111C, Message Object  Control Register */
#define CAN1_MO8_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002911Cu)

/** Alias (User Manual Name) for CAN1_MO8_STAT.
* To use register names with standard convension, please use CAN1_MO8_STAT.
*/
#define	CAN1_MOSTAT8	(CAN1_MO8_STAT)

/** \brief  1B4C, Message Object  Acceptance Mask Register */
#define CAN1_MO90_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029B4Cu)

/** Alias (User Manual Name) for CAN1_MO90_AMR.
* To use register names with standard convension, please use CAN1_MO90_AMR.
*/
#define	CAN1_MOAMR90	(CAN1_MO90_AMR)

/** \brief  1B58, Message Object  Arbitration Register */
#define CAN1_MO90_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029B58u)

/** Alias (User Manual Name) for CAN1_MO90_AR.
* To use register names with standard convension, please use CAN1_MO90_AR.
*/
#define	CAN1_MOAR90	(CAN1_MO90_AR)

/** \brief  1B5C, Message Object  Control Register */
#define CAN1_MO90_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029B5Cu)

/** Alias (User Manual Name) for CAN1_MO90_CTR.
* To use register names with standard convension, please use CAN1_MO90_CTR.
*/
#define	CAN1_MOCTR90	(CAN1_MO90_CTR)

