leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO92_EDATA4.
* To use register names with standard convension, please use CAN1_MO92_EDATA4.
*/
#define	CAN1_EMO92DATA4	(CAN1_MO92_EDATA4)

/** \brief  1B94, Message Object  Data Register High */
#define CAN1_MO92_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029B94u)

/** Alias (User Manual Name) for CAN1_MO92_EDATA5.
* To use register names with standard convension, please use CAN1_MO92_EDATA5.
*/
#define	CAN1_EMO92DATA5	(CAN1_MO92_EDATA5)

/** \brief  1B98, Message Object  Arbitration Register */
#define CAN1_MO92_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029B98u)

/** Alias (User Manual Name) for CAN1_MO92_EDATA6.
* To use register names with standard convension, please use CAN1_MO92_EDATA6.
*/
#define	CAN1_EMO92DATA6	(CAN1_MO92_EDATA6)

/** \brief  1B80, Message Object  Function Control Register */
#define CAN1_MO92_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029B80u)

/** Alias (User Manual Name) for CAN1_MO92_FCR.
* To use register names with standard convension, please use CAN1_MO92_FCR.
*/
#define	CAN1_MOFCR92	(CAN1_MO92_FCR)

/** \brief  1B84, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO92_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029B84u)

/** Alias (User Manual Name) for CAN1_MO92_FGPR.
* To use register names with standard convension, please use CAN1_MO92_FGPR.
*/
#define	CAN1_MOFGPR92	(CAN1_MO92_FGPR)

/** \brief  1B88, Message Object  Interrupt Pointer Register */
#define CAN1_MO92_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029B88u)

/** Alias (User Manual Name) for CAN1_MO92_IPR.
* To use register names with standard convension, please use CAN1_MO92_IPR.
*/
#define	CAN1_MOIPR92	(CAN1_MO92_IPR)

/** \brief  1B9C, Message Object  Control Register */
#define CAN1_MO92_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029B9Cu)

/** Alias (User Manual Name) for CAN1_MO92_STAT.
* To use register names with standard convension, please use CAN1_MO92_STAT.
*/
#define	CAN1_MOSTAT92	(CAN1_MO92_STAT)

/** \brief  1BAC, Message Object  Acceptance Mask Register */
#define CAN1_MO93_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029BACu)

/** Alias (User Manual Name) for CAN1_MO93_AMR.
* To use register names with standard convension, please use CAN1_MO93_AMR.
*/
#define	CAN1_MOAMR93	(CAN1_MO93_AMR)

/** \brief  1BB8, Message Object  Arbitration Register */
#define CAN1_MO93_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029BB8u)

/** Alias (User Manual Name) for CAN1_MO93_AR.
* To use register names with standard convension, please use CAN1_MO93_AR.
*/
#define	CAN1_MOAR93	(CAN1_MO93_AR)

/** \brief  1BBC, Message Object  Control Register */
#define CAN1_MO93_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029BBCu)

/** Alias (User Manual Name) for CAN1_MO93_CTR.
* To use register names with standard convension, please use CAN1_MO93_CTR.
*/
#define	CAN1_MOCTR93	(CAN1_MO93_CTR)

/** \brief  1BB4, Message Object  Data Register High */
#define CAN1_MO93_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029BB4u)

/** Alias (User Manual Name) for CAN1_MO93_DATAH.
* To use register names with standard convension, please use CAN1_MO93_DATAH.
*/
#define	CAN1_MODATAH93	(CAN1_MO93_DATAH)

/** \brief  1BB0, Message Object  Data Register Low */
#define CAN1_MO93_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029BB0u)

/** Alias (User Manual Name) for CAN1_MO93_DATAL.
* To use register names with standard convension, please use CAN1_MO93_DATAL.
*/
#define	CAN1_MODATAL93	(CAN1_MO93_DATAL)

/** \brief  1BA0, Message Object  Function Control Register */
#define CAN1_MO93_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029BA0u)

/** Alias (User Manual Name) for CAN1_MO93_EDATA0.
* To use register names with standard convension, please use CAN1_MO93_EDATA0.
*/
#define	CAN1_EMO93DATA0	(CAN1_MO93_EDATA0)

/** \brief  1BA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO93_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029BA4u)

/** Alias (User Manual Name) for CAN1_MO93_EDATA1.
* To use register names with standard convension, please use CAN1_MO93_EDATA1.
*/
#define	CAN1_EMO93DATA1	(CAN1_MO93_EDATA1)

/** \brief  1BA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO93_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029BA8u)

/** Alias (User Manual Name) for CAN1_MO93_EDATA2.
* To use register names with standard convension, please use CAN1_MO93_EDATA2.
*/
#define	CAN1_EMO93DATA2	(CAN1_MO93_EDATA2)

/** \brief  1BAC, Message Object  Acceptance Mask Register */
#define CAN1_MO93_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029BACu)

/** Alias (User Manual Name) for CAN1_MO93_EDATA3.
* To use register names with standard convension, please use CAN1_MO93_EDATA3.
*/
#define	CAN1_EMO93DATA3	(CAN1_MO93_EDATA3)

/** \brief  1BB0, Message Object  Data Register Low */
#define CAN1_MO93_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029BB0u)

/** Alias (User Manual Name) for CAN1_MO93_EDATA4.
* To use register names with standard convension, please use CAN1_MO93_EDATA4.
*/
#define	CAN1_EMO93DATA4	(CAN1_MO93_EDATA4)

/** \brief  1BB4, Message Object  Data Register High */
#define CAN1_MO93_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029BB4u)

/** Alias (User Manual Name) for CAN1_MO93_EDATA5.
* To use register names with standard convension, please use CAN1_MO93_EDATA5.
*/
#define	CAN1_EMO93DATA5	(CAN1_MO93_EDATA5)

/** \brief  1BB8, Message Object  Arbitration Register */
#define CAN1_MO93_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029BB8u)

/** Alias (User Manual Name) for CAN1_MO93_EDATA6.
* To use register names with standard convension, please use CAN1_MO93_EDATA6.
*/
#define	CAN1_EMO93DATA6	(CAN1_MO93_EDATA6)

/** \brief  1BA0, Message Object  Function Control Register */
#define CAN1_MO93_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029BA0u)

/** Alias (User Manual Name) for CAN1_MO93_FCR.
* To use register names with standard convension, please use CAN1_MO93_FCR.
*/
#define	CAN1_MOFCR93	(CAN1_MO93_FCR)

/** \brief  1BA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO93_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029BA4u)

