leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO93_FGPR.
* To use register names with standard convension, please use CAN1_MO93_FGPR.
*/
#define	CAN1_MOFGPR93	(CAN1_MO93_FGPR)

/** \brief  1BA8, Message Object  Interrupt Pointer Register */
#define CAN1_MO93_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029BA8u)

/** Alias (User Manual Name) for CAN1_MO93_IPR.
* To use register names with standard convension, please use CAN1_MO93_IPR.
*/
#define	CAN1_MOIPR93	(CAN1_MO93_IPR)

/** \brief  1BBC, Message Object  Control Register */
#define CAN1_MO93_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029BBCu)

/** Alias (User Manual Name) for CAN1_MO93_STAT.
* To use register names with standard convension, please use CAN1_MO93_STAT.
*/
#define	CAN1_MOSTAT93	(CAN1_MO93_STAT)

/** \brief  1BCC, Message Object  Acceptance Mask Register */
#define CAN1_MO94_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029BCCu)

/** Alias (User Manual Name) for CAN1_MO94_AMR.
* To use register names with standard convension, please use CAN1_MO94_AMR.
*/
#define	CAN1_MOAMR94	(CAN1_MO94_AMR)

/** \brief  1BD8, Message Object  Arbitration Register */
#define CAN1_MO94_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029BD8u)

/** Alias (User Manual Name) for CAN1_MO94_AR.
* To use register names with standard convension, please use CAN1_MO94_AR.
*/
#define	CAN1_MOAR94	(CAN1_MO94_AR)

/** \brief  1BDC, Message Object  Control Register */
#define CAN1_MO94_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029BDCu)

/** Alias (User Manual Name) for CAN1_MO94_CTR.
* To use register names with standard convension, please use CAN1_MO94_CTR.
*/
#define	CAN1_MOCTR94	(CAN1_MO94_CTR)

/** \brief  1BD4, Message Object  Data Register High */
#define CAN1_MO94_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029BD4u)

/** Alias (User Manual Name) for CAN1_MO94_DATAH.
* To use register names with standard convension, please use CAN1_MO94_DATAH.
*/
#define	CAN1_MODATAH94	(CAN1_MO94_DATAH)

/** \brief  1BD0, Message Object  Data Register Low */
#define CAN1_MO94_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029BD0u)

/** Alias (User Manual Name) for CAN1_MO94_DATAL.
* To use register names with standard convension, please use CAN1_MO94_DATAL.
*/
#define	CAN1_MODATAL94	(CAN1_MO94_DATAL)

/** \brief  1BC0, Message Object  Function Control Register */
#define CAN1_MO94_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029BC0u)

/** Alias (User Manual Name) for CAN1_MO94_EDATA0.
* To use register names with standard convension, please use CAN1_MO94_EDATA0.
*/
#define	CAN1_EMO94DATA0	(CAN1_MO94_EDATA0)

/** \brief  1BC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO94_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029BC4u)

/** Alias (User Manual Name) for CAN1_MO94_EDATA1.
* To use register names with standard convension, please use CAN1_MO94_EDATA1.
*/
#define	CAN1_EMO94DATA1	(CAN1_MO94_EDATA1)

/** \brief  1BC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO94_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029BC8u)

/** Alias (User Manual Name) for CAN1_MO94_EDATA2.
* To use register names with standard convension, please use CAN1_MO94_EDATA2.
*/
#define	CAN1_EMO94DATA2	(CAN1_MO94_EDATA2)

/** \brief  1BCC, Message Object  Acceptance Mask Register */
#define CAN1_MO94_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029BCCu)

/** Alias (User Manual Name) for CAN1_MO94_EDATA3.
* To use register names with standard convension, please use CAN1_MO94_EDATA3.
*/
#define	CAN1_EMO94DATA3	(CAN1_MO94_EDATA3)

/** \brief  1BD0, Message Object  Data Register Low */
#define CAN1_MO94_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029BD0u)

/** Alias (User Manual Name) for CAN1_MO94_EDATA4.
* To use register names with standard convension, please use CAN1_MO94_EDATA4.
*/
#define	CAN1_EMO94DATA4	(CAN1_MO94_EDATA4)

/** \brief  1BD4, Message Object  Data Register High */
#define CAN1_MO94_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029BD4u)

/** Alias (User Manual Name) for CAN1_MO94_EDATA5.
* To use register names with standard convension, please use CAN1_MO94_EDATA5.
*/
#define	CAN1_EMO94DATA5	(CAN1_MO94_EDATA5)

/** \brief  1BD8, Message Object  Arbitration Register */
#define CAN1_MO94_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029BD8u)

/** Alias (User Manual Name) for CAN1_MO94_EDATA6.
* To use register names with standard convension, please use CAN1_MO94_EDATA6.
*/
#define	CAN1_EMO94DATA6	(CAN1_MO94_EDATA6)

/** \brief  1BC0, Message Object  Function Control Register */
#define CAN1_MO94_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029BC0u)

/** Alias (User Manual Name) for CAN1_MO94_FCR.
* To use register names with standard convension, please use CAN1_MO94_FCR.
*/
#define	CAN1_MOFCR94	(CAN1_MO94_FCR)

/** \brief  1BC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO94_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029BC4u)

/** Alias (User Manual Name) for CAN1_MO94_FGPR.
* To use register names with standard convension, please use CAN1_MO94_FGPR.
*/
#define	CAN1_MOFGPR94	(CAN1_MO94_FGPR)

/** \brief  1BC8, Message Object  Interrupt Pointer Register */
#define CAN1_MO94_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029BC8u)

/** Alias (User Manual Name) for CAN1_MO94_IPR.
* To use register names with standard convension, please use CAN1_MO94_IPR.
*/
#define	CAN1_MOIPR94	(CAN1_MO94_IPR)

/** \brief  1BDC, Message Object  Control Register */
#define CAN1_MO94_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029BDCu)

/** Alias (User Manual Name) for CAN1_MO94_STAT.
* To use register names with standard convension, please use CAN1_MO94_STAT.
*/
#define	CAN1_MOSTAT94	(CAN1_MO94_STAT)

/** \brief  1BEC, Message Object  Acceptance Mask Register */
#define CAN1_MO95_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029BECu)

/** Alias (User Manual Name) for CAN1_MO95_AMR.
* To use register names with standard convension, please use CAN1_MO95_AMR.
*/
#define	CAN1_MOAMR95	(CAN1_MO95_AMR)

