leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO96_DATAL.
* To use register names with standard convension, please use CAN1_MO96_DATAL.
*/
#define	CAN1_MODATAL96	(CAN1_MO96_DATAL)

/** \brief  1C00, Message Object  Function Control Register */
#define CAN1_MO96_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029C00u)

/** Alias (User Manual Name) for CAN1_MO96_EDATA0.
* To use register names with standard convension, please use CAN1_MO96_EDATA0.
*/
#define	CAN1_EMO96DATA0	(CAN1_MO96_EDATA0)

/** \brief  1C04, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO96_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029C04u)

/** Alias (User Manual Name) for CAN1_MO96_EDATA1.
* To use register names with standard convension, please use CAN1_MO96_EDATA1.
*/
#define	CAN1_EMO96DATA1	(CAN1_MO96_EDATA1)

/** \brief  1C08, Message Object  Interrupt Pointer Register */
#define CAN1_MO96_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029C08u)

/** Alias (User Manual Name) for CAN1_MO96_EDATA2.
* To use register names with standard convension, please use CAN1_MO96_EDATA2.
*/
#define	CAN1_EMO96DATA2	(CAN1_MO96_EDATA2)

/** \brief  1C0C, Message Object  Acceptance Mask Register */
#define CAN1_MO96_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029C0Cu)

/** Alias (User Manual Name) for CAN1_MO96_EDATA3.
* To use register names with standard convension, please use CAN1_MO96_EDATA3.
*/
#define	CAN1_EMO96DATA3	(CAN1_MO96_EDATA3)

/** \brief  1C10, Message Object  Data Register Low */
#define CAN1_MO96_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029C10u)

/** Alias (User Manual Name) for CAN1_MO96_EDATA4.
* To use register names with standard convension, please use CAN1_MO96_EDATA4.
*/
#define	CAN1_EMO96DATA4	(CAN1_MO96_EDATA4)

/** \brief  1C14, Message Object  Data Register High */
#define CAN1_MO96_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029C14u)

/** Alias (User Manual Name) for CAN1_MO96_EDATA5.
* To use register names with standard convension, please use CAN1_MO96_EDATA5.
*/
#define	CAN1_EMO96DATA5	(CAN1_MO96_EDATA5)

/** \brief  1C18, Message Object  Arbitration Register */
#define CAN1_MO96_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029C18u)

/** Alias (User Manual Name) for CAN1_MO96_EDATA6.
* To use register names with standard convension, please use CAN1_MO96_EDATA6.
*/
#define	CAN1_EMO96DATA6	(CAN1_MO96_EDATA6)

/** \brief  1C00, Message Object  Function Control Register */
#define CAN1_MO96_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C00u)

/** Alias (User Manual Name) for CAN1_MO96_FCR.
* To use register names with standard convension, please use CAN1_MO96_FCR.
*/
#define	CAN1_MOFCR96	(CAN1_MO96_FCR)

/** \brief  1C04, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO96_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C04u)

/** Alias (User Manual Name) for CAN1_MO96_FGPR.
* To use register names with standard convension, please use CAN1_MO96_FGPR.
*/
#define	CAN1_MOFGPR96	(CAN1_MO96_FGPR)

/** \brief  1C08, Message Object  Interrupt Pointer Register */
#define CAN1_MO96_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C08u)

/** Alias (User Manual Name) for CAN1_MO96_IPR.
* To use register names with standard convension, please use CAN1_MO96_IPR.
*/
#define	CAN1_MOIPR96	(CAN1_MO96_IPR)

/** \brief  1C1C, Message Object  Control Register */
#define CAN1_MO96_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029C1Cu)

/** Alias (User Manual Name) for CAN1_MO96_STAT.
* To use register names with standard convension, please use CAN1_MO96_STAT.
*/
#define	CAN1_MOSTAT96	(CAN1_MO96_STAT)

/** \brief  1C2C, Message Object  Acceptance Mask Register */
#define CAN1_MO97_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C2Cu)

/** Alias (User Manual Name) for CAN1_MO97_AMR.
* To use register names with standard convension, please use CAN1_MO97_AMR.
*/
#define	CAN1_MOAMR97	(CAN1_MO97_AMR)

/** \brief  1C38, Message Object  Arbitration Register */
#define CAN1_MO97_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C38u)

/** Alias (User Manual Name) for CAN1_MO97_AR.
* To use register names with standard convension, please use CAN1_MO97_AR.
*/
#define	CAN1_MOAR97	(CAN1_MO97_AR)

/** \brief  1C3C, Message Object  Control Register */
#define CAN1_MO97_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029C3Cu)

/** Alias (User Manual Name) for CAN1_MO97_CTR.
* To use register names with standard convension, please use CAN1_MO97_CTR.
*/
#define	CAN1_MOCTR97	(CAN1_MO97_CTR)

/** \brief  1C34, Message Object  Data Register High */
#define CAN1_MO97_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C34u)

/** Alias (User Manual Name) for CAN1_MO97_DATAH.
* To use register names with standard convension, please use CAN1_MO97_DATAH.
*/
#define	CAN1_MODATAH97	(CAN1_MO97_DATAH)

/** \brief  1C30, Message Object  Data Register Low */
#define CAN1_MO97_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C30u)

/** Alias (User Manual Name) for CAN1_MO97_DATAL.
* To use register names with standard convension, please use CAN1_MO97_DATAL.
*/
#define	CAN1_MODATAL97	(CAN1_MO97_DATAL)

/** \brief  1C20, Message Object  Function Control Register */
#define CAN1_MO97_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029C20u)

/** Alias (User Manual Name) for CAN1_MO97_EDATA0.
* To use register names with standard convension, please use CAN1_MO97_EDATA0.
*/
#define	CAN1_EMO97DATA0	(CAN1_MO97_EDATA0)

/** \brief  1C24, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO97_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029C24u)

/** Alias (User Manual Name) for CAN1_MO97_EDATA1.
* To use register names with standard convension, please use CAN1_MO97_EDATA1.
*/
#define	CAN1_EMO97DATA1	(CAN1_MO97_EDATA1)

/** \brief  1C28, Message Object  Interrupt Pointer Register */
#define CAN1_MO97_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029C28u)

/** Alias (User Manual Name) for CAN1_MO97_EDATA2.
* To use register names with standard convension, please use CAN1_MO97_EDATA2.
*/
#define	CAN1_EMO97DATA2	(CAN1_MO97_EDATA2)

/** \brief  1C2C, Message Object  Acceptance Mask Register */
#define CAN1_MO97_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029C2Cu)

