leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO97_EDATA3.
* To use register names with standard convension, please use CAN1_MO97_EDATA3.
*/
#define	CAN1_EMO97DATA3	(CAN1_MO97_EDATA3)

/** \brief  1C30, Message Object  Data Register Low */
#define CAN1_MO97_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029C30u)

/** Alias (User Manual Name) for CAN1_MO97_EDATA4.
* To use register names with standard convension, please use CAN1_MO97_EDATA4.
*/
#define	CAN1_EMO97DATA4	(CAN1_MO97_EDATA4)

/** \brief  1C34, Message Object  Data Register High */
#define CAN1_MO97_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029C34u)

/** Alias (User Manual Name) for CAN1_MO97_EDATA5.
* To use register names with standard convension, please use CAN1_MO97_EDATA5.
*/
#define	CAN1_EMO97DATA5	(CAN1_MO97_EDATA5)

/** \brief  1C38, Message Object  Arbitration Register */
#define CAN1_MO97_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029C38u)

/** Alias (User Manual Name) for CAN1_MO97_EDATA6.
* To use register names with standard convension, please use CAN1_MO97_EDATA6.
*/
#define	CAN1_EMO97DATA6	(CAN1_MO97_EDATA6)

/** \brief  1C20, Message Object  Function Control Register */
#define CAN1_MO97_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C20u)

/** Alias (User Manual Name) for CAN1_MO97_FCR.
* To use register names with standard convension, please use CAN1_MO97_FCR.
*/
#define	CAN1_MOFCR97	(CAN1_MO97_FCR)

/** \brief  1C24, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO97_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C24u)

/** Alias (User Manual Name) for CAN1_MO97_FGPR.
* To use register names with standard convension, please use CAN1_MO97_FGPR.
*/
#define	CAN1_MOFGPR97	(CAN1_MO97_FGPR)

/** \brief  1C28, Message Object  Interrupt Pointer Register */
#define CAN1_MO97_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C28u)

/** Alias (User Manual Name) for CAN1_MO97_IPR.
* To use register names with standard convension, please use CAN1_MO97_IPR.
*/
#define	CAN1_MOIPR97	(CAN1_MO97_IPR)

/** \brief  1C3C, Message Object  Control Register */
#define CAN1_MO97_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029C3Cu)

/** Alias (User Manual Name) for CAN1_MO97_STAT.
* To use register names with standard convension, please use CAN1_MO97_STAT.
*/
#define	CAN1_MOSTAT97	(CAN1_MO97_STAT)

/** \brief  1C4C, Message Object  Acceptance Mask Register */
#define CAN1_MO98_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C4Cu)

/** Alias (User Manual Name) for CAN1_MO98_AMR.
* To use register names with standard convension, please use CAN1_MO98_AMR.
*/
#define	CAN1_MOAMR98	(CAN1_MO98_AMR)

/** \brief  1C58, Message Object  Arbitration Register */
#define CAN1_MO98_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C58u)

/** Alias (User Manual Name) for CAN1_MO98_AR.
* To use register names with standard convension, please use CAN1_MO98_AR.
*/
#define	CAN1_MOAR98	(CAN1_MO98_AR)

/** \brief  1C5C, Message Object  Control Register */
#define CAN1_MO98_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029C5Cu)

/** Alias (User Manual Name) for CAN1_MO98_CTR.
* To use register names with standard convension, please use CAN1_MO98_CTR.
*/
#define	CAN1_MOCTR98	(CAN1_MO98_CTR)

/** \brief  1C54, Message Object  Data Register High */
#define CAN1_MO98_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C54u)

/** Alias (User Manual Name) for CAN1_MO98_DATAH.
* To use register names with standard convension, please use CAN1_MO98_DATAH.
*/
#define	CAN1_MODATAH98	(CAN1_MO98_DATAH)

/** \brief  1C50, Message Object  Data Register Low */
#define CAN1_MO98_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C50u)

/** Alias (User Manual Name) for CAN1_MO98_DATAL.
* To use register names with standard convension, please use CAN1_MO98_DATAL.
*/
#define	CAN1_MODATAL98	(CAN1_MO98_DATAL)

/** \brief  1C40, Message Object  Function Control Register */
#define CAN1_MO98_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029C40u)

/** Alias (User Manual Name) for CAN1_MO98_EDATA0.
* To use register names with standard convension, please use CAN1_MO98_EDATA0.
*/
#define	CAN1_EMO98DATA0	(CAN1_MO98_EDATA0)

/** \brief  1C44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO98_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029C44u)

/** Alias (User Manual Name) for CAN1_MO98_EDATA1.
* To use register names with standard convension, please use CAN1_MO98_EDATA1.
*/
#define	CAN1_EMO98DATA1	(CAN1_MO98_EDATA1)

/** \brief  1C48, Message Object  Interrupt Pointer Register */
#define CAN1_MO98_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029C48u)

/** Alias (User Manual Name) for CAN1_MO98_EDATA2.
* To use register names with standard convension, please use CAN1_MO98_EDATA2.
*/
#define	CAN1_EMO98DATA2	(CAN1_MO98_EDATA2)

/** \brief  1C4C, Message Object  Acceptance Mask Register */
#define CAN1_MO98_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029C4Cu)

/** Alias (User Manual Name) for CAN1_MO98_EDATA3.
* To use register names with standard convension, please use CAN1_MO98_EDATA3.
*/
#define	CAN1_EMO98DATA3	(CAN1_MO98_EDATA3)

/** \brief  1C50, Message Object  Data Register Low */
#define CAN1_MO98_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029C50u)

/** Alias (User Manual Name) for CAN1_MO98_EDATA4.
* To use register names with standard convension, please use CAN1_MO98_EDATA4.
*/
#define	CAN1_EMO98DATA4	(CAN1_MO98_EDATA4)

/** \brief  1C54, Message Object  Data Register High */
#define CAN1_MO98_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029C54u)

/** Alias (User Manual Name) for CAN1_MO98_EDATA5.
* To use register names with standard convension, please use CAN1_MO98_EDATA5.
*/
#define	CAN1_EMO98DATA5	(CAN1_MO98_EDATA5)

/** \brief  1C58, Message Object  Arbitration Register */
#define CAN1_MO98_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029C58u)

