leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** Alias (User Manual Name) for CAN1_MO98_EDATA6.
* To use register names with standard convension, please use CAN1_MO98_EDATA6.
*/
#define	CAN1_EMO98DATA6	(CAN1_MO98_EDATA6)

/** \brief  1C40, Message Object  Function Control Register */
#define CAN1_MO98_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C40u)

/** Alias (User Manual Name) for CAN1_MO98_FCR.
* To use register names with standard convension, please use CAN1_MO98_FCR.
*/
#define	CAN1_MOFCR98	(CAN1_MO98_FCR)

/** \brief  1C44, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO98_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C44u)

/** Alias (User Manual Name) for CAN1_MO98_FGPR.
* To use register names with standard convension, please use CAN1_MO98_FGPR.
*/
#define	CAN1_MOFGPR98	(CAN1_MO98_FGPR)

/** \brief  1C48, Message Object  Interrupt Pointer Register */
#define CAN1_MO98_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C48u)

/** Alias (User Manual Name) for CAN1_MO98_IPR.
* To use register names with standard convension, please use CAN1_MO98_IPR.
*/
#define	CAN1_MOIPR98	(CAN1_MO98_IPR)

/** \brief  1C5C, Message Object  Control Register */
#define CAN1_MO98_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029C5Cu)

/** Alias (User Manual Name) for CAN1_MO98_STAT.
* To use register names with standard convension, please use CAN1_MO98_STAT.
*/
#define	CAN1_MOSTAT98	(CAN1_MO98_STAT)

/** \brief  1C6C, Message Object  Acceptance Mask Register */
#define CAN1_MO99_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C6Cu)

/** Alias (User Manual Name) for CAN1_MO99_AMR.
* To use register names with standard convension, please use CAN1_MO99_AMR.
*/
#define	CAN1_MOAMR99	(CAN1_MO99_AMR)

/** \brief  1C78, Message Object  Arbitration Register */
#define CAN1_MO99_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C78u)

/** Alias (User Manual Name) for CAN1_MO99_AR.
* To use register names with standard convension, please use CAN1_MO99_AR.
*/
#define	CAN1_MOAR99	(CAN1_MO99_AR)

/** \brief  1C7C, Message Object  Control Register */
#define CAN1_MO99_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029C7Cu)

/** Alias (User Manual Name) for CAN1_MO99_CTR.
* To use register names with standard convension, please use CAN1_MO99_CTR.
*/
#define	CAN1_MOCTR99	(CAN1_MO99_CTR)

/** \brief  1C74, Message Object  Data Register High */
#define CAN1_MO99_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C74u)

/** Alias (User Manual Name) for CAN1_MO99_DATAH.
* To use register names with standard convension, please use CAN1_MO99_DATAH.
*/
#define	CAN1_MODATAH99	(CAN1_MO99_DATAH)

/** \brief  1C70, Message Object  Data Register Low */
#define CAN1_MO99_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C70u)

/** Alias (User Manual Name) for CAN1_MO99_DATAL.
* To use register names with standard convension, please use CAN1_MO99_DATAL.
*/
#define	CAN1_MODATAL99	(CAN1_MO99_DATAL)

/** \brief  1C60, Message Object  Function Control Register */
#define CAN1_MO99_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029C60u)

/** Alias (User Manual Name) for CAN1_MO99_EDATA0.
* To use register names with standard convension, please use CAN1_MO99_EDATA0.
*/
#define	CAN1_EMO99DATA0	(CAN1_MO99_EDATA0)

/** \brief  1C64, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO99_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029C64u)

/** Alias (User Manual Name) for CAN1_MO99_EDATA1.
* To use register names with standard convension, please use CAN1_MO99_EDATA1.
*/
#define	CAN1_EMO99DATA1	(CAN1_MO99_EDATA1)

/** \brief  1C68, Message Object  Interrupt Pointer Register */
#define CAN1_MO99_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029C68u)

/** Alias (User Manual Name) for CAN1_MO99_EDATA2.
* To use register names with standard convension, please use CAN1_MO99_EDATA2.
*/
#define	CAN1_EMO99DATA2	(CAN1_MO99_EDATA2)

/** \brief  1C6C, Message Object  Acceptance Mask Register */
#define CAN1_MO99_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0029C6Cu)

/** Alias (User Manual Name) for CAN1_MO99_EDATA3.
* To use register names with standard convension, please use CAN1_MO99_EDATA3.
*/
#define	CAN1_EMO99DATA3	(CAN1_MO99_EDATA3)

/** \brief  1C70, Message Object  Data Register Low */
#define CAN1_MO99_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029C70u)

/** Alias (User Manual Name) for CAN1_MO99_EDATA4.
* To use register names with standard convension, please use CAN1_MO99_EDATA4.
*/
#define	CAN1_EMO99DATA4	(CAN1_MO99_EDATA4)

/** \brief  1C74, Message Object  Data Register High */
#define CAN1_MO99_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029C74u)

/** Alias (User Manual Name) for CAN1_MO99_EDATA5.
* To use register names with standard convension, please use CAN1_MO99_EDATA5.
*/
#define	CAN1_EMO99DATA5	(CAN1_MO99_EDATA5)

/** \brief  1C78, Message Object  Arbitration Register */
#define CAN1_MO99_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029C78u)

/** Alias (User Manual Name) for CAN1_MO99_EDATA6.
* To use register names with standard convension, please use CAN1_MO99_EDATA6.
*/
#define	CAN1_EMO99DATA6	(CAN1_MO99_EDATA6)

/** \brief  1C60, Message Object  Function Control Register */
#define CAN1_MO99_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C60u)

/** Alias (User Manual Name) for CAN1_MO99_FCR.
* To use register names with standard convension, please use CAN1_MO99_FCR.
*/
#define	CAN1_MOFCR99	(CAN1_MO99_FCR)

/** \brief  1C64, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO99_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C64u)

/** Alias (User Manual Name) for CAN1_MO99_FGPR.
* To use register names with standard convension, please use CAN1_MO99_FGPR.
*/
#define	CAN1_MOFGPR99	(CAN1_MO99_FGPR)

/** \brief  1C68, Message Object  Interrupt Pointer Register */
#define CAN1_MO99_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C68u)

/** Alias (User Manual Name) for CAN1_MO99_IPR.
* To use register names with standard convension, please use CAN1_MO99_IPR.
*/
#define	CAN1_MOIPR99	(CAN1_MO99_IPR)

