leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  1C7C, Message Object  Control Register */
#define CAN1_MO99_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029C7Cu)

/** Alias (User Manual Name) for CAN1_MO99_STAT.
* To use register names with standard convension, please use CAN1_MO99_STAT.
*/
#define	CAN1_MOSTAT99	(CAN1_MO99_STAT)

/** \brief  112C, Message Object  Acceptance Mask Register */
#define CAN1_MO9_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002912Cu)

/** Alias (User Manual Name) for CAN1_MO9_AMR.
* To use register names with standard convension, please use CAN1_MO9_AMR.
*/
#define	CAN1_MOAMR9	(CAN1_MO9_AMR)

/** \brief  1138, Message Object  Arbitration Register */
#define CAN1_MO9_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029138u)

/** Alias (User Manual Name) for CAN1_MO9_AR.
* To use register names with standard convension, please use CAN1_MO9_AR.
*/
#define	CAN1_MOAR9	(CAN1_MO9_AR)

/** \brief  113C, Message Object  Control Register */
#define CAN1_MO9_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002913Cu)

/** Alias (User Manual Name) for CAN1_MO9_CTR.
* To use register names with standard convension, please use CAN1_MO9_CTR.
*/
#define	CAN1_MOCTR9	(CAN1_MO9_CTR)

/** \brief  1134, Message Object  Data Register High */
#define CAN1_MO9_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029134u)

/** Alias (User Manual Name) for CAN1_MO9_DATAH.
* To use register names with standard convension, please use CAN1_MO9_DATAH.
*/
#define	CAN1_MODATAH9	(CAN1_MO9_DATAH)

/** \brief  1130, Message Object  Data Register Low */
#define CAN1_MO9_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029130u)

/** Alias (User Manual Name) for CAN1_MO9_DATAL.
* To use register names with standard convension, please use CAN1_MO9_DATAL.
*/
#define	CAN1_MODATAL9	(CAN1_MO9_DATAL)

/** \brief  1120, Message Object  Function Control Register */
#define CAN1_MO9_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0029120u)

/** Alias (User Manual Name) for CAN1_MO9_EDATA0.
* To use register names with standard convension, please use CAN1_MO9_EDATA0.
*/
#define	CAN1_EMO9DATA0	(CAN1_MO9_EDATA0)

/** \brief  1124, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO9_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0029124u)

/** Alias (User Manual Name) for CAN1_MO9_EDATA1.
* To use register names with standard convension, please use CAN1_MO9_EDATA1.
*/
#define	CAN1_EMO9DATA1	(CAN1_MO9_EDATA1)

/** \brief  1128, Message Object  Interrupt Pointer Register */
#define CAN1_MO9_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0029128u)

/** Alias (User Manual Name) for CAN1_MO9_EDATA2.
* To use register names with standard convension, please use CAN1_MO9_EDATA2.
*/
#define	CAN1_EMO9DATA2	(CAN1_MO9_EDATA2)

/** \brief  112C, Message Object  Acceptance Mask Register */
#define CAN1_MO9_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF002912Cu)

/** Alias (User Manual Name) for CAN1_MO9_EDATA3.
* To use register names with standard convension, please use CAN1_MO9_EDATA3.
*/
#define	CAN1_EMO9DATA3	(CAN1_MO9_EDATA3)

/** \brief  1130, Message Object  Data Register Low */
#define CAN1_MO9_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0029130u)

/** Alias (User Manual Name) for CAN1_MO9_EDATA4.
* To use register names with standard convension, please use CAN1_MO9_EDATA4.
*/
#define	CAN1_EMO9DATA4	(CAN1_MO9_EDATA4)

/** \brief  1134, Message Object  Data Register High */
#define CAN1_MO9_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0029134u)

/** Alias (User Manual Name) for CAN1_MO9_EDATA5.
* To use register names with standard convension, please use CAN1_MO9_EDATA5.
*/
#define	CAN1_EMO9DATA5	(CAN1_MO9_EDATA5)

/** \brief  1138, Message Object  Arbitration Register */
#define CAN1_MO9_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0029138u)

/** Alias (User Manual Name) for CAN1_MO9_EDATA6.
* To use register names with standard convension, please use CAN1_MO9_EDATA6.
*/
#define	CAN1_EMO9DATA6	(CAN1_MO9_EDATA6)

/** \brief  1120, Message Object  Function Control Register */
#define CAN1_MO9_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029120u)

/** Alias (User Manual Name) for CAN1_MO9_FCR.
* To use register names with standard convension, please use CAN1_MO9_FCR.
*/
#define	CAN1_MOFCR9	(CAN1_MO9_FCR)

/** \brief  1124, Message Object  FIFO/Gateway Pointer Register */
#define CAN1_MO9_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029124u)

/** Alias (User Manual Name) for CAN1_MO9_FGPR.
* To use register names with standard convension, please use CAN1_MO9_FGPR.
*/
#define	CAN1_MOFGPR9	(CAN1_MO9_FGPR)

/** \brief  1128, Message Object  Interrupt Pointer Register */
#define CAN1_MO9_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029128u)

/** Alias (User Manual Name) for CAN1_MO9_IPR.
* To use register names with standard convension, please use CAN1_MO9_IPR.
*/
#define	CAN1_MOIPR9	(CAN1_MO9_IPR)

/** \brief  113C, Message Object  Control Register */
#define CAN1_MO9_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002913Cu)

/** Alias (User Manual Name) for CAN1_MO9_STAT.
* To use register names with standard convension, please use CAN1_MO9_STAT.
*/
#define	CAN1_MOSTAT9	(CAN1_MO9_STAT)

/** \brief  180, Message Index Register */
#define CAN1_MSID0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028180u)

/** \brief  184, Message Index Register */
#define CAN1_MSID1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028184u)

/** \brief  188, Message Index Register */
#define CAN1_MSID2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028188u)

/** \brief  18C, Message Index Register */
#define CAN1_MSID3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF002818Cu)

/** \brief  190, Message Index Register */
#define CAN1_MSID4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028190u)

/** \brief  194, Message Index Register */
#define CAN1_MSID5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028194u)

/** \brief  198, Message Index Register */
#define CAN1_MSID6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028198u)

/** \brief  19C, Message Index Register */
#define CAN1_MSID7 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF002819Cu)

/** \brief  1C0, Message Index Mask Register */
#define CAN1_MSIMASK /*lint --e(923)*/ (*(volatile Ifx_CAN_MSIMASK*)0xF00281C0u)

/** \brief  140, Message Pending Register */
#define CAN1_MSPND0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028140u)

/** \brief  144, Message Pending Register */
#define CAN1_MSPND1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028144u)

/** \brief  148, Message Pending Register */
#define CAN1_MSPND2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028148u)

