leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  14C, Message Pending Register */
#define CAN1_MSPND3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF002814Cu)

/** \brief  150, Message Pending Register */
#define CAN1_MSPND4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028150u)

/** \brief  154, Message Pending Register */
#define CAN1_MSPND5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028154u)

/** \brief  158, Message Pending Register */
#define CAN1_MSPND6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028158u)

/** \brief  15C, Message Pending Register */
#define CAN1_MSPND7 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF002815Cu)

/** \brief  210, Node Bit Timing Register */
#define CAN1_N0_BTEVR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTEVR*)0xF0028210u)

/** Alias (User Manual Name) for CAN1_N0_BTEVR.
* To use register names with standard convension, please use CAN1_N0_BTEVR.
*/
#define	CAN1_NBTEVR0	(CAN1_N0_BTEVR)

/** \brief  210, Node Bit Timing Register */
#define CAN1_N0_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028210u)

/** Alias (User Manual Name) for CAN1_N0_BTR.
* To use register names with standard convension, please use CAN1_N0_BTR.
*/
#define	CAN1_NBTR0	(CAN1_N0_BTR)

/** \brief  200, Node Control Register */
#define CAN1_N0_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028200u)

/** Alias (User Manual Name) for CAN1_N0_CR.
* To use register names with standard convension, please use CAN1_N0_CR.
*/
#define	CAN1_NCR0	(CAN1_N0_CR)

/** \brief  214, Node Error Counter Register */
#define CAN1_N0_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028214u)

/** Alias (User Manual Name) for CAN1_N0_ECNT.
* To use register names with standard convension, please use CAN1_N0_ECNT.
*/
#define	CAN1_NECNT0	(CAN1_N0_ECNT)

/** \brief  238, Fast Node Bit Timing Register */
#define CAN1_N0_FBTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FBTR*)0xF0028238u)

/** Alias (User Manual Name) for CAN1_N0_FBTR.
* To use register names with standard convension, please use CAN1_N0_FBTR.
*/
#define	CAN1_FNBTR0	(CAN1_N0_FBTR)

/** \brief  218, Node Frame Counter Register */
#define CAN1_N0_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028218u)

/** Alias (User Manual Name) for CAN1_N0_FCR.
* To use register names with standard convension, please use CAN1_N0_FCR.
*/
#define	CAN1_NFCR0	(CAN1_N0_FCR)

/** \brief  208, Node Interrupt Pointer Register */
#define CAN1_N0_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028208u)

/** Alias (User Manual Name) for CAN1_N0_IPR.
* To use register names with standard convension, please use CAN1_N0_IPR.
*/
#define	CAN1_NIPR0	(CAN1_N0_IPR)

/** \brief  20C, Node Port Control Register */
#define CAN1_N0_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002820Cu)

/** Alias (User Manual Name) for CAN1_N0_PCR.
* To use register names with standard convension, please use CAN1_N0_PCR.
*/
#define	CAN1_NPCR0	(CAN1_N0_PCR)

/** \brief  204, Node Status Register */
#define CAN1_N0_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028204u)

/** Alias (User Manual Name) for CAN1_N0_SR.
* To use register names with standard convension, please use CAN1_N0_SR.
*/
#define	CAN1_NSR0	(CAN1_N0_SR)

/** \brief  224, Node Timer A Transmit Trigger Register */
#define CAN1_N0_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028224u)

/** Alias (User Manual Name) for CAN1_N0_TATTR.
* To use register names with standard convension, please use CAN1_N0_TATTR.
*/
#define	CAN1_NTATTR0	(CAN1_N0_TATTR)

/** \brief  228, Node Timer B Transmit Trigger Register */
#define CAN1_N0_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028228u)

/** Alias (User Manual Name) for CAN1_N0_TBTTR.
* To use register names with standard convension, please use CAN1_N0_TBTTR.
*/
#define	CAN1_NTBTTR0	(CAN1_N0_TBTTR)

/** \brief  21C, Node Timer Clock Control Register */
#define CAN1_N0_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002821Cu)

/** Alias (User Manual Name) for CAN1_N0_TCCR.
* To use register names with standard convension, please use CAN1_N0_TCCR.
*/
#define	CAN1_NTCCR0	(CAN1_N0_TCCR)

/** \brief  22C, Node Timer C Transmit Trigger Register */
#define CAN1_N0_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002822Cu)

/** Alias (User Manual Name) for CAN1_N0_TCTTR.
* To use register names with standard convension, please use CAN1_N0_TCTTR.
*/
#define	CAN1_NTCTTR0	(CAN1_N0_TCTTR)

/** \brief  23C, Node Transmitter Delay Compensation Register */
#define CAN1_N0_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF002823Cu)

/** Alias (User Manual Name) for CAN1_N0_TDCR.
* To use register names with standard convension, please use CAN1_N0_TDCR.
*/
#define	CAN1_NTDCR0	(CAN1_N0_TDCR)

/** \brief  220, Node Timer Receive Timeout Register */
#define CAN1_N0_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028220u)

/** Alias (User Manual Name) for CAN1_N0_TRTR.
* To use register names with standard convension, please use CAN1_N0_TRTR.
*/
#define	CAN1_NTRTR0	(CAN1_N0_TRTR)

/** \brief  310, Node Bit Timing Register */
#define CAN1_N1_BTEVR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTEVR*)0xF0028310u)

/** Alias (User Manual Name) for CAN1_N1_BTEVR.
* To use register names with standard convension, please use CAN1_N1_BTEVR.
*/
#define	CAN1_NBTEVR1	(CAN1_N1_BTEVR)

/** \brief  310, Node Bit Timing Register */
#define CAN1_N1_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028310u)

/** Alias (User Manual Name) for CAN1_N1_BTR.
* To use register names with standard convension, please use CAN1_N1_BTR.
*/
#define	CAN1_NBTR1	(CAN1_N1_BTR)

/** \brief  300, Node Control Register */
#define CAN1_N1_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028300u)

/** Alias (User Manual Name) for CAN1_N1_CR.
* To use register names with standard convension, please use CAN1_N1_CR.
*/
#define	CAN1_NCR1	(CAN1_N1_CR)

/** \brief  314, Node Error Counter Register */
#define CAN1_N1_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028314u)

/** Alias (User Manual Name) for CAN1_N1_ECNT.
* To use register names with standard convension, please use CAN1_N1_ECNT.
*/
#define	CAN1_NECNT1	(CAN1_N1_ECNT)

/** \brief  338, Fast Node Bit Timing Register */
#define CAN1_N1_FBTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FBTR*)0xF0028338u)

/** Alias (User Manual Name) for CAN1_N1_FBTR.
* To use register names with standard convension, please use CAN1_N1_FBTR.
*/
#define	CAN1_FNBTR1	(CAN1_N1_FBTR)

/** \brief  318, Node Frame Counter Register */
#define CAN1_N1_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028318u)

/** Alias (User Manual Name) for CAN1_N1_FCR.
* To use register names with standard convension, please use CAN1_N1_FCR.
*/
#define	CAN1_NFCR1	(CAN1_N1_FCR)

/** \brief  308, Node Interrupt Pointer Register */
#define CAN1_N1_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028308u)

/** Alias (User Manual Name) for CAN1_N1_IPR.
* To use register names with standard convension, please use CAN1_N1_IPR.
*/
#define	CAN1_NIPR1	(CAN1_N1_IPR)

/** \brief  30C, Node Port Control Register */
#define CAN1_N1_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002830Cu)

/** Alias (User Manual Name) for CAN1_N1_PCR.
* To use register names with standard convension, please use CAN1_N1_PCR.
*/
#define	CAN1_NPCR1	(CAN1_N1_PCR)

