leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_reg.h
/** \brief  304, Node Status Register */
#define CAN1_N1_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028304u)

/** Alias (User Manual Name) for CAN1_N1_SR.
* To use register names with standard convension, please use CAN1_N1_SR.
*/
#define	CAN1_NSR1	(CAN1_N1_SR)

/** \brief  324, Node Timer A Transmit Trigger Register */
#define CAN1_N1_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028324u)

/** Alias (User Manual Name) for CAN1_N1_TATTR.
* To use register names with standard convension, please use CAN1_N1_TATTR.
*/
#define	CAN1_NTATTR1	(CAN1_N1_TATTR)

/** \brief  328, Node Timer B Transmit Trigger Register */
#define CAN1_N1_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028328u)

/** Alias (User Manual Name) for CAN1_N1_TBTTR.
* To use register names with standard convension, please use CAN1_N1_TBTTR.
*/
#define	CAN1_NTBTTR1	(CAN1_N1_TBTTR)

/** \brief  31C, Node Timer Clock Control Register */
#define CAN1_N1_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002831Cu)

/** Alias (User Manual Name) for CAN1_N1_TCCR.
* To use register names with standard convension, please use CAN1_N1_TCCR.
*/
#define	CAN1_NTCCR1	(CAN1_N1_TCCR)

/** \brief  32C, Node Timer C Transmit Trigger Register */
#define CAN1_N1_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002832Cu)

/** Alias (User Manual Name) for CAN1_N1_TCTTR.
* To use register names with standard convension, please use CAN1_N1_TCTTR.
*/
#define	CAN1_NTCTTR1	(CAN1_N1_TCTTR)

/** \brief  33C, Node Transmitter Delay Compensation Register */
#define CAN1_N1_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF002833Cu)

/** Alias (User Manual Name) for CAN1_N1_TDCR.
* To use register names with standard convension, please use CAN1_N1_TDCR.
*/
#define	CAN1_NTDCR1	(CAN1_N1_TDCR)

/** \brief  320, Node Timer Receive Timeout Register */
#define CAN1_N1_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028320u)

/** Alias (User Manual Name) for CAN1_N1_TRTR.
* To use register names with standard convension, please use CAN1_N1_TRTR.
*/
#define	CAN1_NTRTR1	(CAN1_N1_TRTR)

/** \brief  410, Node Bit Timing Register */
#define CAN1_N2_BTEVR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTEVR*)0xF0028410u)

/** Alias (User Manual Name) for CAN1_N2_BTEVR.
* To use register names with standard convension, please use CAN1_N2_BTEVR.
*/
#define	CAN1_NBTEVR2	(CAN1_N2_BTEVR)

/** \brief  410, Node Bit Timing Register */
#define CAN1_N2_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028410u)

/** Alias (User Manual Name) for CAN1_N2_BTR.
* To use register names with standard convension, please use CAN1_N2_BTR.
*/
#define	CAN1_NBTR2	(CAN1_N2_BTR)

/** \brief  400, Node Control Register */
#define CAN1_N2_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028400u)

/** Alias (User Manual Name) for CAN1_N2_CR.
* To use register names with standard convension, please use CAN1_N2_CR.
*/
#define	CAN1_NCR2	(CAN1_N2_CR)

/** \brief  414, Node Error Counter Register */
#define CAN1_N2_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028414u)

/** Alias (User Manual Name) for CAN1_N2_ECNT.
* To use register names with standard convension, please use CAN1_N2_ECNT.
*/
#define	CAN1_NECNT2	(CAN1_N2_ECNT)

/** \brief  438, Fast Node Bit Timing Register */
#define CAN1_N2_FBTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FBTR*)0xF0028438u)

/** Alias (User Manual Name) for CAN1_N2_FBTR.
* To use register names with standard convension, please use CAN1_N2_FBTR.
*/
#define	CAN1_FNBTR2	(CAN1_N2_FBTR)

/** \brief  418, Node Frame Counter Register */
#define CAN1_N2_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028418u)

/** Alias (User Manual Name) for CAN1_N2_FCR.
* To use register names with standard convension, please use CAN1_N2_FCR.
*/
#define	CAN1_NFCR2	(CAN1_N2_FCR)

/** \brief  408, Node Interrupt Pointer Register */
#define CAN1_N2_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028408u)

/** Alias (User Manual Name) for CAN1_N2_IPR.
* To use register names with standard convension, please use CAN1_N2_IPR.
*/
#define	CAN1_NIPR2	(CAN1_N2_IPR)

/** \brief  40C, Node Port Control Register */
#define CAN1_N2_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002840Cu)

/** Alias (User Manual Name) for CAN1_N2_PCR.
* To use register names with standard convension, please use CAN1_N2_PCR.
*/
#define	CAN1_NPCR2	(CAN1_N2_PCR)

/** \brief  404, Node Status Register */
#define CAN1_N2_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028404u)

/** Alias (User Manual Name) for CAN1_N2_SR.
* To use register names with standard convension, please use CAN1_N2_SR.
*/
#define	CAN1_NSR2	(CAN1_N2_SR)

/** \brief  424, Node Timer A Transmit Trigger Register */
#define CAN1_N2_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028424u)

/** Alias (User Manual Name) for CAN1_N2_TATTR.
* To use register names with standard convension, please use CAN1_N2_TATTR.
*/
#define	CAN1_NTATTR2	(CAN1_N2_TATTR)

/** \brief  428, Node Timer B Transmit Trigger Register */
#define CAN1_N2_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028428u)

/** Alias (User Manual Name) for CAN1_N2_TBTTR.
* To use register names with standard convension, please use CAN1_N2_TBTTR.
*/
#define	CAN1_NTBTTR2	(CAN1_N2_TBTTR)

/** \brief  41C, Node Timer Clock Control Register */
#define CAN1_N2_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002841Cu)

/** Alias (User Manual Name) for CAN1_N2_TCCR.
* To use register names with standard convension, please use CAN1_N2_TCCR.
*/
#define	CAN1_NTCCR2	(CAN1_N2_TCCR)

/** \brief  42C, Node Timer C Transmit Trigger Register */
#define CAN1_N2_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002842Cu)

/** Alias (User Manual Name) for CAN1_N2_TCTTR.
* To use register names with standard convension, please use CAN1_N2_TCTTR.
*/
#define	CAN1_NTCTTR2	(CAN1_N2_TCTTR)

/** \brief  43C, Node Transmitter Delay Compensation Register */
#define CAN1_N2_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF002843Cu)

/** Alias (User Manual Name) for CAN1_N2_TDCR.
* To use register names with standard convension, please use CAN1_N2_TDCR.
*/
#define	CAN1_NTDCR2	(CAN1_N2_TDCR)

/** \brief  420, Node Timer Receive Timeout Register */
#define CAN1_N2_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028420u)

/** Alias (User Manual Name) for CAN1_N2_TRTR.
* To use register names with standard convension, please use CAN1_N2_TRTR.
*/
#define	CAN1_NTRTR2	(CAN1_N2_TRTR)

/** \brief  E8, OCDS Control and Status */
#define CAN1_OCS /*lint --e(923)*/ (*(volatile Ifx_CAN_OCS*)0xF00280E8u)

/** \brief  1C4, Panel Control Register */
#define CAN1_PANCTR /*lint --e(923)*/ (*(volatile Ifx_CAN_PANCTR*)0xF00281C4u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCAN_REG_H */
